{
  "primary": "RUNX2",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "HDAC6 interacts with the transcription factor RUNX2, acting as a corepressor for certain target genes while also repressing RUNX2 expression itself, thereby regulating osteogenesis.",
  "functions": [
    {
      "function": "Repression of RUNX2 Gene Expression",
      "arrow": "activates",
      "cellular_process": "In the context of aging, HDAC6 accumulates in bone marrow stromal cells (BMSCs) and binds directly to the promoter of the Runx2 gene.",
      "effect_description": "The recruitment of HDAC6 to the Runx2 promoter leads to deacetylation of local histones. This histone hypoacetylation creates a repressive chromatin state, inactivating Runx2 gene expression at the transcriptional level. This reduction in RUNX2 levels impairs the cell's ability to differentiate into osteoblasts.",
      "biological_consequence": [
        "HDAC6 accumulation during aging → Binding to the Runx2 gene promoter → Histone deacetylation at the Runx2 promoter → Decreased RUNX2 gene transcription → Impaired osteoblast differentiation → Contribution to age-related bone loss."
      ],
      "specific_effects": [
        "Binds to the Runx2 promoter in aged bone marrow stromal cells.",
        "Mediates histone hypoacetylation at the Runx2 promoter.",
        "Inhibition of HDAC6 with Tubastatin A activates Runx2 expression and rescues osteogenesis."
      ],
      "evidence": [
        {
          "paper_title": "HDAC6 inactivates Runx2 promoter to block osteogenesis of bone marrow stromal cells in age-related bone loss of mice",
          "journal": "Stem Cell Research & Therapy",
          "year": 2018,
          "relevant_quote": "In vitro osteogenic differentiation potential of BMSCs from 18-month-old mice was weaker than 6-month-old mice, in which there was Runx2 expression inactivation in BMSCs of 18-month-old mice compared with 6-month-old mice, which was attributable to HDAC6-mediated histone hypoacetylation in Runx2 promoter.",
          "pmid": "34454588"
        }
      ],
      "pathway": {
        "name": "Transcriptional Regulation",
        "canonical_name": "Transcription",
        "ontology_id": "GO:0006351",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "34454588"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    }
  ],
  "arrow": "inhibits",
  "direction": "main_to_primary",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": "The input data is largely correct in identifying two distinct mechanisms. However, the regulation of RUNX2 gene expression by HDAC6 is context-dependent and can be either inhibitory or activating, which is a critical detail. In the context of aging bone marrow stromal cells, HDAC6 represses the Runx2 promoter. Conversely, in thyroid cancer cells, HDAC6 is part of a complex that potentiates RUNX2 transcription.",
  "mechanism": "The transcription factor RUNX2 directly interacts with HDAC6 via its C-terminal domain. This interaction is necessary for the recruitment of the predominantly cytoplasmic HDAC6 into the nucleus and onto chromatin. In the context of aging, HDAC6 accumulates in bone marrow stromal cells (BMSCs) and binds directly to the promoter of the Runx2 gene. In thyroid cancer cells, HDAC6 is part of a transcriptional complex that assembles on the P2 promoter of the RUNX2 gene.",
  "effect": "Once recruited to a RUNX2-bound promoter, such as that of the cell cycle inhibitor p21CIP1/WAF1, HDAC6 functions as a transcriptional corepressor. Its deacetylase activity contributes to the repression of the target gene, thereby regulating tissue-specific gene expression in osteoblasts.; The recruitment of HDAC6 to the Runx2 promoter leads to deacetylation of local histones. This histone hypoacetylation creates a repressive chromatin state, inactivating Runx2 gene expression at the transcriptional level. This reduction in RUNX2 levels impairs the cell's ability to differentiate into osteoblasts.; ...",
  "summary": "HDAC6 regulates RUNX2 to control multiple cellular processes including corepressor of runx2 target genes, repression of runx2 gene expression, and activation of runx2 gene expression, ultimately affecting regulation of cell cycle and osteoblast differentiation.",
  "evidence": [
    {
      "paper_title": "Runx2 (Cbfa1, AML-3) Interacts with Histone Deacetylase 6 and Represses the p21CIP1/WAF1 Promoter",
      "journal": "Molecular and Cellular Biology",
      "year": 2004,
      "relevant_quote": "These data identify Runx2 as the first transcription factor to interact with HDAC6 and suggest that HDAC6 may bind to Runx2 in differentiating osteoblasts to regulate tissue-specific gene expression."
    },
    {
      "paper_title": "HDAC6 inactivates Runx2 promoter to block osteogenesis of bone marrow stromal cells in age-related bone loss of mice",
      "journal": "Stem Cell Research & Therapy",
      "year": 2018,
      "relevant_quote": "In vitro osteogenic differentiation potential of BMSCs from 18-month-old mice was weaker than 6-month-old mice, in which there was Runx2 expression inactivation in BMSCs of 18-month-old mice compared with 6-month-old mice, which was attributable to HDAC6-mediated histone hypoacetylation in Runx2 promoter."
    },
    {
      "paper_title": "HDACs control RUNX2 expression in cancer cells through redundant and cell context-dependent mechanisms",
      "journal": "Journal of Experimental & Clinical Cancer Research",
      "year": 2019,
      "relevant_quote": "Furthermore, we found an additional and cell-specific function of HDAC6 in driving RUNX2 expression in thyroid cancer cells. In this model, HDAC6 likely stabilizes the assembly of the transcriptional complex, which includes HDAC1, on the RUNX2 P2 promoter potentiating its transcription."
    }
  ],
  "pathways": [
    {
      "name": "Transcriptional Regulation",
      "canonical_name": "Transcription",
      "ontology_id": "GO:0006351",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "inhibitory",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 3
  },
  "_arrow_validated": true,
  "arrow_notation": "HDAC6 --inhibits--> RUNX2:",
  "protein_a": "HDAC6",
  "protein_b": "RUNX2",
  "discovered_in_query": "HDAC6",
  "first_discovered": "2025-12-04T16:37:52.704097Z",
  "last_updated": "2025-12-04T16:37:52.704097Z"
}