{
  "primary": "HDAC6",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "HDAC6 is known to interact with and deacetylate the microtubule-associated protein Tau, which is implicated in neurodegenerative diseases.",
  "functions": [
    {
      "function": "Tau Homeostasis (Protective Surveillance)",
      "arrow": "activates",
      "cellular_process": "HDAC6 is part of a chaperone-containing complex that directly binds to and deacetylates the microtubule-associated protein Tau.",
      "effect_description": "As part of a protective surveillance mechanism, HDAC6 deacetylates Tau and suppresses its hyperphosphorylation, particularly within the microtubule-binding region. This action prevents the accumulation of toxic, aberrantly modified Tau species, thereby protecting against neurodegeneration.",
      "biological_consequence": [
        "HDAC6-chaperone complex binds to aberrantly modified Tau → HDAC6 deacetylates Tau → Suppression of Tau hyperphosphorylation → Reduced Tau aggregation and accumulation → Neuroprotection and preservation of cognitive function."
      ],
      "specific_effects": [
        "Directly deacetylates Tau, reducing its acetylation level.",
        "Suppresses hyperphosphorylation of Tau within its microtubule-binding region.",
        "Genetic deletion of HDAC6 in Tau transgenic mice accelerates Tau pathology and cognitive decline."
      ],
      "evidence": [
        {
          "paper_title": "An HDAC6-dependent surveillance mechanism suppresses tau-mediated neurodegeneration and cognitive decline",
          "journal": "Nature Communications",
          "year": 2020,
          "relevant_quote": "Here, we identified an HDAC6-chaperone complex that targets aberrantly modified tau. HDAC6 not only deacetylates tau but also suppresses tau hyperphosphorylation within the microtubule-binding region... Tau transgenic mice lacking HDAC6 show reduced survival characterized by accelerated tau pathology and cognitive decline.",
          "pmid": "33139698"
        }
      ],
      "pathway": {
        "name": "Proteostasis",
        "canonical_name": "Proteostasis",
        "ontology_id": "GO:0006457",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "33139698"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    },
    {
      "function": "Tau Stability (via Hsp90)",
      "arrow": "activates",
      "cellular_process": "HDAC6 deacetylates the chaperone protein Hsp90. Inhibition of HDAC6 leads to Hsp90 hyperacetylation, which in turn reduces Hsp90's affinity for client proteins, including Tau, promoting their degradation.",
      "effect_description": "Pharmacological inhibition of HDAC6 can lead to a reduction in total Tau levels and improved memory in mouse models of tauopathy. This is thought to occur because hyperacetylated Hsp90 is less effective at chaperoning Tau, leading to Tau's clearance via protein degradation pathways.",
      "biological_consequence": [
        "HDAC6 inhibition → Hsp90 hyperacetylation → Reduced binding affinity of Hsp90 for Tau → Enhanced degradation of Tau protein → Reduction in total Tau levels and improved memory."
      ],
      "specific_effects": [
        "Inhibition of HDAC6 with Tubastatin A restored memory function and reduced total Tau levels in rTg4510 mice.",
        "The reduction in total Tau levels was positively correlated with memory improvement."
      ],
      "evidence": [
        {
          "paper_title": "Histone deacetylase 6 inhibition improves memory and reduces total tau levels in a mouse model of tau deposition",
          "journal": "Alzheimer's Research & Therapy",
          "year": 2014,
          "relevant_quote": "We present data showing that tubastatin restored memory function in rTg4510 mice and reversed a hyperactivity phenotype. We further found that tubastatin reduced the levels of total tau, both histologically and by western analysis... Potential mechanisms by which HDAC6 inhibitors might benefit the rTg4510 mouse include... increased degradation of tau secondary to increased acetylation of HSP90 or both.",
          "pmid": "24576665"
        }
      ],
      "pathway": {
        "name": "Proteostasis",
        "canonical_name": "Proteostasis",
        "ontology_id": "GO:0006457",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "24576665"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    },
    {
      "function": "Mediation of Pathological Tau Relocalization",
      "arrow": "activates",
      "cellular_process": "Under neuroinflammatory conditions, HDAC6 acts as a shuttling factor that is required for the pathological relocalization and accumulation of endogenous Tau into neuritic bead-like structures.",
      "effect_description": "In response to neuroinflammatory triggers, HDAC6 mediates the accumulation of hypo-phosphorylated, acetylated, and oligomeric Tau into neuritic beads. Inhibition or genetic deletion of HDAC6 suppresses the formation of these pathological Tau structures.",
      "biological_consequence": [
        "Neuroinflammatory trigger (e.g., from Aβ-oligomer challenged microglia) → HDAC6 shuttles and colocalizes with Tau → Tau accumulates in pathological neuritic beads → Suppression of bead formation upon HDAC6 inhibition or deletion."
      ],
      "specific_effects": [
        "HDAC6 is robustly recruited to Tau-positive neuritic beads in response to neuroinflammatory stimuli.",
        "Genetic knockout or pharmacological inhibition of HDAC6 almost completely prevents the formation of neuritic Tau beads."
      ],
      "evidence": [
        {
          "paper_title": "The Deacetylase HDAC6 Mediates Endogenous Neuritic Tau Pathology",
          "journal": "Cell Reports",
          "year": 2017,
          "relevant_quote": "We found that tau re-localized and accumulated within pathological neuritic foci, or beads, comprised of mostly hypo-phosphorylated, acetylated, and oligomeric tau... Strikingly, deletion or inhibition of the cytoplasmic shuttling factor HDAC6 suppressed neuritic tau bead formation in neurons and mice.",
          "pmid": "28854366"
        }
      ],
      "pathway": {
        "name": "Proteostasis",
        "canonical_name": "Proteostasis",
        "ontology_id": "GO:0006457",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "28854366"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    }
  ],
  "arrow": "regulates",
  "direction": "primary_to_main",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "is_valid": true,
  "mechanism_correction": "The provided information is an oversimplification. The role of HDAC6 in Tau pathology is complex and context-dependent, exhibiting both neuroprotective and potentially detrimental functions. HDAC6 directly deacetylates Tau, which is part of a protective surveillance mechanism to suppress hyperphosphorylation and aggregation. However, in other contexts, such as neuroinflammation, HDAC6 can mediate pathological Tau accumulation, and inhibition of HDAC6 has been shown to be beneficial by reducing total Tau levels, likely through hyperacetylation of the chaperone Hsp90, which promotes the degradation of client proteins like Tau.",
  "mechanism": "HDAC6 is part of a chaperone-containing complex that directly binds to and deacetylates the microtub; HDAC6 deacetylates the chaperone protein Hsp90; Under neuroinflammatory conditions, HDAC6 acts as a shuttling factor that is required for the pathol",
  "effect": "As part of a protective surveillance mechanism, HDAC6 deacetylates Tau and suppresses its hyperphosphorylation, particularly within the microtubule-binding region. This action prevents the accumulation of toxic, aberrantly modified Tau species, thereby protecting against neurodegeneration.; Pharmacological inhibition of HDAC6 can lead to a reduction in total Tau levels and improved memory in mouse models of tauopathy. This is thought to occur because hyperacetylated Hsp90 is less effective at chaperoning Tau, leading to Tau's clearance via protein degradation pathways.; ...",
  "summary": "HDAC6 activates Tau to control multiple cellular processes including tau homeostasis (protective surveillance), regulation of tau stability (via hsp90), and mediation of pathological tau relocalization, ultimately affecting neuroprotection and preservation of cognitive function.",
  "evidence": [
    {
      "paper_title": "An HDAC6-dependent surveillance mechanism suppresses tau-mediated neurodegeneration and cognitive decline",
      "journal": "Nature Communications",
      "year": 2020,
      "relevant_quote": "Here, we identified an HDAC6-chaperone complex that targets aberrantly modified tau. HDAC6 not only deacetylates tau but also suppresses tau hyperphosphorylation within the microtubule-binding region... Tau transgenic mice lacking HDAC6 show reduced survival characterized by accelerated tau pathology and cognitive decline."
    },
    {
      "paper_title": "Histone deacetylase 6 inhibition improves memory and reduces total tau levels in a mouse model of tau deposition",
      "journal": "Alzheimer's Research & Therapy",
      "year": 2014,
      "relevant_quote": "We present data showing that tubastatin restored memory function in rTg4510 mice and reversed a hyperactivity phenotype. We further found that tubastatin reduced the levels of total tau, both histologically and by western analysis... Potential mechanisms by which HDAC6 inhibitors might benefit the rTg4510 mouse include... increased degradation of tau secondary to increased acetylation of HSP90 or both."
    },
    {
      "paper_title": "The Deacetylase HDAC6 Mediates Endogenous Neuritic Tau Pathology",
      "journal": "Cell Reports",
      "year": 2017,
      "relevant_quote": "We found that tau re-localized and accumulated within pathological neuritic foci, or beads, comprised of mostly hypo-phosphorylated, acetylated, and oligomeric tau... Strikingly, deletion or inhibition of the cytoplasmic shuttling factor HDAC6 suppressed neuritic tau bead formation in neurons and mice."
    }
  ],
  "pathways": [
    {
      "name": "Proteostasis",
      "canonical_name": "Proteostasis",
      "ontology_id": "GO:0006457",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "regulates",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 5
  },
  "_arrow_validated": true,
  "arrow_notation": "HDAC6 --regulates--> Tau:",
  "protein_a": "Tau",
  "protein_b": "HDAC6",
  "discovered_in_query": "HDAC6",
  "first_discovered": "2025-12-04T16:37:52.661637Z",
  "last_updated": "2025-12-04T16:37:52.661637Z"
}