{
  "snapshot_json": {
    "main": "ATXN3",
    "interactors": [
      {
        "primary": "VCP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 contains a VCP binding motif and their interaction is confirmed by pulldown assays, playing a role in ER-associated degradation (ERAD).",
        "functions": [
          {
            "function": "ER-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly binds to the N-terminal domain of VCP/p97, an AAA+ ATPase essential for extracting misfolded proteins from the endoplasmic reticulum. This interaction is competitive with the VCP cofactor Ufd1. By binding to VCP, ATXN3 displaces Ufd1, which in turn reduces VCP's association with ubiquitinated ERAD substrates and impairs their retrotranslocation from the ER to the cytosol for subsequent degradation by the proteasome.",
            "effect_description": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating VCP's substrate processing capacity, it controls the flow of misfolded proteins targeted for degradation, and its over-activity or enhanced binding due to polyQ expansion can lead to the accumulation of these substrates, inducing ER stress.",
            "biological_consequence": [
              "ATXN3 binds to VCP/p97 → ATXN3 competitively displaces the cofactor Ufd1 from VCP → VCP's interaction with ubiquitinated ERAD substrates is decreased → Retrotranslocation of misfolded proteins from the ER to the cytosol is inhibited → Accumulation of ERAD substrates in the ER → Induction of ER stress"
            ],
            "specific_effects": [
              "ATXN3 and the VCP cofactor Ufd1 bind to VCP in a mutually exclusive manner.",
              "ATXN3 binding to VCP reduces VCP's interaction with ubiquitylated proteins.",
              "Pathological polyglutamine (polyQ) expansion in ATXN3 enhances its binding affinity for VCP, leading to a more pronounced impairment of ERAD."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pathway": {
              "name": "ER-Associated Degradation",
              "canonical_name": "ER-Associated Degradation",
              "ontology_id": "GO:0036503",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "16822850"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "RNF8 Homeostasis & DNA Damage Response",
            "arrow": "activates",
            "cellular_process": "Under physiological conditions, the ATXN3-VCP complex constitutively interacts with the E3 ubiquitin ligase RNF8 to regulate its proteasome-dependent homeostasis. Following genotoxic stress (e.g., ionizing radiation), RNF8 is rapidly recruited to DNA double-strand breaks. The ATXN3-VCP machinery then stimulates the extraction of RNF8 from chromatin, preventing its hyper-accumulation at damage sites.",
            "effect_description": "This regulatory extraction of RNF8 is a crucial step that ensures a balanced DNA damage response. By controlling RNF8 levels on chromatin, the ATXN3-VCP complex facilitates the timely recruitment of downstream repair factors and promotes the appropriate choice of DNA repair pathway, specifically favoring non-homologous end joining (NHEJ) and enhancing overall cell survival.",
            "biological_consequence": [
              "ATXN3 and VCP form a complex with RNF8 → Upon DNA damage, the ATXN3-VCP complex extracts RNF8 from chromatin → Prevents RNF8 hyper-accumulation at DNA lesions → Allows balanced recruitment of downstream factors like RNF168 and 53BP1 → Promotes timely utilization of Non-Homologous End Joining (NHEJ) repair → Enhances cell survival post-irradiation"
            ],
            "specific_effects": [
              "The p97-ATX3 machinery regulates proteasome-dependent homeostasis of RNF8 under both physiological and genotoxic conditions.",
              "Inactivation of the p97-ATX3 complex leads to RNF8 hyper-accumulation on chromatin and hypersensitizes cells to ionizing radiation.",
              "The complex's activity promotes the timely choice of the Non-Homologous End Joining (NHEJ) DNA repair pathway over Homologous Recombination (HR)."
            ],
            "evidence": [
              {
                "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
                "journal": "The EMBO Journal",
                "year": 2019,
                "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR).",
                "pmid": "31613024"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31613024"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds to the N-terminal domain of VCP/p97, an AAA+ ATPase essential for extracting mi; Under physiological conditions, the ATXN3-VCP complex constitutively interacts with the E3 ubiquitin",
        "effect": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating VCP's substrate processing capacity, it controls the flow of misfolded proteins targeted for degradation, and its over-activity or enhanced binding due to polyQ expansion can lead to the accumulation of these substrates, inducing ER stress.; This regulatory extraction of RNF8 is a crucial step that ensures a balanced DNA damage response. By controlling RNF8 levels on chromatin, the ATXN3-VCP complex facilitates the timely recruitment of downstream repair factors and promotes the appropriate choice of DNA repair pathway, specifically favoring non-homologous end joining (NHEJ) and enhancing overall cell survival.",
        "summary": "ATXN3 regulates VCP to regulate er-associated degradation (erad) and rnf8 homeostasis & dna damage response, ultimately affecting induction of er stress.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          },
          {
            "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
            "journal": "The EMBO Journal",
            "year": 2019,
            "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR)."
          }
        ],
        "pathways": [
          {
            "name": "ER-Associated Degradation",
            "canonical_name": "ER-Associated Degradation",
            "ontology_id": "GO:0036503",
            "ontology_source": "GO",
            "confidence": 0.8
          },
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> VCP:"
      },
      {
        "primary": "HDAC6",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Direct binding of ATXN3 to HDAC6 was demonstrated using Surface Plasmon Resonance (SPR), with both proteins involved in the transport of aggregated proteins to the aggresome.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3 and HDAC6 cooperate to facilitate the transport of misfolded, ubiquitinated protein aggregates to the aggresome. HDAC6 acts as a linker, binding to ubiquitinated cargo via its zinc finger ubiquitin-binding domain (ZnF-UBP) and simultaneously to the dynein motor protein complex. ATXN3's deubiquitinating activity trims polyubiquitin chains on the aggregates, a process that generates unanchored ubiquitin C-termini which serve as a specific recognition signal for HDAC6 binding, thus promoting efficient cargo loading and transport.",
            "effect_description": "This coordinated action is essential for the collection and sequestration of cytotoxic protein aggregates at the microtubule-organizing center (MTOC). By facilitating the recruitment of aggregates to the dynein transport machinery, the ATXN3-HDAC6 interaction promotes the formation of the aggresome, a key step for clearing toxic proteins via autophagy.",
            "biological_consequence": [
              "Polyubiquitinated protein aggregates form in the cytosol → ATXN3 trims ubiquitin chains on aggregates, exposing unanchored ubiquitin C-termini → HDAC6's ZnF-UBP domain specifically recognizes and binds these exposed C-termini → HDAC6, bound to the aggregate, links to the dynein motor complex → Dynein transports the aggregate cargo along microtubules to the MTOC → Aggresome is formed, sequestering toxic proteins"
            ],
            "specific_effects": [
              "Endogenous ATXN3 co-immunoprecipitates with both dynein and HDAC6.",
              "Knockdown of ATXN3 via siRNA significantly decreases the formation of aggresomes, an effect that is rescued by re-expression of wild-type ATXN3.",
              "HDAC6 specifically recognizes unanchored ubiquitin C-termini on protein aggregates, which are generated by the deubiquitinase activity of ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process.",
                "pmid": "15767577"
              },
              {
                "paper_title": "The deacetylase HDAC6 regulates aggresome formation and cell viability in response to misfolded protein stress",
                "journal": "Cell",
                "year": 2003,
                "relevant_quote": "We demonstrate that HDAC6 has the capacity to bind both polyubiquitinated misfolded proteins and dynein motors, thereby acting to recruit misfolded protein cargo to dynein motors for transport to aggresomes.",
                "pmid": "14675537"
              },
              {
                "paper_title": "Protein Aggregates Are Recruited to Aggresome by Histone Deacetylase 6 via Unanchored Ubiquitin C Termini",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "The unanchored ubiquitin C termini in the aggregates are generated in situ by aggregate-associated deubiquitinase ataxin-3. These results provide structural and mechanistic bases for the role of HDAC6 in aggresome formation and further suggest a novel ubiquitin-mediated signaling pathway, where the exposure of ubiquitin C termini within protein aggregates enables HDAC6 recognition and transport to the aggresome.",
                "pmid": "22069321"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "15767577",
              "14675537",
              "22069321"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 and HDAC6 cooperate to facilitate the transport of misfolded, ubiquitinated protein aggregates to the aggresome. HDAC6 acts as a linker, binding to ubiquitinated cargo via its zinc finger ubiquitin-binding domain (ZnF-UBP) and simultaneously to the dynein motor protein complex. ATXN3's deubiquitinating activity trims polyubiquitin chains on the aggregates, a process that generates unanchored ubiquitin C-termini which serve as a specific recognition signal for HDAC6 binding, thus promoting efficient cargo loading and transport.",
        "effect": "This coordinated action is essential for the collection and sequestration of cytotoxic protein aggregates at the microtubule-organizing center (MTOC). By facilitating the recruitment of aggregates to the dynein transport machinery, the ATXN3-HDAC6 interaction promotes the formation of the aggresome, a key step for clearing toxic proteins via autophagy.",
        "summary": "ATXN3 activates HDAC6 to modulate aggresome formation, ultimately affecting aggresome is formed, sequestering toxic proteins.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process."
          },
          {
            "paper_title": "The deacetylase HDAC6 regulates aggresome formation and cell viability in response to misfolded protein stress",
            "journal": "Cell",
            "year": 2003,
            "relevant_quote": "We demonstrate that HDAC6 has the capacity to bind both polyubiquitinated misfolded proteins and dynein motors, thereby acting to recruit misfolded protein cargo to dynein motors for transport to aggresomes."
          },
          {
            "paper_title": "Protein Aggregates Are Recruited to Aggresome by Histone Deacetylase 6 via Unanchored Ubiquitin C Termini",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "The unanchored ubiquitin C termini in the aggregates are generated in situ by aggregate-associated deubiquitinase ataxin-3. These results provide structural and mechanistic bases for the role of HDAC6 in aggresome formation and further suggest a novel ubiquitin-mediated signaling pathway, where the exposure of ubiquitin C termini within protein aggregates enables HDAC6 recognition and transport to the aggresome."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HDAC6:"
      },
      {
        "primary": "RAD23A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Interaction with the DNA repair protein RAD23A was confirmed by pulldown assays; this interaction prevents the proteasomal degradation of ATXN3.",
        "functions": [
          {
            "function": "ATXN3 Protein Stability",
            "arrow": "activates",
            "cellular_process": "The proteasome-associated shuttle protein RAD23A directly interacts with ubiquitin-binding site 2 (UbS2) within the Josephin domain of ATXN3. This binding occurs independently of ATXN3's ubiquitination status and serves to protect ATXN3 from degradation by the 26S proteasome. By physically shielding ATXN3, RAD23A prevents its proteasomal turnover.",
            "effect_description": "The binding of RAD23A to ATXN3's UbS2 domain stabilizes the ATXN3 protein, leading to an increase in its steady-state levels within the cell. Conversely, the absence or reduction of RAD23A leads to decreased ATXN3 levels due to enhanced proteasomal degradation.",
            "biological_consequence": [
              "RAD23A binds directly to the UbS2 domain of ATXN3 → The interaction shields ATXN3 from recognition and processing by the proteasome → Ubiquitination-independent degradation of ATXN3 is blocked → The half-life of ATXN3 protein is increased → Steady-state levels of ATXN3 protein increase"
            ],
            "specific_effects": [
              "The interaction is mediated specifically by the UbS2 domain of ATXN3.",
              "This protective interaction prevents the ubiquitination-independent proteasomal turnover of ATXN3.",
              "Knockdown of Rad23 in both human cells and Drosophila melanogaster leads to significantly lower levels of ATXN3 protein."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein.",
                "pmid": "25144244"
              },
              {
                "paper_title": "Interaction of the polyglutamine protein ataxin-3 with Rad23 regulates toxicity in Drosophila models of Spinocerebellar Ataxia Type 3",
                "journal": "Human Molecular Genetics",
                "year": 2017,
                "relevant_quote": "Ataxin-3's degradation is inhibited by its binding to the proteasome shuttle Rad23 through ubiquitin-binding site 2 (UbS2). Disrupting this interaction decreases levels of ataxin-3.",
                "pmid": "28158474"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25144244",
              "28158474"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input data incorrectly implies that ATXN3 inhibits RAD23A. The primary literature establishes the opposite: RAD23A regulates ATXN3's stability. RAD23A binds to ATXN3 and shields it from proteasomal degradation, thus increasing its protein levels. The arrow of interaction should be RAD23A → ATXN3, and the effect is stabilization or activation of ATXN3 protein level by inhibiting its degradation.",
        "mechanism": "The proteasome-associated shuttle protein RAD23A directly interacts with ubiquitin-binding site 2 (UbS2) within the Josephin domain of ATXN3. This binding occurs independently of ATXN3's ubiquitination status and serves to protect ATXN3 from degradation by the 26S proteasome. By physically shielding ATXN3, RAD23A prevents its proteasomal turnover.",
        "effect": "The binding of RAD23A to ATXN3's UbS2 domain stabilizes the ATXN3 protein, leading to an increase in its steady-state levels within the cell. Conversely, the absence or reduction of RAD23A leads to decreased ATXN3 levels due to enhanced proteasomal degradation.",
        "summary": "ATXN3 activates RAD23A to modulate atxn3 protein stability, ultimately affecting steady-state levels of atxn3 protein increase.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein."
          },
          {
            "paper_title": "Interaction of the polyglutamine protein ataxin-3 with Rad23 regulates toxicity in Drosophila models of Spinocerebellar Ataxia Type 3",
            "journal": "Human Molecular Genetics",
            "year": 2017,
            "relevant_quote": "Ataxin-3's degradation is inhibited by its binding to the proteasome shuttle Rad23 through ubiquitin-binding site 2 (UbS2). Disrupting this interaction decreases levels of ataxin-3."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- RAD23A:"
      },
      {
        "primary": "RAD23B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Interaction with the DNA repair protein RAD23B was confirmed by pulldown assays; this interaction prevents the proteasomal degradation of ATXN3.",
        "functions": [
          {
            "function": "ATXN3 Protein Stability",
            "arrow": "activates",
            "cellular_process": "Similar to its homolog RAD23A, RAD23B binds to ATXN3's ubiquitin-binding site 2 (UbS2). This interaction prevents the proteasomal degradation of ATXN3, thereby increasing its stability.",
            "effect_description": "The binding of RAD23B stabilizes the ATXN3 protein, contributing to its cellular homeostasis.",
            "biological_consequence": [
              "RAD23B binds ATXN3 → ATXN3 degradation by the proteasome is blocked → Increased ATXN3 protein levels"
            ],
            "specific_effects": [
              "ATXN3 interacts with hHR23B, a human homolog of yeast RAD23.",
              "This interaction is consistent with a role in ubiquitin-mediated proteolysis and protein stability."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "year": 2014,
                "pmid": "25144244"
              },
              {
                "paper_title": "Ataxin-3 interactions with rad23 and valosin-containing protein and its associations with ubiquitin chains and the proteasome are consistent with a role in ubiquitin-mediated proteolysis",
                "year": 2003,
                "pmid": "12944474"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "primary_to_main",
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25144244",
              "12944474"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "Similar to its homolog RAD23A, RAD23B binds to ATXN3's ubiquitin-binding site 2 (UbS2). This interaction prevents the proteasomal degradation of ATXN3, thereby increasing its stability.",
        "effect": "The binding of RAD23B stabilizes the ATXN3 protein, contributing to its cellular homeostasis.",
        "summary": "ATXN3 inhibits RAD23B to modulate atxn3 protein stability, ultimately affecting increased atxn3 protein levels.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "year": 2014
          },
          {
            "paper_title": "Ataxin-3 interactions with rad23 and valosin-containing protein and its associations with ubiquitin chains and the proteasome are consistent with a role in ubiquitin-mediated proteolysis",
            "year": 2003
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- RAD23B:"
      },
      {
        "primary": "PRKN",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the E3 ligase Parkin (PRKN) and counteracts its auto-ubiquitination activity, influencing autophagy.",
        "functions": [
          {
            "function": "PRKN (Parkin) Auto-ubiquitination",
            "arrow": "inhibits",
            "cellular_process": "ATXN3, through its deubiquitinase activity, interacts with the E3 ligase Parkin (PRKN) and counteracts its auto-ubiquitination. This process stabilizes Parkin and modulates its E3 ligase activity towards its substrates.",
            "effect_description": "By deubiquitinating Parkin, ATXN3 regulates Parkin's stability and its function in cellular processes like mitophagy and protein quality control.",
            "biological_consequence": [
              "ATXN3 deubiquitinates PRKN → PRKN auto-ubiquitination is reduced → PRKN is stabilized → Altered ubiquitination of PRKN substrates (e.g., BCL2) → Modulation of mitophagy"
            ],
            "specific_effects": [
              "ATXN3 counteracts Parkin E3 activity by hampering its auto-ubiquitination.",
              "The interaction involves ATXN3's UIM domains and Parkin's IBR/RING2 region."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              },
              {
                "paper_title": "The parkin V380L variant is a genetic modifier of Machado–Joseph disease with impact on mitophagy",
                "year": 2024,
                "pmid": "39088078"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "39320846",
              "39088078"
            ]
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "mechanism": "ATXN3, through its deubiquitinase activity, interacts with the E3 ligase Parkin (PRKN) and counteracts its auto-ubiquitination. This process stabilizes Parkin and modulates its E3 ligase activity towards its substrates.",
        "effect": "By deubiquitinating Parkin, ATXN3 regulates Parkin's stability and its function in cellular processes like mitophagy and protein quality control.",
        "summary": "ATXN3 inhibits PRKN to modulate prkn (parkin) auto-ubiquitination, ultimately affecting modulation of mitophagy.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          },
          {
            "paper_title": "The parkin V380L variant is a genetic modifier of Machado–Joseph disease with impact on mitophagy",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "arrow_notation": "ATXN3 --inhibits--> PRKN:"
      },
      {
        "primary": "YAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Direct interaction between ATXN3 and YAP1 was confirmed by co-immunoprecipitation (Co-IP) and in vitro pulldown assays, where ATXN3 deubiquitinates and stabilizes YAP1.",
        "functions": [
          {
            "function": "YAP1 Protein Stability & Hippo Pathway Signaling",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as a deubiquitinase for YAP1, the primary effector of the Hippo tumor suppressor pathway. ATXN3 removes K48-linked polyubiquitin chains from YAP1, protecting it from proteasomal degradation.",
            "effect_description": "This interaction stabilizes YAP1 protein, leading to its accumulation and increased transcriptional activity of its target genes, which promotes cell proliferation, invasion, and stem-like properties, particularly in cancer.",
            "biological_consequence": [
              "ATXN3 deubiquitinates YAP1 → YAP1 protein is stabilized → Increased nuclear YAP1 → Enhanced transcription of YAP target genes (CTGF, ANKRD1, CYR61) → Promotion of cell proliferation and invasion"
            ],
            "specific_effects": [
              "ATXN3 interacts with, deubiquitinates, and stabilizes YAP1 in a deubiquitylation activity-dependent manner.",
              "The Josephin domain of ATXN3 interacts with the WW domain of YAP1.",
              "Depletion of ATXN3 decreases YAP protein levels and the expression of YAP/TEAD target genes."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "year": 2023,
                "pmid": "37349820"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Hippo Signaling Pathway",
              "canonical_name": "Hippo Signaling",
              "ontology_id": "hsa04390",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "37349820"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 acts as a deubiquitinase for YAP1, the primary effector of the Hippo tumor suppressor pathway. ATXN3 removes K48-linked polyubiquitin chains from YAP1, protecting it from proteasomal degradation.",
        "effect": "This interaction stabilizes YAP1 protein, leading to its accumulation and increased transcriptional activity of its target genes, which promotes cell proliferation, invasion, and stem-like properties, particularly in cancer.",
        "summary": "ATXN3 activates YAP1 to modulate yap1 protein stability & hippo pathway signaling, ultimately affecting promotion of cell proliferation and invasion.",
        "evidence": [
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "year": 2023
          }
        ],
        "pathways": [
          {
            "name": "Hippo Signaling Pathway",
            "canonical_name": "Hippo Signaling",
            "ontology_id": "hsa04390",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 0
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> YAP1:"
      },
      {
        "primary": "BECN1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with BECN1 (Beclin-1) to deubiquitinate it, leading to its stabilization and the stimulation of autophagy.",
        "functions": [
          {
            "function": "Autophagy Activation via Protein Stabilization",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with BECN1 (Beclin-1), a pivotal protein for the initiation of autophagy. ATXN3 functions as a deubiquitinase (DUB) for BECN1, specifically removing K48-linked polyubiquitin chains, which are signals for proteasomal degradation. This deubiquitination stabilizes the BECN1 protein.",
            "effect_description": "The stabilization of BECN1 enhances its ability to participate in the class III phosphatidylinositol 3-kinase (PI3K) complex. An increased pool of stable BECN1 promotes the activity of this complex, leading to the production of phosphatidylinositol-3-phosphate (PtdIns3P), which is essential for the nucleation and formation of autophagosomes. This ultimately stimulates autophagic flux, aiding in the clearance of cellular waste.",
            "biological_consequence": [
              "ATXN3 binds to BECN1 via its polyQ domain → ATXN3 removes K48-linked polyubiquitin chains from BECN1 → BECN1 protein is stabilized and protected from proteasomal degradation → Increased BECN1 availability promotes the formation of the active class III PI3K complex → Enhanced autophagosome nucleation and maturation → Increased autophagic flux and clearance of cellular aggregates."
            ],
            "specific_effects": [
              "Directly deubiquitinates and stabilizes BECN1, protecting it from proteasome-mediated degradation.",
              "Removes K48-linked poly-ubiquitin chains from BECN1, specifically at lysine 402 (K402).",
              "The interaction is mediated by the polyQ domain of wild-type ATXN3.",
              "Depletion of ATXN3 leads to reduced BECN1 levels and impairs starvation-induced autophagy.",
              "Overexpression of BECN1 can stimulate autophagic flux and help clear mutant ataxin-3 aggregates."
            ],
            "evidence": [
              {
                "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
                "journal": "Nature",
                "year": 2017,
                "relevant_quote": "Here we show that the polyQ domain enables wild-type ataxin 3 to interact with beclin 1, a key initiator of autophagy. This interaction allows the deubiquitinase activity of ataxin 3 to protect beclin 1 from proteasome-mediated degradation and thereby enables autophagy.",
                "pmid": "28445460"
              },
              {
                "paper_title": "Beclin 1 Phosphorylation – at the Center of Autophagy Regulation",
                "journal": "Frontiers in Cell and Developmental Biology",
                "year": 2018,
                "relevant_quote": "Ataxin-3, another deubiquitinating enzyme is involved in deubiquitinating K48-linked poly-ubiquitin chains from BECN1-K402, thus stabilizing BECN1 and promoting starvation-induced autophagy.",
                "pmid": "30370269"
              }
            ],
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "28445460",
              "30370269"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with BECN1 (Beclin-1), a pivotal protein for the initiation of autophagy. ATXN3 functions as a deubiquitinase (DUB) for BECN1, specifically removing K48-linked polyubiquitin chains, which are signals for proteasomal degradation. This deubiquitination stabilizes the BECN1 protein.",
        "effect": "The stabilization of BECN1 enhances its ability to participate in the class III phosphatidylinositol 3-kinase (PI3K) complex. An increased pool of stable BECN1 promotes the activity of this complex, leading to the production of phosphatidylinositol-3-phosphate (PtdIns3P), which is essential for the nucleation and formation of autophagosomes. This ultimately stimulates autophagic flux, aiding in the clearance of cellular waste.",
        "summary": "ATXN3 activates BECN1 to modulate autophagy activation via protein stabilization, ultimately affecting increased autophagic flux and clearance of cellular aggregates.",
        "evidence": [
          {
            "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
            "journal": "Nature",
            "year": 2017,
            "relevant_quote": "Here we show that the polyQ domain enables wild-type ataxin 3 to interact with beclin 1, a key initiator of autophagy. This interaction allows the deubiquitinase activity of ataxin 3 to protect beclin 1 from proteasome-mediated degradation and thereby enables autophagy."
          },
          {
            "paper_title": "Beclin 1 Phosphorylation – at the Center of Autophagy Regulation",
            "journal": "Frontiers in Cell and Developmental Biology",
            "year": 2018,
            "relevant_quote": "Ataxin-3, another deubiquitinating enzyme is involved in deubiquitinating K48-linked poly-ubiquitin chains from BECN1-K402, thus stabilizing BECN1 and promoting starvation-induced autophagy."
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> BECN1:"
      },
      {
        "primary": "STUB1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the E3 ligase STUB1 (CHIP) to regulate the degradation of misfolded chaperone substrates.",
        "functions": [
          {
            "function": "Misfolded Protein Degradation",
            "arrow": "regulates",
            "cellular_process": "ATXN3 collaborates with the E3 ubiquitin ligase STUB1 (also known as CHIP) in the ubiquitin-proteasome system to manage misfolded proteins. STUB1 first ubiquitinates chaperone-bound misfolded substrates. Monoubiquitination of STUB1/CHIP by the E2 enzyme Ube2w enhances its interaction with ATXN3.",
            "effect_description": "ATXN3 is recruited to the STUB1-substrate complex and acts as a ubiquitin chain editor. It trims or restricts the length of the polyubiquitin chains that STUB1 builds on the substrate. This modulation prevents excessive chain extension and refines the degradation signal, ensuring a regulated and efficient protein quality control process rather than unchecked degradation.",
            "biological_consequence": [
              "STUB1/CHIP binds and polyubiquitinates a misfolded protein substrate → ATXN3 is recruited to the complex, an interaction stabilized by STUB1/CHIP monoubiquitination → ATXN3, with its deubiquitinase activity, trims the polyubiquitin chain on the substrate → The edited ubiquitin signal leads to regulated degradation by the proteasome → Balanced and efficient protein quality control is maintained."
            ],
            "specific_effects": [
              "Collaborates with STUB1/CHIP in the degradation of misfolded chaperone substrates.",
              "Restricts the length of the ubiquitin chain attached to STUB1/CHIP substrates, preventing further chain extension.",
              "The interaction between ATXN3 and STUB1/CHIP is stabilized by the monoubiquitination of STUB1/CHIP.",
              "ATXN3's deubiquitinase activity limits the length of chains attached to STUB1/CHIP substrates."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "The EMBO Journal",
                "year": 2011,
                "relevant_quote": "Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction.",
                "pmid": "21855799"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21855799"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "bidirectional",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The term 'activates' is imprecise. ATXN3 'regulates' or 'modulates' the activity of the STUB1/CHIP E3 ligase by editing ubiquitin chains on substrates, rather than simply activating the degradation process. This creates a checkpoint for protein quality control.",
        "mechanism": "ATXN3 collaborates with the E3 ubiquitin ligase STUB1 (also known as CHIP) in the ubiquitin-proteasome system to manage misfolded proteins. STUB1 first ubiquitinates chaperone-bound misfolded substrates. Monoubiquitination of STUB1/CHIP by the E2 enzyme Ube2w enhances its interaction with ATXN3.",
        "effect": "ATXN3 is recruited to the STUB1-substrate complex and acts as a ubiquitin chain editor. It trims or restricts the length of the polyubiquitin chains that STUB1 builds on the substrate. This modulation prevents excessive chain extension and refines the degradation signal, ensuring a regulated and efficient protein quality control process rather than unchecked degradation.",
        "summary": "ATXN3 interacts with STUB1 to modulate regulation of misfolded protein degradation, ultimately affecting balanced and efficient protein quality control is maintained.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "The EMBO Journal",
            "year": 2011,
            "relevant_quote": "Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction."
          },
          {
            "paper_title": "DISEASES - ATXN3",
            "journal": "JensenLab",
            "year": null,
            "relevant_quote": "Involved in degradation of misfolded chaperone substrates via its interaction with STUB1/CHIP: recruited to monoubiquitinated STUB1/CHIP, and restricts the length of ubiquitin chain attached to STUB1/CHIP substrates and preventing further chain extension."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds--> STUB1:"
      },
      {
        "primary": "SUMO1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Identified as a direct interactor in a yeast two-hybrid screen, SUMO1 co-localizes with ATXN3 in the nucleus, suggesting a role in post-translational modification.",
        "functions": [
          {
            "function": "Post-Translational Modification of ATXN3",
            "arrow": "activates",
            "cellular_process": "ATXN3 is a substrate for SUMOylation, a post-translational modification where a Small Ubiquitin-like Modifier (SUMO) protein is covalently attached. SUMO1 is identified as a protein that directly modifies ATXN3.",
            "effect_description": "The covalent attachment of SUMO1, primarily at lysine 166 (K166) of ATXN3, increases the stability of the ATXN3 protein. This modification does not significantly alter ATXN3's subcellular localization or its propensity to form aggregates. However, by increasing the half-life of polyQ-expanded mutant ATXN3, SUMOylation enhances its cellular toxicity and promotes apoptosis.",
            "biological_consequence": [
              "SUMO1 is covalently attached to ATXN3, primarily at lysine 166 → SUMOylated ATXN3 exhibits increased protein stability → For polyQ-expanded mutant ATXN3, this leads to higher protein accumulation → Increased accumulation of mutant ATXN3 enhances its cytotoxicity, leading to increased apoptosis."
            ],
            "specific_effects": [
              "ATXN3 is covalently modified by SUMO1.",
              "The major SUMO1 modification site on ATXN3 is lysine 166 (K166).",
              "SUMOylation at K166 increases the protein stability of ATXN3, particularly the polyQ-expanded form.",
              "Increased stability of mutant ATXN3 due to SUMOylation leads to increased cytotoxicity and apoptosis."
            ],
            "evidence": [
              {
                "paper_title": "SUMO-1 modification on K166 of polyQ-expanded ataxin-3 strengthens its stability and increases its cytotoxicity",
                "journal": "PLoS One",
                "year": 2013,
                "relevant_quote": "We have previously shown that ataxin-3 was a new target of SUMOylation in vitro and in vivo. Here we identified that the major SUMO-1 binding site was located on lysine 166. SUMOylation did not influence the subcellular localization, ubiquitination or aggregates formation of mutant-type ataxin-3, but partially increased its stability and the cell apoptosis.",
                "pmid": "23382880"
              }
            ],
            "pathway": {
              "name": "Protein SUMOylation",
              "canonical_name": "Protein Sumoylation",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "23382880"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is a post-translational modification *of* ATXN3 *by* the SUMOylation machinery, with SUMO1 being the modifying protein. ATXN3 is the substrate, not the enzyme, in this context. The input correctly described this directionality.",
        "mechanism": "ATXN3 is a substrate for SUMOylation, a post-translational modification where a Small Ubiquitin-like Modifier (SUMO) protein is covalently attached. SUMO1 is identified as a protein that directly modifies ATXN3.",
        "effect": "The covalent attachment of SUMO1, primarily at lysine 166 (K166) of ATXN3, increases the stability of the ATXN3 protein. This modification does not significantly alter ATXN3's subcellular localization or its propensity to form aggregates. However, by increasing the half-life of polyQ-expanded mutant ATXN3, SUMOylation enhances its cellular toxicity and promotes apoptosis.",
        "summary": "ATXN3 interacts with SUMO1 to modulate post-translational modification of atxn3, ultimately affecting increased accumulation of mutant atxn3 enhances its cytotoxicity, leading to increased apoptosis.",
        "evidence": [
          {
            "paper_title": "SUMO-1 modification on K166 of polyQ-expanded ataxin-3 strengthens its stability and increases its cytotoxicity",
            "journal": "PLoS One",
            "year": 2013,
            "relevant_quote": "We have previously shown that ataxin-3 was a new target of SUMOylation in vitro and in vivo. Here we identified that the major SUMO-1 binding site was located on lysine 166. SUMOylation did not influence the subcellular localization, ubiquitination or aggregates formation of mutant-type ataxin-3, but partially increased its stability and the cell apoptosis."
          },
          {
            "paper_title": "Covalent modification of ataxin-3 by SUMO-1",
            "journal": "Acta Biochimica et Biophysica Sinica",
            "year": 2006,
            "relevant_quote": "Small ubiquitin-like modifier 1(SUMO-1) was identified as a novel ataxin-3-interacting protein. Subsequently, co-immunoprecipitation showed that both the wild-type ataxin-3 and the polyglutamine-expanded ataxin-3 were covalently modified by SUMO-1 in SH-SY5Y cell..."
          }
        ],
        "pathways": [
          {
            "name": "Protein SUMOylation",
            "canonical_name": "Protein Sumoylation",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- SUMO1:"
      },
      {
        "primary": "CREBBP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation (Co-IP) experiments demonstrated a direct interaction between ATXN3 and the transcriptional coactivator CREBBP (CBP).",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) CREBBP (also known as CBP). This interaction inhibits the intrinsic HAT activity of CREBBP, preventing the acetylation of histones at target gene promoters.",
            "effect_description": "By inhibiting CREBBP's ability to acetylate histones, ATXN3 prevents the formation of a transcriptionally permissive chromatin state. This leads to the repression of genes that are normally activated by CREBBP and its associated transcription factors, thereby modulating cellular processes controlled by this signaling pathway.",
            "biological_consequence": [
              "ATXN3 C-terminal domain binds to the histone acetyltransferase CREBBP → The intrinsic HAT activity of CREBBP is inhibited → Histone tails at target gene promoters are not acetylated → Chromatin remains in a condensed, transcriptionally repressive state → Expression of CREBBP-regulated genes is repressed."
            ],
            "specific_effects": [
              "The C-terminal polyglutamine-containing domain of ATXN3 is required for binding to CREBBP and inhibiting its coactivator-dependent transcription.",
              "The N-terminal domain of ATXN3 can independently repress transcription by binding to histones and blocking the access of coactivators like p300/CBP to their acetylation sites.",
              "Endogenous ATXN3 co-immunoprecipitates with CREBBP in non-transfected cells, confirming the physiological relevance of the interaction."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) CREBBP (also known as CBP). This interaction inhibits the intrinsic HAT activity of CREBBP, preventing the acetylation of histones at target gene promoters.",
        "effect": "By inhibiting CREBBP's ability to acetylate histones, ATXN3 prevents the formation of a transcriptionally permissive chromatin state. This leads to the repression of genes that are normally activated by CREBBP and its associated transcription factors, thereby modulating cellular processes controlled by this signaling pathway.",
        "summary": "ATXN3 inhibits CREBBP to modulate transcriptional repression, ultimately affecting expression of crebbp-regulated genes is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CREBBP:"
      },
      {
        "primary": "PML",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "A direct interaction between ATXN3 and Promyelocytic leukemia protein (PML) was shown via co-immunoprecipitation (Co-IP).",
        "functions": [
          {
            "function": "Inhibition of Deubiquitinase Activity",
            "arrow": "activates",
            "cellular_process": "The Promyelocytic leukemia protein isoform II (PML-II) specifically interacts with ATXN3 via its unique C-terminal region. This interaction recruits ATXN3 into PML nuclear bodies (NBs), subnuclear structures involved in various cellular processes. The sequestration and localization of ATXN3 within these bodies leads to the inhibition of its deubiquitinase (DUB) activity.",
            "effect_description": "The recruitment of ATXN3 to PML-NBs by PML-II serves as a negative regulatory mechanism, suppressing the enzymatic function of ATXN3. This suggests that PML-NBs act as hubs for controlling the activity of nuclear ATXN3, thereby influencing the stability of its protein substrates.",
            "biological_consequence": [
              "The C-terminal domain of PML-II binds directly to ATXN3 → ATXN3 is recruited from the nucleoplasm into PML nuclear bodies → The deubiquitinase activity of ATXN3 is inhibited → The removal of ubiquitin chains from ATXN3 substrates is reduced → The stability and turnover of ATXN3 target proteins are altered."
            ],
            "specific_effects": [
              "The interaction is specific to the PML-II isoform and does not occur with the C-terminal regions of other PML isoforms.",
              "PML-II binds to both wild-type ATXN3 (13Q) and the pathological, polyQ-expanded form (79Q).",
              "Co-immunoprecipitation assays and immunofluorescent microscopy confirmed a direct interaction and co-localization of PML-II and ATXN3 within PML-NBs."
            ],
            "evidence": [
              {
                "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
                "journal": "Biochemical and Biophysical Research Communications",
                "year": 2021,
                "relevant_quote": "Here, we report the characterization of the deubiquitinase ataxin-3 as a specific binding partner of PML isoform II (PML-II). Ataxin-3 only binds to the C-terminal region of PML-II and not that of other PML isoforms... Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II. Our results suggest that PML-II may be a negative regulator of ataxin-3.",
                "pmid": "33798946"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "33798946"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The Promyelocytic leukemia protein isoform II (PML-II) specifically interacts with ATXN3 via its unique C-terminal region. This interaction recruits ATXN3 into PML nuclear bodies (NBs), subnuclear structures involved in various cellular processes. The sequestration and localization of ATXN3 within these bodies leads to the inhibition of its deubiquitinase (DUB) activity.",
        "effect": "The recruitment of ATXN3 to PML-NBs by PML-II serves as a negative regulatory mechanism, suppressing the enzymatic function of ATXN3. This suggests that PML-NBs act as hubs for controlling the activity of nuclear ATXN3, thereby influencing the stability of its protein substrates.",
        "summary": "ATXN3 inhibits PML to modulate inhibition of deubiquitinase activity, ultimately affecting the stability and turnover of atxn3 target proteins are altered.",
        "evidence": [
          {
            "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
            "journal": "Biochemical and Biophysical Research Communications",
            "year": 2021,
            "relevant_quote": "Here, we report the characterization of the deubiquitinase ataxin-3 as a specific binding partner of PML isoform II (PML-II). Ataxin-3 only binds to the C-terminal region of PML-II and not that of other PML isoforms... Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II. Our results suggest that PML-II may be a negative regulator of ataxin-3."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- PML:"
      },
      {
        "primary": "PNKP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 forms a complex with Polynucleotide kinase 3'-phosphatase (PNKP) and RNA polymerase II, implicating it in the DNA damage response.",
        "functions": [
          {
            "function": "DNA Strand Break Repair",
            "arrow": "regulates",
            "cellular_process": "ATXN3 directly interacts with and modulates the activity of Polynucleotide kinase 3'-phosphatase (PNKP), a critical enzyme in the repair of DNA single- and double-strand breaks. Wild-type ATXN3 stimulates PNKP's 3'-phosphatase activity, which is essential for processing damaged DNA ends to make them suitable for ligation. Conversely, mutant, polyQ-expanded ATXN3, which causes Spinocerebellar Ataxia Type 3 (SCA3), binds to and inactivates PNKP.",
            "effect_description": "The functional interaction between wild-type ATXN3 and PNKP enhances the efficiency of DNA repair, thus maintaining genomic stability and promoting neuronal survival. In the context of SCA3, the inhibition of PNKP by mutant ATXN3 leads to the accumulation of DNA strand breaks, chronic activation of the DNA damage response (DDR), and subsequent apoptosis.",
            "biological_consequence": [
              "Wild-type ATXN3 binds to PNKP → PNKP's 3'-phosphatase activity is stimulated → Damaged 3' DNA ends are efficiently processed → DNA ligation and strand break repair are completed → Genomic integrity is maintained.",
              "Mutant (polyQ-expanded) ATXN3 binds to and inactivates PNKP → DNA strand break repair is impaired → DNA damage accumulates → The ATM signaling pathway is chronically activated → Pro-apoptotic pathways (p53-dependent) are triggered → Neuronal apoptosis occurs."
            ],
            "specific_effects": [
              "Wild-type ATXN3 enhances the 3'-phosphatase activity of PNKP, promoting the repair of DNA ends.",
              "Mutant ATXN3 interacts with and abrogates PNKP's 3'-phosphatase activity, leading to the accumulation of DNA damage.",
              "Inactivation of PNKP by mutant ATXN3 results in the persistent activation of the DNA damage-response ATM signaling pathway, which triggers neuronal death in SCA3 models.",
              "ATXN3-deficient cells exhibit decreased PNKP activity and an increase in DNA strand breaks."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLOS Genetics",
                "year": 2015,
                "relevant_quote": "We now report that the mutant ATXN3 protein interacts with and inactivates PNKP (polynucleotide kinase 3'-phosphatase), an essential DNA strand break repair enzyme. This inactivation results in persistent accumulation of DNA damage, and chronic activation of the DNA damage-response ATM signaling pathway in SCA3.",
                "pmid": "25590633"
              },
              {
                "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
                "journal": "eLife",
                "year": 2019,
                "relevant_quote": "We recently reported that the wild-type (wt) form of the deubiquitinating enzyme ataxin-3 (wtATXN3) enhances the activity of polynucleotide kinase-3'-phosphatase (PNKP)... In contrast, mutant ATXN3 (mATXN3) abrogates PNKP activity to induce DNA strand breaks and activate the DDR-ATM→p53 pathway, as observed in spinocerebellar ataxia 3 (SCA3).",
                "pmid": "30994454"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633",
              "30994454"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with and modulates the activity of Polynucleotide kinase 3'-phosphatase (PNKP), a critical enzyme in the repair of DNA single- and double-strand breaks. Wild-type ATXN3 stimulates PNKP's 3'-phosphatase activity, which is essential for processing damaged DNA ends to make them suitable for ligation. Conversely, mutant, polyQ-expanded ATXN3, which causes Spinocerebellar Ataxia Type 3 (SCA3), binds to and inactivates PNKP.",
        "effect": "The functional interaction between wild-type ATXN3 and PNKP enhances the efficiency of DNA repair, thus maintaining genomic stability and promoting neuronal survival. In the context of SCA3, the inhibition of PNKP by mutant ATXN3 leads to the accumulation of DNA strand breaks, chronic activation of the DNA damage response (DDR), and subsequent apoptosis.",
        "summary": "ATXN3 interacts with PNKP to modulate regulation of dna strand break repair, ultimately affecting genomic integrity is maintained.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLOS Genetics",
            "year": 2015,
            "relevant_quote": "We now report that the mutant ATXN3 protein interacts with and inactivates PNKP (polynucleotide kinase 3'-phosphatase), an essential DNA strand break repair enzyme. This inactivation results in persistent accumulation of DNA damage, and chronic activation of the DNA damage-response ATM signaling pathway in SCA3."
          },
          {
            "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
            "journal": "eLife",
            "year": 2019,
            "relevant_quote": "We recently reported that the wild-type (wt) form of the deubiquitinating enzyme ataxin-3 (wtATXN3) enhances the activity of polynucleotide kinase-3'-phosphatase (PNKP)... In contrast, mutant ATXN3 (mATXN3) abrogates PNKP activity to induce DNA strand breaks and activate the DDR-ATM→p53 pathway, as observed in spinocerebellar ataxia 3 (SCA3)."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> PNKP:"
      },
      {
        "primary": "KLF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 functions as a deubiquitinating enzyme for the transcription factor KLF4, stabilizing it and promoting breast cancer metastasis.",
        "functions": [
          {
            "function": "KLF4 Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as a deubiquitinating enzyme (DUB) for the transcription factor Krüppel-like factor 4 (KLF4). ATXN3 directly binds to KLF4, removes polyubiquitin chains, and consequently prevents its proteasomal degradation.",
            "effect_description": "By stabilizing KLF4, ATXN3 elevates its protein levels. This enhancement of KLF4 protein availability boosts its transcriptional activity, which in turn promotes downstream cellular processes such as cell migration and metastasis in the context of breast cancer.",
            "biological_consequence": [
              "ATXN3 binds to KLF4 → ATXN3 removes polyubiquitin chains from KLF4 → Proteasomal degradation of KLF4 is inhibited → KLF4 protein levels are stabilized and increased → Enhanced transcriptional activity of KLF4 target genes → Promotion of breast cancer cell metastasis"
            ],
            "specific_effects": [
              "ATXN3 was identified as a KLF4 deubiquitinating enzyme from a screen of 65 DUBs.",
              "In human breast cancer specimens, there is a significant positive correlation between the protein expression of ATXN3 and KLF4.",
              "High co-expression of ATXN3 and KLF4 is correlated with a poor prognosis for breast cancer patients."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
                "journal": "Cancer Letters",
                "year": 2019,
                "relevant_quote": "We screened a library of 65 deubiquitinating enzymes and identified ATXN3 as a deubiquitinating enzyme of KLF4. Subsequent immunoprecipitation assays confirmed that ATXN3 bound to KLF4, mediating the deubiquitination and stabilization of KLF4 protein levels. Furthermore, we demonstrated that ATXN3 promoted breast cancer cell metastasis via KLF4 in vitro and in vivo.",
                "pmid": "31563563"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "31563563"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 acts as a deubiquitinating enzyme (DUB) for the transcription factor Krüppel-like factor 4 (KLF4). ATXN3 directly binds to KLF4, removes polyubiquitin chains, and consequently prevents its proteasomal degradation.",
        "effect": "By stabilizing KLF4, ATXN3 elevates its protein levels. This enhancement of KLF4 protein availability boosts its transcriptional activity, which in turn promotes downstream cellular processes such as cell migration and metastasis in the context of breast cancer.",
        "summary": "ATXN3 activates KLF4 to modulate klf4 protein stability, ultimately affecting promotion of breast cancer cell metastasis.",
        "evidence": [
          {
            "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
            "journal": "Cancer Letters",
            "year": 2019,
            "relevant_quote": "We screened a library of 65 deubiquitinating enzymes and identified ATXN3 as a deubiquitinating enzyme of KLF4. Subsequent immunoprecipitation assays confirmed that ATXN3 bound to KLF4, mediating the deubiquitination and stabilization of KLF4 protein levels. Furthermore, we demonstrated that ATXN3 promoted breast cancer cell metastasis via KLF4 in vitro and in vivo."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> KLF4:"
      },
      {
        "primary": "TP53",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly deubiquitinates and stabilizes the tumor suppressor protein p53 (TP53).",
        "functions": [
          {
            "function": "TP53 Protein Stability & Apoptosis",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with the tumor suppressor protein p53 (TP53). It functions as a deubiquitinase for p53, removing polyubiquitin chains and thereby preventing its degradation via the ubiquitin-proteasome system.",
            "effect_description": "The deubiquitination of p53 by ATXN3 leads to its stabilization and accumulation. This increases the transcriptional activity of p53, promoting the expression of its target genes, which can lead to cell cycle arrest and p53-dependent apoptosis.",
            "biological_consequence": [
              "ATXN3 binds to and deubiquitinates TP53 → TP53 is stabilized and protected from proteasomal degradation → Accumulated TP53 acts as a transcription factor → Increased transcription of p53 target genes (e.g., pro-apoptotic genes) → Induction of p53-mediated apoptosis"
            ],
            "specific_effects": [
              "Deletion of ATXN3 results in the destabilization of p53 and deficient p53 activity.",
              "Polyglutamine-expanded ATXN3 exhibits an enhanced interaction with p53 and increased deubiquitinating activity, leading to greater p53 stabilization and more severe p53-dependent neurodegeneration in disease models.",
              "The interaction between ATXN3 and p53 regulates p53-mediated transcriptional activity and cell cycle arrest."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Biology",
                "year": 2016,
                "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis in both mammalian cells and the central nervous system of zebrafish.",
                "pmid": "27851749"
              }
            ],
            "pathway": {
              "name": "Apoptosis",
              "canonical_name": "Apoptosis",
              "ontology_id": "GO:0006915",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "27851749"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly interacts with the tumor suppressor protein p53 (TP53). It functions as a deubiquitinase for p53, removing polyubiquitin chains and thereby preventing its degradation via the ubiquitin-proteasome system.",
        "effect": "The deubiquitination of p53 by ATXN3 leads to its stabilization and accumulation. This increases the transcriptional activity of p53, promoting the expression of its target genes, which can lead to cell cycle arrest and p53-dependent apoptosis.",
        "summary": "ATXN3 activates TP53 to modulate tp53 protein stability & apoptosis, ultimately affecting induction of p53-mediated apoptosis.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Biology",
            "year": 2016,
            "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis in both mammalian cells and the central nervous system of zebrafish."
          }
        ],
        "pathways": [
          {
            "name": "Apoptosis",
            "canonical_name": "Apoptosis",
            "ontology_id": "GO:0006915",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> TP53:"
      },
      {
        "primary": "TUBULIN",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Direct binding to tubulin has been demonstrated by Surface Plasmon Resonance (SPR), linking ATXN3 to microtubule-dependent processes.",
        "functions": [
          {
            "function": "Microtubule-Dependent Protein Transport",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly binds with high affinity to both alpha- and beta-tubulin dimers, the fundamental components of microtubules. This interaction facilitates the co-localization of ATXN3 with the microtubule network, which serves as a cellular railway for transporting cargo, including misfolded protein aggregates, to the aggresome located near the microtubule-organizing center (MTOC).",
            "effect_description": "Through its interaction with tubulin, ATXN3 is implicated as a key component in the cellular machinery responsible for recognizing, collecting, and transporting misfolded proteins along microtubules for their eventual sequestration into aggresomes.",
            "biological_consequence": [
              "ATXN3 directly binds to tubulin dimers → ATXN3 co-localizes with the microtubule network → ATXN3 facilitates the transport of misfolded protein cargo along microtubules → Misfolded proteins are collected at the microtubule-organizing center → Formation of aggresomes is promoted"
            ],
            "specific_effects": [
              "Surface plasmon resonance experiments determined a strong dissociation constant (Kd) of 50-70 nM for the interaction between ataxin-3 and tubulin dimers.",
              "In cultured cells, normal ATXN3 shows partial co-localization with microtubules.",
              "PolyQ-expanded ATXN3, associated with spinocerebellar ataxia type 3, exhibits reduced co-localization with microtubules, potentially due to its propensity to aggregate."
            ],
            "evidence": [
              {
                "paper_title": "Proteomic and biochemical analyses unveil tight interaction of ataxin-3 with tubulin",
                "journal": "The International Journal of Biochemistry & Cell Biology",
                "year": 2009,
                "relevant_quote": "We found that different ataxin-3 constructs, including the sole Josephin domain, bound alpha- and beta-tubulin from soluble rat brain extracts. Coimmunoprecipitation experiments confirmed this interaction. Also, normal ataxin-3 overexpressed in COS7 cultured cells partially colocalized with microtubules... Furthermore, by surface plasmon resonance we determined a dissociation constant of 50-70nM between ataxin-3 and tubulin dimer, which strongly supports the hypothesis of a direct interaction of this protein with microtubules in vivo.",
                "pmid": "19666135"
              }
            ],
            "pathway": {
              "name": "Cytoskeletal Transport",
              "canonical_name": "Cytoskeletal Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "19666135"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "binds"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds with high affinity to both alpha- and beta-tubulin dimers, the fundamental components of microtubules. This interaction facilitates the co-localization of ATXN3 with the microtubule network, which serves as a cellular railway for transporting cargo, including misfolded protein aggregates, to the aggresome located near the microtubule-organizing center (MTOC).",
        "effect": "Through its interaction with tubulin, ATXN3 is implicated as a key component in the cellular machinery responsible for recognizing, collecting, and transporting misfolded proteins along microtubules for their eventual sequestration into aggresomes.",
        "summary": "ATXN3 interacts with TUBULIN to modulate microtubule-dependent protein transport, ultimately affecting formation of aggresomes is promoted.",
        "evidence": [
          {
            "paper_title": "Proteomic and biochemical analyses unveil tight interaction of ataxin-3 with tubulin",
            "journal": "The International Journal of Biochemistry & Cell Biology",
            "year": 2009,
            "relevant_quote": "We found that different ataxin-3 constructs, including the sole Josephin domain, bound alpha- and beta-tubulin from soluble rat brain extracts. Coimmunoprecipitation experiments confirmed this interaction. Also, normal ataxin-3 overexpressed in COS7 cultured cells partially colocalized with microtubules... Furthermore, by surface plasmon resonance we determined a dissociation constant of 50-70nM between ataxin-3 and tubulin dimer, which strongly supports the hypothesis of a direct interaction of this protein with microtubules in vivo."
          }
        ],
        "pathways": [
          {
            "name": "Cytoskeletal Transport",
            "canonical_name": "Cytoskeletal Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TUBULIN:"
      },
      {
        "primary": "RHEB",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "ATXN3 functionally regulates mTORC1 signaling by deubiquitinating RHEB, which is a functional, first-ring indirect interaction.",
        "functions": [
          {
            "function": "RHEB Ubiquitination & mTORC1 Signaling",
            "arrow": "regulates",
            "cellular_process": "ATXN3 is a deubiquitinase for the small GTPase RHEB, a critical activator of the mTORC1 complex. The regulatory action is conditional, based on nutrient status. Under amino acid starvation, ATXN3 localizes to the lysosome and deubiquitinates RHEB, which prevents mTORC1 activation. Conversely, amino acid stimulation leads to the sequestration of ATXN3 away from the lysosome by active Rag GTPases.",
            "effect_description": "When amino acids are present, the inhibition of ATXN3's lysosomal activity allows RHEB to become polyubiquitinated. This polyubiquitination enhances RHEB's binding affinity for mTORC1, leading to robust activation of the complex. This mechanism couples cellular nutrient status to growth signaling pathways.",
            "biological_consequence": [
              "Amino acids absent → Rag GTPases are inactive → ATXN3 localizes to the lysosome → ATXN3 deubiquitinates RHEB → mTORC1 signaling is suppressed.",
              "Amino acids present → Rag GTPases are active → ATXN3 is blocked from lysosomal localization → RHEB becomes polyubiquitinated → Enhanced RHEB binding to mTORC1 → mTORC1 activation → Cell growth and protein synthesis."
            ],
            "specific_effects": [
              "ATXN3 was identified as a deubiquitinase for polyubiquitinated RHEB (Ub-Rheb).",
              "Amino acid stimulation, via active Rag GTPases, blocks the lysosomal localization of ATXN3.",
              "Polyubiquitination of RHEB enhances its binding affinity for mTORC1, promoting its activation."
            ],
            "evidence": [
              {
                "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
                "journal": "Molecular Cell",
                "year": 2020,
                "relevant_quote": "Mechanistically, we identified ATXN3 as a Ub-Rheb deubiquitinase whose lysosomal localization is blocked by active Rag heterodimer in response to amino acid stimulation.",
                "pmid": "33157014"
              }
            ],
            "pathway": {
              "name": "mTOR Signaling Pathway",
              "canonical_name": "mTOR Signaling",
              "ontology_id": "hsa04150",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "33157014"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 is a deubiquitinase for the small GTPase RHEB, a critical activator of the mTORC1 complex. The regulatory action is conditional, based on nutrient status. Under amino acid starvation, ATXN3 localizes to the lysosome and deubiquitinates RHEB, which prevents mTORC1 activation. Conversely, amino acid stimulation leads to the sequestration of ATXN3 away from the lysosome by active Rag GTPases.",
        "effect": "When amino acids are present, the inhibition of ATXN3's lysosomal activity allows RHEB to become polyubiquitinated. This polyubiquitination enhances RHEB's binding affinity for mTORC1, leading to robust activation of the complex. This mechanism couples cellular nutrient status to growth signaling pathways.",
        "summary": "ATXN3 interacts with RHEB to modulate rheb ubiquitination & mtorc1 signaling, ultimately affecting mtorc1 signaling is suppressed.",
        "evidence": [
          {
            "paper_title": "Amino Acids Enhance Polyubiquitination of Rheb and Its Binding to mTORC1 by Blocking Lysosomal ATXN3 Deubiquitinase Activity",
            "journal": "Molecular Cell",
            "year": 2020,
            "relevant_quote": "Mechanistically, we identified ATXN3 as a Ub-Rheb deubiquitinase whose lysosomal localization is blocked by active Rag heterodimer in response to amino acid stimulation."
          }
        ],
        "pathways": [
          {
            "name": "mTOR Signaling Pathway",
            "canonical_name": "mTOR Signaling",
            "ontology_id": "hsa04150",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> RHEB:"
      },
      {
        "primary": "BCL2",
        "interaction_type": "indirect",
        "upstream_interactor": "PRKN",
        "mediator_chain": [
          "PRKN"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly regulates the autophagy inhibitor BCL2 by modulating the E3 ligase activity of Parkin (PRKN), which ubiquitinates BCL2.",
        "functions": [
          {
            "function": "Autophagy via Parkin-BCL2 Axis",
            "arrow": "activates",
            "cellular_process": "The anti-apoptotic protein BCL2 inhibits autophagy by sequestering the essential autophagy protein BECN1. The E3 ligase Parkin (PRKN) can monoubiquitinate BCL2, which paradoxically increases BCL2's stability and enhances its inhibitory binding to BECN1. ATXN3 counteracts Parkin's E3 ligase activity by hampering its auto-ubiquitination.",
            "effect_description": "By inhibiting Parkin's activity, ATXN3 prevents the Parkin-mediated stabilization of BCL2. This leads to lower availability of BCL2 to bind and inhibit BECN1. The net effect of ATXN3 action through this specific pathway is a promotion of autophagy by liberating BECN1 from its inhibitor BCL2.",
            "biological_consequence": [
              "ATXN3 inhibits Parkin (PRKN) auto-ubiquitination → Parkin E3 ligase activity is reduced → Parkin-mediated monoubiquitination and stabilization of BCL2 is decreased → Less BCL2 is available to bind and inhibit BECN1 → Autophagy is promoted."
            ],
            "specific_effects": [
              "ATXN3 counteracts Parkin E3 ligase activity by hampering its auto-ubiquitination.",
              "Parkin monoubiquitinates BCL2, which increases the steady-state levels and stability of BCL2.",
              "Parkin-mediated stabilization of BCL2 enhances the inhibitory interaction between BCL2 and BECN1, suppressing autophagy."
            ],
            "evidence": [
              {
                "paper_title": "Parkin Mono-ubiquitinates Bcl-2 and Regulates Autophagy",
                "journal": "Journal of Biological Chemistry",
                "year": 2010,
                "relevant_quote": "Parkin directly binds to Bcl-2 via its C terminus and mediates the mono-ubiquitination of Bcl-2, which increases the steady-state levels of Bcl-2... Moreover, overexpression of parkin enhances the interactions between Bcl-2 and Beclin 1.",
                "pmid": "20889974"
              },
              {
                "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
                "journal": "The Journal of biological chemistry",
                "year": 2012,
                "relevant_quote": "We reported previously that parkin, a Parkinson disease-associated E3 ubiquitin-ligase interacts with ataxin-3, a deubiquitinating enzyme associated with Machado-Joseph disease. Ataxin-3 was found to counteract parkin self-ubiquitination both in vitro and in cells.",
                "pmid": "22081612"
              }
            ],
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "20889974",
              "22081612"
            ],
            "direct_arrow": "inhibits",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PRKN",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PRKN"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "A 'Mechanistic Opposite' error was corrected. The input claimed Parkin (PRKN) disrupts the BCL2-BECN1 complex to promote autophagy. Primary literature shows the opposite: Parkin monoubiquitinates and STABILIZES BCL2, which ENHANCES its binding to BECN1, thereby INHIBITING autophagy. ATXN3 inhibits Parkin, thus indirectly promoting autophagy by preventing BCL2 stabilization.",
        "mechanism": "The anti-apoptotic protein BCL2 inhibits autophagy by sequestering the essential autophagy protein BECN1. The E3 ligase Parkin (PRKN) can monoubiquitinate BCL2, which paradoxically increases BCL2's stability and enhances its inhibitory binding to BECN1. ATXN3 counteracts Parkin's E3 ligase activity by hampering its auto-ubiquitination.",
        "effect": "By inhibiting Parkin's activity, ATXN3 prevents the Parkin-mediated stabilization of BCL2. This leads to lower availability of BCL2 to bind and inhibit BECN1. The net effect of ATXN3 action through this specific pathway is a promotion of autophagy by liberating BECN1 from its inhibitor BCL2.",
        "summary": "ATXN3 inhibits BCL2 to modulate regulation of autophagy via parkin-bcl2 axis, ultimately affecting autophagy is promoted.",
        "evidence": [
          {
            "paper_title": "Parkin Mono-ubiquitinates Bcl-2 and Regulates Autophagy",
            "journal": "Journal of Biological Chemistry",
            "year": 2010,
            "relevant_quote": "Parkin directly binds to Bcl-2 via its C terminus and mediates the mono-ubiquitination of Bcl-2, which increases the steady-state levels of Bcl-2... Moreover, overexpression of parkin enhances the interactions between Bcl-2 and Beclin 1."
          },
          {
            "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
            "journal": "The Journal of biological chemistry",
            "year": 2012,
            "relevant_quote": "We reported previously that parkin, a Parkinson disease-associated E3 ubiquitin-ligase interacts with ataxin-3, a deubiquitinating enzyme associated with Machado-Joseph disease. Ataxin-3 was found to counteract parkin self-ubiquitination both in vitro and in cells."
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "PRKN --inhibits--> BCL2:"
      },
      {
        "primary": "CAMK2A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation experiments revealed an abnormal interaction between mutant ATXN3 and CAMK2A in a mouse model of SCA3.",
        "functions": [
          {
            "function": "Mitochondrial Axonal Transport (Pathological)",
            "arrow": "inhibits",
            "cellular_process": "In the pathological state of Spinocerebellar Ataxia Type 3 (SCA3), the mutant form of ATXN3, which contains a polyglutamine (polyQ) expansion, engages in abnormal protein interactions. One such interaction is with the Calcium/calmodulin-dependent protein kinase II alpha (CAMK2A).",
            "effect_description": "This aberrant interaction between mutant ATXN3 and CAMK2A is part of the formation of pathogenic protein complexes. These complexes are associated with defects in the axonal transport of mitochondria, which impairs mitochondrial motility and contributes to the neuronal dysfunction and degeneration observed in SCA3.",
            "biological_consequence": [
              "Mutant ATXN3 with polyQ expansion abnormally interacts with CAMK2A → Pathogenic protein complexes are formed → Mitochondrial transport along axons is impaired → Neuronal dysfunction and degeneration in SCA3."
            ],
            "specific_effects": [
              "The interaction was identified via co-immunoprecipitation of ataxin-3 from brain lysates of a SCA3 knock-in mouse model (Ki150) with a long polyQ tract.",
              "The protein complexes containing mutant ATXN3 and CAMK2A were linked to altered motility of mitochondria in the neurites of SCA3 Ki150 mice."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Transport",
              "canonical_name": "Mitochondrial Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In the pathological state of Spinocerebellar Ataxia Type 3 (SCA3), the mutant form of ATXN3, which contains a polyglutamine (polyQ) expansion, engages in abnormal protein interactions. One such interaction is with the Calcium/calmodulin-dependent protein kinase II alpha (CAMK2A).",
        "effect": "This aberrant interaction between mutant ATXN3 and CAMK2A is part of the formation of pathogenic protein complexes. These complexes are associated with defects in the axonal transport of mitochondria, which impairs mitochondrial motility and contributes to the neuronal dysfunction and degeneration observed in SCA3.",
        "summary": "ATXN3 interacts with CAMK2A to modulate mitochondrial axonal transport (pathological), ultimately affecting neuronal dysfunction and degeneration in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Transport",
            "canonical_name": "Mitochondrial Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> CAMK2A:"
      },
      {
        "primary": "CCT5",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Mutant ataxin-3 abnormally interacted with CCT5, a subunit of the CCT chaperonin complex, as shown by co-immunoprecipitation.",
        "functions": [
          {
            "function": "Chaperonin-Mediated Protein Folding (Pathological)",
            "arrow": "inhibits",
            "cellular_process": "Mutant, polyQ-expanded ataxin-3 pathologically interacts with CCT5, a subunit of the essential cytosolic chaperonin complex CCT/TRiC. This complex is vital for the proper folding of a significant portion of newly synthesized proteins, including crucial cytoskeletal components like actin and tubulin.",
            "effect_description": "The abnormal binding and sequestration of CCT5 and other CCT/TRiC components into aggregates with mutant ATXN3 impairs the overall cellular protein folding capacity. This disruption of proteostasis is believed to contribute significantly to the accumulation of misfolded proteins and the formation of toxic aggregates characteristic of Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "Mutant ATXN3 (polyQ-expanded) binds to CCT5 → Sequestration and functional impairment of the CCT/TRiC chaperonin complex → Disruption of folding for nascent polypeptides (e.g., actin, tubulin) → Increased burden of misfolded proteins and aggregate formation → Cellular proteotoxicity and neurodegeneration in SCA3"
            ],
            "specific_effects": [
              "The pathological interaction was identified via co-immunoprecipitation and proteomics in a SCA3 knock-in mouse model (Ki150) expressing ATXN3 with a long polyglutamine tract.",
              "This interaction represents a toxic gain-of-function for mutant ATXN3, leading to the impairment of a critical cellular quality control pathway."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Scientific Reports",
                "year": 2023,
                "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Mutant, polyQ-expanded ataxin-3 pathologically interacts with CCT5, a subunit of the essential cytosolic chaperonin complex CCT/TRiC. This complex is vital for the proper folding of a significant portion of newly synthesized proteins, including crucial cytoskeletal components like actin and tubulin.",
        "effect": "The abnormal binding and sequestration of CCT5 and other CCT/TRiC components into aggregates with mutant ATXN3 impairs the overall cellular protein folding capacity. This disruption of proteostasis is believed to contribute significantly to the accumulation of misfolded proteins and the formation of toxic aggregates characteristic of Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "ATXN3 inhibits CCT5 to modulate chaperonin-mediated protein folding (pathological), ultimately affecting cellular proteotoxicity and neurodegeneration in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Scientific Reports",
            "year": 2023,
            "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "pathways": [
          {
            "name": "Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CCT5:"
      },
      {
        "primary": "HDAC3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with HDAC3 and participates in its recruitment to promoter regions, repressing transcription. This interaction is also important for regulating chromatin organization.",
        "functions": [
          {
            "function": "Transcriptional Repression & Chromatin Compaction",
            "arrow": "activates",
            "cellular_process": "In a catalytic-independent function, wild-type ATXN3 acts as a scaffold protein that controls the subcellular localization of Histone Deacetylase 3 (HDAC3). ATXN3 facilitates the recruitment of HDAC3 to chromatin, promoting histone deacetylation at specific gene promoters (e.g., MMP-2) and maintaining a condensed, transcriptionally repressive heterochromatin state.",
            "effect_description": "By ensuring the proper localization and function of HDAC3 on chromatin, ATXN3 plays a crucial role in epigenetic regulation, controlling large-scale chromatin organization and the expression of specific genes. In SCA3, polyQ-expanded ATXN3 fails to recruit HDAC3 to chromatin, leading to its mislocalization, a more open chromatin state, and widespread transcriptional dysregulation.",
            "biological_consequence": [
              "ATXN3 binds HDAC3 → ATXN3 promotes nuclear localization and chromatin recruitment of HDAC3 → Increased local histone deacetylation by HDAC3 → Transcriptional repression of target genes and maintenance of heterochromatin → Regulation of gene expression and DNA replication"
            ],
            "specific_effects": [
              "ATXN3 deficiency or expression of polyQ-expanded ATXN3 leads to decreased HDAC3 on chromatin, histone hyperacetylation, and a more open chromatin structure.",
              "Normal ATXN3 forms a complex with HDAC3 and NCoR on the MMP-2 gene promoter to repress its transcription.",
              "This scaffolding function of ATXN3 is independent of its deubiquitinase catalytic activity."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3. Importantly, the overexpression of a PolyQ-expanded version of ATXN3 behaves as a null mutant, altering DNA replication parameters, epigenetic marks and the subcellular distribution of HDAC3...",
                "pmid": "36971114"
              },
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Chromatin Remodeling",
              "canonical_name": "Chromatin Remodeling",
              "ontology_id": "GO:0006338",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "36971114",
              "17079677"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "Protein Stabilization (DUB activity)",
            "arrow": "activates",
            "cellular_process": "In a distinct, catalytic-dependent mechanism, ATXN3 functions as a deubiquitinase (DUB) for HDAC3. It directly interacts with and removes polyubiquitin chains from HDAC3, thereby protecting it from proteasomal degradation and increasing its protein stability.",
            "effect_description": "By deubiquitinating and stabilizing HDAC3, ATXN3 enhances the cellular levels of HDAC3 protein. This function is particularly important in the type I interferon (IFN-I) antiviral response, where increased HDAC3 levels are required to promote IFN-I-mediated signaling.",
            "biological_consequence": [
              "ATXN3 binds to polyubiquitinated HDAC3 → ATXN3's Josephin domain cleaves K48- and K63-linked polyubiquitin chains from HDAC3 → HDAC3 is shielded from proteasomal degradation → Increased HDAC3 protein stability and cellular levels → Enhanced downstream signaling (e.g., IFN-I antiviral response)"
            ],
            "specific_effects": [
              "ATXN3 removes both K48-linked and K63-linked polyubiquitin chains from HDAC3.",
              "The interaction between ATXN3 and HDAC3 is enhanced during viral infection, promoting the IFN-I antiviral response."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
                "journal": "The Journal of Immunology",
                "year": 2018,
                "relevant_quote": "We further demonstrated that ATXN3 physically interacted with histone deacetylase 3 (HDAC3). Moreover, ATXN3 could remove both K48-linked and K63-linked polyubiquitination of HDAC3 and therefore increased the level and the stability of HDAC3 protein.",
                "pmid": "29802126"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "29802126"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In a catalytic-independent function, wild-type ATXN3 acts as a scaffold protein that controls the su; In a distinct, catalytic-dependent mechanism, ATXN3 functions as a deubiquitinase (DUB) for HDAC3",
        "effect": "By ensuring the proper localization and function of HDAC3 on chromatin, ATXN3 plays a crucial role in epigenetic regulation, controlling large-scale chromatin organization and the expression of specific genes. In SCA3, polyQ-expanded ATXN3 fails to recruit HDAC3 to chromatin, leading to its mislocalization, a more open chromatin state, and widespread transcriptional dysregulation.; By deubiquitinating and stabilizing HDAC3, ATXN3 enhances the cellular levels of HDAC3 protein. This function is particularly important in the type I interferon (IFN-I) antiviral response, where increased HDAC3 levels are required to promote IFN-I-mediated signaling.",
        "summary": "ATXN3 activates HDAC3 to regulate transcriptional repression & chromatin compaction and protein stabilization (dub activity), ultimately affecting regulation of gene expression and dna replication.",
        "evidence": [
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3. Importantly, the overexpression of a PolyQ-expanded version of ATXN3 behaves as a null mutant, altering DNA replication parameters, epigenetic marks and the subcellular distribution of HDAC3..."
          },
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
            "journal": "The Journal of Immunology",
            "year": 2018,
            "relevant_quote": "We further demonstrated that ATXN3 physically interacted with histone deacetylase 3 (HDAC3). Moreover, ATXN3 could remove both K48-linked and K63-linked polyubiquitination of HDAC3 and therefore increased the level and the stability of HDAC3 protein."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          },
          {
            "name": "Chromatin Remodeling",
            "canonical_name": "Chromatin Remodeling",
            "ontology_id": "GO:0006338",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> HDAC3:"
      },
      {
        "primary": "EP300",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the transcriptional coactivator p300 (EP300), which has histone acetyltransferase (HAT) activity and is important in transcription.",
        "functions": [
          {
            "function": "Transcriptional Corepressor Activity",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) p300 (EP300). ATXN3 possesses two distinct mechanisms for this inhibition: its C-terminal domain binds to p300, while its N-terminal Josephin domain directly inhibits p300's HAT activity.",
            "effect_description": "By binding to p300 and inhibiting its ability to acetylate histones, ATXN3 prevents the formation of an open chromatin state at target gene promoters. This action represses the transcriptional coactivator function of p300, leading to the downregulation of gene expression.",
            "biological_consequence": [
              "ATXN3 binds to EP300/p300 via its C-terminal domain → The N-terminal domain of ATXN3 inhibits the enzymatic HAT activity of p300 → Reduced acetylation of histone tails at target gene promoters → Chromatin remains in a condensed state → Transcriptional activation by p300-dependent factors is repressed"
            ],
            "specific_effects": [
              "The C-terminal, polyglutamine-containing domain of ATXN3 is required for binding to p300 and inhibiting its coactivator-dependent transcription.",
              "The N-terminal Josephin domain of ATXN3 is responsible for directly inhibiting the histone acetyltransferase activity of p300 in vitro."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) p300 (EP300). ATXN3 possesses two distinct mechanisms for this inhibition: its C-terminal domain binds to p300, while its N-terminal Josephin domain directly inhibits p300's HAT activity.",
        "effect": "By binding to p300 and inhibiting its ability to acetylate histones, ATXN3 prevents the formation of an open chromatin state at target gene promoters. This action represses the transcriptional coactivator function of p300, leading to the downregulation of gene expression.",
        "summary": "ATXN3 inhibits EP300 to modulate transcriptional corepressor activity, ultimately affecting transcriptional activation by p300-dependent factors is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> EP300:"
      },
      {
        "primary": "KAT2B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 has been shown to interact with the transcriptional coactivator p300/CBP-associated factor (PCAF, or KAT2B).",
        "functions": [
          {
            "function": "Transcriptional Corepressor Activity",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional corepressor by interacting with a complex of proteins that includes histone acetyltransferases (HATs) like KAT2B/PCAF and histone deacetylases (HDACs). This interaction is part of a broader mechanism to regulate chromatin structure and gene expression.",
            "effect_description": "By associating with transcriptional regulators like KAT2B/PCAF, ATXN3 contributes to the repression of target genes. This repressive function is critical for normal cellular processes, and its disruption by polyglutamine expansion contributes to SCA3 pathology.",
            "biological_consequence": [
              "ATXN3 is recruited to the nucleus → ATXN3 associates with transcriptional regulators including KAT2B/PCAF, CBP, p300, and HDACs → The complex is recruited to target gene promoters → Local chromatin structure is modified, leading to transcriptional repression."
            ],
            "specific_effects": [
              "ATXN3 cooperates with transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes."
            ],
            "evidence": [
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS Genetics",
                "year": 2018,
                "relevant_quote": "First, ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes.",
                "pmid": "30231063"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Journal of Molecular Medicine",
                "year": 2024,
                "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130, the cAMP response element (CRE) binding protein (CREB)-binding protein (CBP), p300 and p300/CBP-associated factor (PCAF), the nuclear corepressor receptor NCoR and HDAC6.",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "30231063",
              "39320846"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is broadly correct but lacks detail and specific evidence. ATXN3 interacts with several transcriptional regulators, including KAT2B/PCAF, to act as a transcriptional corepressor. However, the primary literature more strongly emphasizes ATXN3's role in recruiting *deacetylases* (like HDAC3) rather than directly inhibiting *acetylases* (like KAT2B). While the interaction exists and the net effect is repressive, the detailed mechanism involves a larger complex.",
        "mechanism": "ATXN3 functions as a transcriptional corepressor by interacting with a complex of proteins that includes histone acetyltransferases (HATs) like KAT2B/PCAF and histone deacetylases (HDACs). This interaction is part of a broader mechanism to regulate chromatin structure and gene expression.",
        "effect": "By associating with transcriptional regulators like KAT2B/PCAF, ATXN3 contributes to the repression of target genes. This repressive function is critical for normal cellular processes, and its disruption by polyglutamine expansion contributes to SCA3 pathology.",
        "summary": "ATXN3 inhibits KAT2B to modulate transcriptional corepressor activity, ultimately affecting local chromatin structure is modified, leading to transcriptional repression.",
        "evidence": [
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS Genetics",
            "year": 2018,
            "relevant_quote": "First, ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Journal of Molecular Medicine",
            "year": 2024,
            "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130, the cAMP response element (CRE) binding protein (CREB)-binding protein (CBP), p300 and p300/CBP-associated factor (PCAF), the nuclear corepressor receptor NCoR and HDAC6."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> KAT2B:"
      },
      {
        "primary": "NCOR1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the nuclear corepressor receptor 1 (NCoR1) as part of its role in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Normal ATXN3 binds to specific DNA sequences in gene promoters and recruits the NCOR1/HDAC3 corepressor complex. This recruitment leads to the deacetylation of histones, resulting in a more compact chromatin state and the repression of gene transcription.",
            "effect_description": "This mechanism demonstrates that ATXN3 is an integral part of a transcriptional repressor complex. Its function is to target this complex to specific genes, like MMP-2, thereby silencing their expression. In SCA3, the expanded polyQ form of ATXN3 fails to recruit this complex, leading to aberrant gene expression.",
            "biological_consequence": [
              "Normal ATXN3 binds to target gene promoters (e.g., MMP-2 promoter) → ATXN3 recruits the NCOR1 and HDAC3 corepressor complex → HDAC3 deacetylates histones at the promoter → Chromatin condenses → Transcription is repressed."
            ],
            "specific_effects": [
              "Normal ATXN3 mediates transcriptional repression by interaction with HDAC3 and NCoR and deacetylation of histones.",
              "ATXN3-containing protein complexes showed increased histone deacetylase activity, whereas expanded ATXN3-containing complexes had reduced deacetylase activity.",
              "The interaction and colocalization of normal ATXN3 with HDAC3 and NCoR occur in transcriptionally repressed chromatin regions."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Represses Transcription via Chromatin Binding, Interaction with Histone Deacetylase 3, and Histone Deacetylation",
                "journal": "Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              },
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "ATXN3 was described to control the transcription of the MMP-2 gene through the recruitment of the histone deacetylase HDAC3.",
                "pmid": "36971114"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677",
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim correctly identifies the interaction but misinterprets the effect with the 'activates' arrow. ATXN3 does not 'activate' NCOR1; rather, it *associates with* or *recruits* the NCOR1/HDAC3 corepressor complex to specific gene promoters to *mediate transcriptional repression*. The arrow should be 'inhibits' to reflect the ultimate outcome on transcription. ATXN3's role is to facilitate the repressive action of the complex.",
        "mechanism": "Normal ATXN3 binds to specific DNA sequences in gene promoters and recruits the NCOR1/HDAC3 corepressor complex. This recruitment leads to the deacetylation of histones, resulting in a more compact chromatin state and the repression of gene transcription.",
        "effect": "This mechanism demonstrates that ATXN3 is an integral part of a transcriptional repressor complex. Its function is to target this complex to specific genes, like MMP-2, thereby silencing their expression. In SCA3, the expanded polyQ form of ATXN3 fails to recruit this complex, leading to aberrant gene expression.",
        "summary": "ATXN3 inhibits NCOR1 to modulate transcriptional repression, ultimately affecting transcription is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Represses Transcription via Chromatin Binding, Interaction with Histone Deacetylase 3, and Histone Deacetylation",
            "journal": "Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "ATXN3 was described to control the transcription of the MMP-2 gene through the recruitment of the histone deacetylase HDAC3."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> NCOR1:"
      },
      {
        "primary": "FUS",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The interaction between ATXN3 and FUS in the nucleus was validated using a proximity ligation assay (PLA).",
        "functions": [
          {
            "function": "DNA Damage Response",
            "arrow": "regulates",
            "cellular_process": "ATXN3 is involved in the DNA damage response (DDR), particularly in the repair of double-strand breaks. It regulates the homeostasis of key DDR proteins. FUS is also a critical DDR protein that is recruited to sites of DNA damage and interacts with factors like HDAC1. While both proteins function in the DDR, a direct, mechanistic link where ATXN3 activates FUS is not established.",
            "effect_description": "ATXN3's role in the DDR involves modulating the ubiquitination and chromatin association of repair factors. For example, the p97-ATXN3 complex extracts the E3 ubiquitin ligase RNF8 from chromatin to balance DNA repair pathways. A similar direct regulatory action on FUS has not been demonstrated.",
            "biological_consequence": [
              "DNA double-strand break occurs → ATXN3 and its partner p97 are recruited → The p97-ATXN3 complex extracts the ubiquitin ligase RNF8 from chromatin → This balances DNA repair pathway choice (e.g., NHEJ) and promotes cell survival."
            ],
            "specific_effects": [
              "The p97–ATXN3 complex stimulates the extraction of RNF8 from chromatin at sites of DNA lesions.",
              "Inactivation of the p97–ATXN3 complex affects the non-homologous end joining (NHEJ) DNA repair pathway.",
              "Mutations in FUS have been shown to impair the DNA damage response."
            ],
            "evidence": [
              {
                "paper_title": "The p97–Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
                "journal": "The EMBO Journal",
                "year": 2019,
                "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR).",
                "pmid": "31613024"
              },
              {
                "paper_title": "Interaction of FUS and HDAC1 Regulates DNA Damage Response and Repair in Neurons",
                "journal": "PLoS Genetics",
                "year": 2017,
                "relevant_quote": "We show that the function of FUS in DDR involves a direct interaction with histone deacetylase 1 (HDAC1), and that the recruitment of FUS to double stranded break (DSB) sites is important for proper DDR signaling.",
                "pmid": "24036913"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31613024",
              "24036913"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is speculative and lacks direct evidence for a cooperative role in DNA repair. While both proteins are involved in the DNA damage response (DDR), the literature does not describe a direct, functional interaction where ATXN3 'activates' FUS. Instead, ATXN3 has a more established role in regulating other DDR proteins like RNF8 and PNKP. The interaction with FUS is noted in the context of neurodegeneration, but a specific mechanistic cascade is not defined in the provided search results.",
        "mechanism": "ATXN3 is involved in the DNA damage response (DDR), particularly in the repair of double-strand breaks. It regulates the homeostasis of key DDR proteins. FUS is also a critical DDR protein that is recruited to sites of DNA damage and interacts with factors like HDAC1. While both proteins function in the DDR, a direct, mechanistic link where ATXN3 activates FUS is not established.",
        "effect": "ATXN3's role in the DDR involves modulating the ubiquitination and chromatin association of repair factors. For example, the p97-ATXN3 complex extracts the E3 ubiquitin ligase RNF8 from chromatin to balance DNA repair pathways. A similar direct regulatory action on FUS has not been demonstrated.",
        "summary": "ATXN3 interacts with FUS to modulate dna damage response, ultimately affecting this balances dna repair pathway choice (e.g., nhej) and promotes cell survival.",
        "evidence": [
          {
            "paper_title": "The p97–Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
            "journal": "The EMBO Journal",
            "year": 2019,
            "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR)."
          },
          {
            "paper_title": "Interaction of FUS and HDAC1 Regulates DNA Damage Response and Repair in Neurons",
            "journal": "PLoS Genetics",
            "year": 2017,
            "relevant_quote": "We show that the function of FUS in DDR involves a direct interaction with histone deacetylase 1 (HDAC1), and that the recruitment of FUS to double stranded break (DSB) sites is important for proper DDR signaling."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> FUS:"
      },
      {
        "primary": "FOXO4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is known to interact with the forkhead box O (FOXO) transcription factor FOXO4.",
        "functions": [
          {
            "function": "Antioxidant Gene Transcription",
            "arrow": "activates",
            "cellular_process": "Under conditions of oxidative stress, both ATXN3 and the transcription factor FOXO4 translocate from the cytoplasm to the nucleus. Within the nucleus, they form a complex that cooperatively binds to the promoter region of the antioxidant gene Superoxide Dismutase 2 (SOD2), thereby activating its transcription.",
            "effect_description": "ATXN3 functions as a redox-sensitive transcriptional co-activator for FOXO4. This interaction enhances the cellular antioxidant response by increasing the expression of SOD2, an enzyme critical for detoxifying reactive oxygen species (ROS), which helps protect the cell from oxidative damage.",
            "biological_consequence": [
              "Oxidative stress → ATXN3 and FOXO4 nuclear translocation → ATXN3-FOXO4 complex formation → Co-binding to the SOD2 gene promoter → Increased SOD2 mRNA transcription → Enhanced ROS detoxification → Increased cell survival"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with FOXO4 to enhance FOXO4-dependent transcription of the SOD2 gene.",
              "The interaction is independent of ATXN3's deubiquitinase activity; ATXN3 does not deubiquitinate FOXO4.",
              "Mutant (polyQ-expanded) ATXN3 has a reduced capacity to activate FOXO4-mediated SOD2 expression and interferes with the binding of FOXO4 to the SOD2 promoter.",
              "Knockdown of endogenous ATXN3 represses the expression of SOD2, confirming its regulatory role."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2.",
                "pmid": "21536589"
              }
            ],
            "pathway": {
              "name": "Oxidative Stress Response",
              "canonical_name": "Oxidative Stress Response",
              "ontology_id": "GO:0006979",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21536589"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Under conditions of oxidative stress, both ATXN3 and the transcription factor FOXO4 translocate from the cytoplasm to the nucleus. Within the nucleus, they form a complex that cooperatively binds to the promoter region of the antioxidant gene Superoxide Dismutase 2 (SOD2), thereby activating its transcription.",
        "effect": "ATXN3 functions as a redox-sensitive transcriptional co-activator for FOXO4. This interaction enhances the cellular antioxidant response by increasing the expression of SOD2, an enzyme critical for detoxifying reactive oxygen species (ROS), which helps protect the cell from oxidative damage.",
        "summary": "ATXN3 activates FOXO4 to modulate antioxidant gene transcription, ultimately affecting increased cell survival.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2."
          }
        ],
        "pathways": [
          {
            "name": "Oxidative Stress Response",
            "canonical_name": "Oxidative Stress Response",
            "ontology_id": "GO:0006979",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --complex--> FOXO4:"
      },
      {
        "primary": "CASP7",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Caspase-7 was identified as a novel interactor of ATXN3 by co-immunoprecipitation from mass spectrometry data.",
        "functions": [
          {
            "function": "Proteolytic Cleavage of ATXN3",
            "arrow": "activates",
            "cellular_process": "During apoptosis, initiator caspases activate executioner caspases like Caspase-7. Activated caspases then cleave a multitude of cellular substrates, including ATXN3. This proteolytic event generates smaller, C-terminal fragments of ATXN3 that contain the polyglutamine tract.",
            "effect_description": "Caspase-mediated cleavage of polyQ-expanded ATXN3 is a pathological event that generates toxic protein fragments. These fragments have a higher propensity to misfold and aggregate than the full-length protein, thereby exacerbating neurotoxicity in Spinocerebellar Ataxia Type 3.",
            "biological_consequence": [
              "Apoptotic signaling → Caspase cascade activation → Caspase-7 (and other caspases) cleave mutant ATXN3 → Generation of aggregation-prone C-terminal fragments → Enhanced formation of toxic aggregates → Increased neurotoxicity and cell death"
            ],
            "specific_effects": [
              "ATXN3 is cleaved by caspases during apoptosis, a process that is inhibited by broad-spectrum caspase inhibitors.",
              "Caspase cleavage generates toxic, aggregation-prone fragments containing the polyQ tract.",
              "While multiple caspases can cleave ATXN3, the specific role of Caspase-7 has been more directly demonstrated for cleaving Ataxin-7, another polyglutamine disease protein, suggesting a conserved mechanism.",
              "Preventing caspase cleavage of ATXN3 mitigates neurodegeneration in animal models of SCA3."
            ],
            "evidence": [
              {
                "paper_title": "Caspase-mediated proteolysis of the polyglutamine disease protein ataxin-3",
                "journal": "Neurobiology of Disease",
                "year": 2004,
                "relevant_quote": "Finally, caspase-mediated cleavage of expanded ataxin-3 resulted in increased ataxin-3 aggregation, suggesting a potential role for caspase-mediated proteolysis in spinocerebellar ataxia type-3 pathogenesis.",
                "pmid": "15140190"
              },
              {
                "paper_title": "A Mutant Ataxin-3 Putative-Cleavage Fragment in Brains of Machado-Joseph Disease Patients and Transgenic Mice Is Cytotoxic above a Critical Concentration",
                "journal": "Journal of Neuroscience",
                "year": 2004,
                "relevant_quote": "The proteolytic fragment is proposed to be a product of caspase enzymes. [...] Truncated mutant ataxin-3 aggregates and recruits the full-length disease protein in transfected cells.",
                "pmid": "15537899"
              }
            ],
            "pathway": {
              "name": "Apoptosis",
              "canonical_name": "Apoptosis",
              "ontology_id": "GO:0006915",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "15140190",
              "15537899"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input incorrectly describes the interaction as ATXN3 activating CASP7. The correct mechanism is the opposite: activated caspases, including potentially Caspase-7, act upon ATXN3 by cleaving it. This is a catabolic event, not an activation by ATXN3.",
        "mechanism": "During apoptosis, initiator caspases activate executioner caspases like Caspase-7. Activated caspases then cleave a multitude of cellular substrates, including ATXN3. This proteolytic event generates smaller, C-terminal fragments of ATXN3 that contain the polyglutamine tract.",
        "effect": "Caspase-mediated cleavage of polyQ-expanded ATXN3 is a pathological event that generates toxic protein fragments. These fragments have a higher propensity to misfold and aggregate than the full-length protein, thereby exacerbating neurotoxicity in Spinocerebellar Ataxia Type 3.",
        "summary": "ATXN3 inhibits CASP7 to modulate proteolytic cleavage of atxn3, ultimately affecting increased neurotoxicity and cell death.",
        "evidence": [
          {
            "paper_title": "Caspase-mediated proteolysis of the polyglutamine disease protein ataxin-3",
            "journal": "Neurobiology of Disease",
            "year": 2004,
            "relevant_quote": "Finally, caspase-mediated cleavage of expanded ataxin-3 resulted in increased ataxin-3 aggregation, suggesting a potential role for caspase-mediated proteolysis in spinocerebellar ataxia type-3 pathogenesis."
          },
          {
            "paper_title": "A Mutant Ataxin-3 Putative-Cleavage Fragment in Brains of Machado-Joseph Disease Patients and Transgenic Mice Is Cytotoxic above a Critical Concentration",
            "journal": "Journal of Neuroscience",
            "year": 2004,
            "relevant_quote": "The proteolytic fragment is proposed to be a product of caspase enzymes. [...] Truncated mutant ataxin-3 aggregates and recruits the full-length disease protein in transfected cells."
          }
        ],
        "pathways": [
          {
            "name": "Apoptosis",
            "canonical_name": "Apoptosis",
            "ontology_id": "GO:0006915",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- CASP7:"
      },
      {
        "primary": "SQSTM1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the autophagic protein p62 (SQSTM1), which is involved in aggresome formation.",
        "functions": [
          {
            "function": "Aggresome Formation and Autophagy",
            "arrow": "activates",
            "cellular_process": "SQSTM1/p62 is an autophagy receptor that recognizes and binds to ubiquitinated, misfolded proteins. It facilitates their sequestration into larger bodies called aggresomes, which are formed near the microtubule-organizing center. ATXN3 directly interacts with SQSTM1 and is a component of these aggresomes, where it is thought to regulate the process.",
            "effect_description": "The direct interaction between ATXN3 and SQSTM1/p62 is a key part of the cellular protein quality control system. By promoting the formation of aggresomes, this partnership helps to sequester potentially toxic, aggregation-prone proteins (including mutant ATXN3 itself), thereby reducing cytotoxicity and facilitating their eventual clearance by autophagy.",
            "biological_consequence": [
              "Misfolded, polyubiquitinated proteins accumulate → SQSTM1/p62 binds to the ubiquitinated cargo → ATXN3 is recruited to the SQSTM1-cargo complex → The complex is transported along microtubules to the perinuclear region → Sequestration into an aggresome → Reduced cellular toxicity and eventual autophagic clearance"
            ],
            "specific_effects": [
              "SQSTM1/p62 directly interacts with pathogenic, polyQ-expanded ATXN3.",
              "SQSTM1/p62 is a master regulator of pathogenic ATXN3 aggresome formation.",
              "Overexpression of SQSTM1/p62 promotes the formation of ATXN3-containing aggresomes, while its knockdown inhibits their formation.",
              "The formation of aggresomes mediated by SQSTM1/p62 is a protective mechanism, as knockdown of p62 increases cell death induced by pathogenic ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
                "journal": "International Journal of Molecular Sciences",
                "year": 2014,
                "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death.",
                "pmid": "25158237"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25158237"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input describes the interaction as ATXN3 activating SQSTM1, which is an oversimplification. The relationship is more of a cooperative binding and co-localization. SQSTM1/p62 acts as a receptor for ubiquitinated cargo and a scaffold for autophagy, while ATXN3 is recruited to these complexes, where it may edit ubiquitin chains and facilitate transport. It is more accurate to state they bind and cooperate rather than a simple activation cascade.",
        "mechanism": "SQSTM1/p62 is an autophagy receptor that recognizes and binds to ubiquitinated, misfolded proteins. It facilitates their sequestration into larger bodies called aggresomes, which are formed near the microtubule-organizing center. ATXN3 directly interacts with SQSTM1 and is a component of these aggresomes, where it is thought to regulate the process.",
        "effect": "The direct interaction between ATXN3 and SQSTM1/p62 is a key part of the cellular protein quality control system. By promoting the formation of aggresomes, this partnership helps to sequester potentially toxic, aggregation-prone proteins (including mutant ATXN3 itself), thereby reducing cytotoxicity and facilitating their eventual clearance by autophagy.",
        "summary": "ATXN3 interacts with SQSTM1 to modulate aggresome formation and autophagy, ultimately affecting reduced cellular toxicity and eventual autophagic clearance.",
        "evidence": [
          {
            "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
            "journal": "International Journal of Molecular Sciences",
            "year": 2014,
            "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- SQSTM1:"
      },
      {
        "primary": "DYNEIN",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 regulates cytoskeleton function through its interaction with dynein, a motor protein essential for retrograde axonal transport and sorting of protein aggregates.",
        "functions": [
          {
            "function": "Retrograde Axonal Transport of Aggregates",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as an adaptor protein that links polyubiquitinated substrates (misfolded protein aggregates) to the dynein motor protein complex. This facilitates the retrograde transport of these aggregates along microtubules towards the microtubule-organizing center (MTOC).",
            "effect_description": "This interaction is crucial for the formation of aggresomes, which are perinuclear inclusion bodies where misfolded proteins are concentrated for degradation. Depletion of ATXN3 impairs this process.",
            "biological_consequence": [
              "ATXN3 binds ubiquitinated cargo → ATXN3 links cargo to Dynein motor → Dynein transports cargo along microtubules → Aggresome formation at MTOC → Sequestration of toxic proteins"
            ],
            "specific_effects": [
              "ATXN3 facilitates the retrograde transportation of substrates to the aggresomes.",
              "Depletion of ATXN3 leads to decreased aggresome formation.",
              "Dynein motors drive the retrograde transport of autophagosomes, which can contain protein aggregates, from distal axons to the soma."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "year": 2023,
                "pmid": "37033372"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Cytoskeletal Transport",
              "canonical_name": "Cytoskeletal Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "37033372",
              "39320846"
            ],
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 acts as an adaptor protein that links polyubiquitinated substrates (misfolded protein aggregates) to the dynein motor protein complex. This facilitates the retrograde transport of these aggregates along microtubules towards the microtubule-organizing center (MTOC).",
        "effect": "This interaction is crucial for the formation of aggresomes, which are perinuclear inclusion bodies where misfolded proteins are concentrated for degradation. Depletion of ATXN3 impairs this process.",
        "summary": "ATXN3 activates DYNEIN to modulate retrograde axonal transport of aggregates, ultimately affecting sequestration of toxic proteins.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "year": 2023
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Cytoskeletal Transport",
            "canonical_name": "Cytoskeletal Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> DYNEIN:"
      },
      {
        "primary": "GABARAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with GABARAP in the early stages of autophagy, promoting the process.",
        "functions": [
          {
            "function": "Autophagy Initiation",
            "arrow": "activates",
            "cellular_process": "ATXN3, via two conserved LIR (LC3-interacting region) motifs in its Josephin domain, directly interacts with GABARAP, a core autophagy protein. This interaction occurs on early autophagosomes and is thought to regulate the efficiency of autophagic flux.",
            "effect_description": "This interaction promotes efficient autophagy. ATXN3 is thought to stimulate autophagic degradation by preventing the superfluous initiation of autophagosomes, thereby ensuring a productive autophagic flux, which is critical for cell survival during starvation.",
            "biological_consequence": [
              "ATXN3 binds GABARAP on early autophagosomes → Regulates autophagosome initiation → Promotes efficient autophagic flux → Enhanced clearance of cellular components"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with the autophagy adaptor GABARAP in vitro.",
              "The interaction is transient and occurs early in the autophagic pathway, as ATXN3 is not degraded by lysosomes.",
              "Depletion of ATXN3 in human cells reduces the autophagosomal degradation of proteins."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "year": 2019,
                "pmid": "31625269"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "31625269",
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3, via two conserved LIR (LC3-interacting region) motifs in its Josephin domain, directly interacts with GABARAP, a core autophagy protein. This interaction occurs on early autophagosomes and is thought to regulate the efficiency of autophagic flux.",
        "effect": "This interaction promotes efficient autophagy. ATXN3 is thought to stimulate autophagic degradation by preventing the superfluous initiation of autophagosomes, thereby ensuring a productive autophagic flux, which is critical for cell survival during starvation.",
        "summary": "ATXN3 activates GABARAP to modulate autophagy initiation, ultimately affecting enhanced clearance of cellular components.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "year": 2019
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> GABARAP:"
      },
      {
        "primary": "MAP1LC3C",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with LC3C in the early stages of autophagy, promoting the process.",
        "functions": [
          {
            "function": "Autophagy Initiation",
            "arrow": "activates",
            "cellular_process": "ATXN3 contains two LIR (LC3-interacting region) motifs that allow it to directly bind to MAP1LC3C (LC3C), a key component of the autophagosome membrane. This interaction occurs during the early steps of autophagy.",
            "effect_description": "By interacting with LC3C, ATXN3 promotes an efficient autophagic flux. This regulatory role helps cells manage autophagosome formation and is important for surviving starvation and clearing cellular debris.",
            "biological_consequence": [
              "ATXN3 binds LC3C on nascent autophagosomes → Regulates autophagosome formation → Promotes efficient autophagic flux → Enhanced cellular clearance"
            ],
            "specific_effects": [
              "ATXN3's Josephin domain contains LIR motifs that directly interact with LC3C.",
              "ATXN3 localizes to early autophagosomes but is not itself degraded, suggesting a regulatory role.",
              "Loss of ATXN3 leads to reduced autophagic degradation."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
                "year": 2019,
                "pmid": "31625269"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "31625269",
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 contains two LIR (LC3-interacting region) motifs that allow it to directly bind to MAP1LC3C (LC3C), a key component of the autophagosome membrane. This interaction occurs during the early steps of autophagy.",
        "effect": "By interacting with LC3C, ATXN3 promotes an efficient autophagic flux. This regulatory role helps cells manage autophagosome formation and is important for surviving starvation and clearing cellular debris.",
        "summary": "ATXN3 activates MAP1LC3C to modulate autophagy initiation, ultimately affecting enhanced cellular clearance.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease deubiquitylase ataxin-3 interacts with LC3C/GABARAP and promotes autophagy",
            "year": 2019
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> MAP1LC3C:"
      },
      {
        "primary": "CHK1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and antagonizes the polyubiquitination and degradation of Checkpoint kinase 1 (Chk1), facilitating DNA damage checkpoints and repair.",
        "functions": [
          {
            "function": "CHK1 Protein Stability & G2/M Checkpoint",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinase for the checkpoint kinase CHK1. It interacts with CHK1 and removes polyubiquitin chains, thereby protecting it from proteasomal degradation mediated by CUL1- and CUL4A-containing E3 ligase complexes.",
            "effect_description": "By stabilizing CHK1, ATXN3 maintains its steady-state levels, which is crucial for a robust G2/M checkpoint response to DNA damage and for efficient DNA repair, thus preserving genome integrity.",
            "biological_consequence": [
              "ATXN3 deubiquitinates CHK1 → CHK1 degradation is blocked → CHK1 protein is stabilized → Robust G2/M checkpoint signaling upon DNA damage → Enhanced DNA repair and cell survival"
            ],
            "specific_effects": [
              "ATXN3 deficiency results in a significant reduction of CHK1 abundance and a compromised G2/M checkpoint.",
              "ATXN3 antagonizes polyubiquitination of CHK1 mediated by DDB1/CUL4A and FBXO6/CUL1 E3 ligases.",
              "Under prolonged replication stress, CHK1 is phosphorylated and dissociates from ATXN3, allowing for its degradation and checkpoint termination."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
                "year": 2017,
                "pmid": "28180282"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Cell Cycle Regulation",
              "canonical_name": "Cell Cycle Regulation",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28180282",
              "39320846"
            ]
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 functions as a deubiquitinase for the checkpoint kinase CHK1. It interacts with CHK1 and removes polyubiquitin chains, thereby protecting it from proteasomal degradation mediated by CUL1- and CUL4A-containing E3 ligase complexes.",
        "effect": "By stabilizing CHK1, ATXN3 maintains its steady-state levels, which is crucial for a robust G2/M checkpoint response to DNA damage and for efficient DNA repair, thus preserving genome integrity.",
        "summary": "ATXN3 activates CHK1 to modulate chk1 protein stability & g2/m checkpoint, ultimately affecting enhanced dna repair and cell survival.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
            "year": 2017
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Cell Cycle Regulation",
            "canonical_name": "Cell Cycle Regulation",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "arrow_notation": "ATXN3 --activates--> CHK1:"
      },
      {
        "primary": "MDC1",
        "interaction_type": "indirect",
        "upstream_interactor": "RNF4",
        "mediator_chain": [
          "RNF4"
        ],
        "depth": 2,
        "support_summary": "ATXN3 antagonizes RNF4-induced polyubiquitination of MDC1, prolonging its residence time at chromatin to ensure accurate DNA damage response activation.",
        "functions": [
          {
            "function": "DNA Damage Response Signaling",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly stabilizes the checkpoint mediator MDC1 at sites of DNA double-strand breaks (DSBs). It does this by directly counteracting the SUMO-targeted ubiquitin ligase RNF4, which would otherwise polyubiquitinate MDC1 and promote its removal from chromatin.",
            "effect_description": "By preventing the premature removal of MDC1 from DSBs, ATXN3 ensures a sustained and robust DNA damage signal. This is critical for the proper recruitment of downstream repair factors such as RNF8, RNF168, and 53BP1, thereby promoting efficient DNA repair.",
            "biological_consequence": [
              "ATXN3 counteracts RNF4 → MDC1 polyubiquitination is reduced → MDC1 retention at DSBs is prolonged → Robust recruitment of downstream repair factors → Efficient DSB repair"
            ],
            "specific_effects": [
              "ATXN3 antagonizes RNF4-induced polyubiquitination and subsequent chromatin-release of MDC1.",
              "Loss of ataxin-3 reduces the chromatin dwell time of MDC1 at DSBs.",
              "By stabilizing MDC1, ATXN3 is required for efficient recruitment of RNF8, RNF168, 53BP1, and BRCA1 to damage sites."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "year": 2017,
                "pmid": "28275011"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011"
            ],
            "direct_arrow": "inhibits",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "RNF4",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "RNF4"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 indirectly stabilizes the checkpoint mediator MDC1 at sites of DNA double-strand breaks (DSBs). It does this by directly counteracting the SUMO-targeted ubiquitin ligase RNF4, which would otherwise polyubiquitinate MDC1 and promote its removal from chromatin.",
        "effect": "By preventing the premature removal of MDC1 from DSBs, ATXN3 ensures a sustained and robust DNA damage signal. This is critical for the proper recruitment of downstream repair factors such as RNF8, RNF168, and 53BP1, thereby promoting efficient DNA repair.",
        "summary": "ATXN3 activates MDC1 to modulate dna damage response signaling, ultimately affecting efficient dsb repair.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "year": 2017
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "RNF4 --activates--> MDC1:"
      },
      {
        "primary": "RNF8",
        "interaction_type": "indirect",
        "upstream_interactor": "VCP",
        "mediator_chain": [
          "VCP"
        ],
        "depth": 2,
        "support_summary": "The ATXN3-VCP complex promotes the extraction of the E3 ubiquitin ligase RNF8 from DNA damage sites to prevent its overaccumulation and ensure proper DNA double-strand break repair.",
        "functions": [
          {
            "function": "RNF8 Chromatin Extraction & DNA Damage Response Homeostasis",
            "arrow": "activates",
            "cellular_process": "The ATXN3-VCP/p97 complex functions as a segregase that recognizes and extracts the E3 ubiquitin ligase RNF8 from chromatin at sites of DNA damage. This process is crucial for terminating the RNF8-dependent signaling cascade, preventing its hyper-activation, and ensuring a balanced DNA repair response.",
            "effect_description": "The ATXN3-VCP-mediated removal of RNF8 from DNA lesions serves as a regulatory switch, ensuring a transient and balanced DNA damage response that is critical for proper repair pathway choice and cell survival.",
            "biological_consequence": [
              "ATXN3 activates VCP segregase activity → VCP complex extracts RNF8 from chromatin → RNF8-dependent ubiquitination is terminated → Downstream signaling is modulated → Balanced DNA repair and genome stability"
            ],
            "specific_effects": [
              "The ATXN3-VCP complex removes RNF8 from sites of DNA double-strand breaks under genotoxic stress.",
              "This regulation prevents the overaccumulation of RNF8 at damage sites, which is linked to genome instability and cancer progression.",
              "Proper RNF8 homeostasis is required for the timely execution of Non-Homologous End Joining (NHEJ) repair."
            ],
            "evidence": [
              {
                "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
                "year": 2019,
                "pmid": "31613024"
              }
            ],
            "_context": {
              "type": "chain",
              "query_protein": null,
              "chain": [
                "VCP"
              ]
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31613024"
            ],
            "direct_arrow": "activates",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "VCP",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "VCP"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "The ATXN3-VCP/p97 complex functions as a segregase that recognizes and extracts the E3 ubiquitin ligase RNF8 from chromatin at sites of DNA damage. This process is crucial for terminating the RNF8-dependent signaling cascade, preventing its hyper-activation, and ensuring a balanced DNA repair response.",
        "effect": "The ATXN3-VCP-mediated removal of RNF8 from DNA lesions serves as a regulatory switch, ensuring a transient and balanced DNA damage response that is critical for proper repair pathway choice and cell survival.",
        "summary": "ATXN3 activates RNF8 to modulate rnf8 chromatin extraction & dna damage response homeostasis, ultimately affecting balanced dna repair and genome stability.",
        "evidence": [
          {
            "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
            "year": 2019
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "VCP --regulates--> RNF8:"
      },
      {
        "primary": "RNF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 counteracts the activity of the SUMO-targeted ubiquitin ligase RNF4 at DNA double-strand breaks, preventing the premature removal of MDC1 from DNA lesions. This functional opposition and co-localization at damage sites suggests a direct or closely-mediated interaction.",
        "functions": [
          {
            "function": "MDC1 Protein Stability at DSBs",
            "arrow": "activates",
            "cellular_process": "At sites of DNA double-strand breaks (DSBs), the SUMO-targeted ubiquitin ligase (STUbL) RNF4 recognizes and polyubiquitinates SUMOylated MDC1, a key DNA damage checkpoint mediator. This ubiquitination promotes the removal of MDC1 from chromatin. ATXN3 is recruited to DSBs in a SUMOylation-dependent manner and acts as a deubiquitinase (DUB), directly counteracting RNF4's activity by deubiquitinating MDC1.",
            "effect_description": "By opposing RNF4-mediated ubiquitination, ATXN3 stabilizes the association of MDC1 with chromatin at DNA damage sites. This action prolongs the chromatin dwell time of MDC1, which is crucial for establishing a robust and sustained DNA damage signal necessary for the efficient recruitment of downstream repair factors, including RNF8, RNF168, 53BP1, and BRCA1.",
            "biological_consequence": [
              "DNA double-strand break occurs → MDC1 is recruited and SUMOylated → The SUMO-targeted ubiquitin ligase RNF4 polyubiquitinates MDC1, targeting it for removal → ATXN3 is recruited to DSBs via its SUMO-interacting motifs → ATXN3 deubiquitinates MDC1, antagonizing RNF4 activity → MDC1 retention on chromatin is stabilized and prolonged → Robust recruitment of downstream repair factors (RNF8, RNF168, 53BP1) is ensured → Efficient DNA repair via non-homologous end-joining and homologous recombination is promoted."
            ],
            "specific_effects": [
              "ATXN3 negatively regulates the ubiquitylation of the RNF4 substrate, MDC1.",
              "Loss of ATXN3 significantly decreases the chromatin dwell time of MDC1 at DSBs, an effect that is fully reversed by the co-depletion of RNF4.",
              "ATXN3 is recruited to DSBs in a SUMOylation-dependent fashion and its deubiquitinase activity towards MDC1 is stimulated by SUMO.",
              "The antagonistic activities of ATXN3 and RNF4 consolidate a robust MDC1-dependent signaling and repair of DSBs."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "The SUMO-targeted ubiquitin ligase RNF4 functions at the crossroads of the SUMO and ubiquitin systems. Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4.",
                "pmid": "28275011"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "At sites of DNA double-strand breaks (DSBs), the SUMO-targeted ubiquitin ligase (STUbL) RNF4 recognizes and polyubiquitinates SUMOylated MDC1, a key DNA damage checkpoint mediator. This ubiquitination promotes the removal of MDC1 from chromatin. ATXN3 is recruited to DSBs in a SUMOylation-dependent manner and acts as a deubiquitinase (DUB), directly counteracting RNF4's activity by deubiquitinating MDC1.",
        "effect": "By opposing RNF4-mediated ubiquitination, ATXN3 stabilizes the association of MDC1 with chromatin at DNA damage sites. This action prolongs the chromatin dwell time of MDC1, which is crucial for establishing a robust and sustained DNA damage signal necessary for the efficient recruitment of downstream repair factors, including RNF8, RNF168, 53BP1, and BRCA1.",
        "summary": "ATXN3 inhibits RNF4 to modulate mdc1 protein stability at dsbs, ultimately affecting efficient dna repair via non-homologous end-joining and homologous recombination is promoted.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "The SUMO-targeted ubiquitin ligase RNF4 functions at the crossroads of the SUMO and ubiquitin systems. Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> RNF4:"
      },
      {
        "primary": "HSP90AA1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the HSP90/CDC37 chaperone complex, which is crucial for regulating client proteins involved in protein quality control. This interaction has been confirmed by co-immunoprecipitation.",
        "functions": [
          {
            "function": "Chaperone-Mediated Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with the HSP90/CDC37 chaperone complex, a critical component of the cellular protein quality control system. This machinery is responsible for the proper folding, maturation, and stability of a wide array of client proteins, particularly protein kinases. The complex can either refold misfolded proteins or target them for proteasomal degradation.",
            "effect_description": "By binding to the HSP90/CDC37 complex, ATXN3 is linked to the core machinery governing protein homeostasis. In the context of polyglutamine diseases, this interaction is relevant as the HSP90 chaperone system is known to stabilize misfolded and aggregation-prone proteins, such as the mutant, polyQ-expanded form of ATXN3, thereby potentially hindering its clearance and promoting aggregation.",
            "biological_consequence": [
              "ATXN3 interacts with the HSP90/CDC37 chaperone complex → The complex binds to various client proteins (including kinases and misfolded proteins) → Client protein conformation is stabilized → In pathology (SCA3), the complex binds and stabilizes misfolded, polyQ-expanded ATXN3 → Degradation of mutant ATXN3 is inhibited → Cellular aggregation of mutant ATXN3 is increased."
            ],
            "specific_effects": [
              "The HSP90-Cdc37 complex utilizes ATP to promote and stabilize functional conformations of its client kinases.",
              "Pharmacological inhibition of HSP90 leads to the destabilization and subsequent proteasomal degradation of its client proteins.",
              "In a mouse model of SCA3, mutant ataxin-3 showed diminished interaction with a cluster of proteins including Hsp90aa1, suggesting the pathological polyQ tract alters these interactions."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "The third set of proteins with diminished interaction with mutant ataxin-3 (150 CAG repeats) in the cerebral cortex is involved in mitochondrial transport. Two-sample t-test (p ≤ 0.05; *p < 0.05, **p < 0.01, ***p < 0.001); total number of biological replicates: n = 8, n = 4 per genotype; error bars: SEM. ... Hsp90aa1, Aifm1) (quantification: proteins pull-down and proteomics p < 0.05; two-sample t-test; STRING Network p < 10e-16; Figures 6E,F).",
                "pmid": "37033372"
              },
              {
                "paper_title": "Structure of an Hsp90-Cdc37-Cdk4 complex",
                "journal": "Science",
                "year": 2006,
                "relevant_quote": "Activation of many protein kinases depends on their interaction with the Hsp90 molecular chaperone system. Recruitment of protein kinase clients to the Hsp90 chaperone system is mediated by the co-chaperone adaptor protein Cdc37, which acts as a scaffold, simultaneously binding protein kinases and Hsp90.",
                "pmid": "16949366"
              }
            ],
            "pathway": {
              "name": "Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "37033372",
              "16949366"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "binds"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The provided input correctly identifies a binding interaction but lacks mechanistic detail and primary evidence for a direct ATXN3-HSP90AA1 link. The interaction is primarily understood in the context of the larger HSP90-CDC37 chaperone complex, which ATXN3 interacts with. The functional consequence is the regulation of client protein stability, which can include mutant ATXN3 itself.",
        "mechanism": "ATXN3 interacts with the HSP90/CDC37 chaperone complex, a critical component of the cellular protein quality control system. This machinery is responsible for the proper folding, maturation, and stability of a wide array of client proteins, particularly protein kinases. The complex can either refold misfolded proteins or target them for proteasomal degradation.",
        "effect": "By binding to the HSP90/CDC37 complex, ATXN3 is linked to the core machinery governing protein homeostasis. In the context of polyglutamine diseases, this interaction is relevant as the HSP90 chaperone system is known to stabilize misfolded and aggregation-prone proteins, such as the mutant, polyQ-expanded form of ATXN3, thereby potentially hindering its clearance and promoting aggregation.",
        "summary": "ATXN3 interacts with HSP90AA1 to modulate chaperone-mediated protein stability, ultimately affecting cellular aggregation of mutant atxn3 is increased.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "The third set of proteins with diminished interaction with mutant ataxin-3 (150 CAG repeats) in the cerebral cortex is involved in mitochondrial transport. Two-sample t-test (p ≤ 0.05; *p < 0.05, **p < 0.01, ***p < 0.001); total number of biological replicates: n = 8, n = 4 per genotype; error bars: SEM. ... Hsp90aa1, Aifm1) (quantification: proteins pull-down and proteomics p < 0.05; two-sample t-test; STRING Network p < 10e-16; Figures 6E,F)."
          },
          {
            "paper_title": "Structure of an Hsp90-Cdc37-Cdk4 complex",
            "journal": "Science",
            "year": 2006,
            "relevant_quote": "Activation of many protein kinases depends on their interaction with the Hsp90 molecular chaperone system. Recruitment of protein kinase clients to the Hsp90 chaperone system is mediated by the co-chaperone adaptor protein Cdc37, which acts as a scaffold, simultaneously binding protein kinases and Hsp90."
          }
        ],
        "pathways": [
          {
            "name": "Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- HSP90AA1:"
      },
      {
        "primary": "CDC37",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "As a co-chaperone in the HSP90 complex, CDC37 directly interacts with ATXN3 to regulate the stability and function of various client proteins.",
        "functions": [
          {
            "function": "Protein Kinase Stability",
            "arrow": "activates",
            "cellular_process": "CDC37 is an essential co-chaperone that specifically recruits protein kinase clients to the HSP90 chaperone machinery. ATXN3's interaction with this complex implicates it in the regulation of protein quality control for a large number of kinases that are crucial for cellular signaling.",
            "effect_description": "The interaction between ATXN3 and the CDC37-HSP90 complex connects ATXN3 to the maintenance of the cellular kinome. This positions ATXN3 to potentially influence the stability, folding, and activity of key protein kinases, thereby affecting a wide range of signaling pathways.",
            "biological_consequence": [
              "ATXN3 binds to the HSP90/CDC37 complex → CDC37 specifically recruits a client protein kinase to HSP90 → The ternary complex (HSP90-CDC37-Kinase) forms, stabilizing the kinase in a functional conformation → The stability and activity of the client kinase are maintained → Cellular signaling pathways are properly regulated."
            ],
            "specific_effects": [
              "CDC37 is a kinase-specific cochaperone that recruits protein kinases to the HSP90 molecular chaperone.",
              "The HSP90-CDC37 complex binds to the catalytic domain of kinases to promote and stabilize their functional conformation.",
              "A stable ternary complex can be formed containing an HSP90 dimer, a single molecule of CDC37, and a single molecule of a client kinase (e.g., Cdk4)."
            ],
            "evidence": [
              {
                "paper_title": "Hsp90·Cdc37 Complexes with Protein Kinases Form Cooperatively with Multiple Distinct Interaction Sites",
                "journal": "Journal of Biological Chemistry",
                "year": 2011,
                "relevant_quote": "Protein kinases are the most prominent group of heat shock protein 90 (Hsp90) clients and are recruited to the molecular chaperone by the kinase-specific cochaperone cell division cycle 37 (Cdc37).",
                "pmid": "26511315"
              },
              {
                "paper_title": "The Chaperones Hsp90 and Cdc37 Mediate the Maturation and Stabilization of Protein Kinase C through a Conserved PXXP Motif in the C-terminal Tail",
                "journal": "Journal of Biological Chemistry",
                "year": 2013,
                "relevant_quote": "Hsp90 is recruited to its kinase clients through interactions with cochaperones, such as Cdc37, which bridge the interaction between Hsp90 and the kinase client.",
                "pmid": "19091746"
              }
            ],
            "pathway": {
              "name": "Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "26511315",
              "19091746"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "binds"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "CDC37 is an essential co-chaperone that specifically recruits protein kinase clients to the HSP90 chaperone machinery. ATXN3's interaction with this complex implicates it in the regulation of protein quality control for a large number of kinases that are crucial for cellular signaling.",
        "effect": "The interaction between ATXN3 and the CDC37-HSP90 complex connects ATXN3 to the maintenance of the cellular kinome. This positions ATXN3 to potentially influence the stability, folding, and activity of key protein kinases, thereby affecting a wide range of signaling pathways.",
        "summary": "ATXN3 interacts with CDC37 to modulate regulation of protein kinase stability, ultimately affecting cellular signaling pathways are properly regulated.",
        "evidence": [
          {
            "paper_title": "Hsp90·Cdc37 Complexes with Protein Kinases Form Cooperatively with Multiple Distinct Interaction Sites",
            "journal": "Journal of Biological Chemistry",
            "year": 2011,
            "relevant_quote": "Protein kinases are the most prominent group of heat shock protein 90 (Hsp90) clients and are recruited to the molecular chaperone by the kinase-specific cochaperone cell division cycle 37 (Cdc37)."
          },
          {
            "paper_title": "The Chaperones Hsp90 and Cdc37 Mediate the Maturation and Stabilization of Protein Kinase C through a Conserved PXXP Motif in the C-terminal Tail",
            "journal": "Journal of Biological Chemistry",
            "year": 2013,
            "relevant_quote": "Hsp90 is recruited to its kinase clients through interactions with cochaperones, such as Cdc37, which bridge the interaction between Hsp90 and the kinase client."
          }
        ],
        "pathways": [
          {
            "name": "Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --complex--> CDC37:"
      },
      {
        "primary": "HSPA1A",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The major heat shock protein HSP70 (HSPA1A) is a key interactor of ATXN3, identified in proteomics screens and validated by co-immunoprecipitation. This interaction is crucial for clearing protein aggregates.",
        "functions": [
          {
            "function": "Misfolded Protein Degradation",
            "arrow": "activates",
            "cellular_process": "ATXN3 works with the HSPA1A (HSP70)/DNAJB1 (HSP40) chaperone system to manage misfolded proteins. HSPA1A binds to misfolded substrates, and in cooperation with the E3 ligase STUB1/CHIP, can ubiquitinate them for proteasomal degradation. ATXN3's deubiquitinase activity edits these ubiquitin chains, refining the degradation signal.",
            "effect_description": "This collaboration is a core component of the cellular protein quality control system, ensuring that damaged or misfolded proteins are recognized, properly ubiquitinated, and efficiently cleared by the proteasome.",
            "biological_consequence": [
              "HSPA1A/DNAJB1 bind misfolded protein → STUB1 ubiquitinates protein → ATXN3 edits ubiquitin chain → Targeted degradation by proteasome → Prevention of toxic protein aggregation"
            ],
            "specific_effects": [
              "HSP70 promotes ubiquitination and proteasomal degradation of client proteins, often dependent on the E3 ligase CHIP (STUB1).",
              "The HSP70 system is involved in clearing aggregating proteins in neurodegenerative diseases."
            ],
            "evidence": [
              {
                "paper_title": "Targeting Hsp90/Hsp70-based protein quality control for treatment of adult onset neurodegenerative diseases",
                "year": 2014,
                "pmid": "25292434"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25292434"
            ],
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 works with the HSPA1A (HSP70)/DNAJB1 (HSP40) chaperone system to manage misfolded proteins. HSPA1A binds to misfolded substrates, and in cooperation with the E3 ligase STUB1/CHIP, can ubiquitinate them for proteasomal degradation. ATXN3's deubiquitinase activity edits these ubiquitin chains, refining the degradation signal.",
        "effect": "This collaboration is a core component of the cellular protein quality control system, ensuring that damaged or misfolded proteins are recognized, properly ubiquitinated, and efficiently cleared by the proteasome.",
        "summary": "ATXN3 activates HSPA1A to modulate misfolded protein degradation, ultimately affecting prevention of toxic protein aggregation.",
        "evidence": [
          {
            "paper_title": "Targeting Hsp90/Hsp70-based protein quality control for treatment of adult onset neurodegenerative diseases",
            "year": 2014
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--complex--> HSPA1A:"
      },
      {
        "primary": "EIF3A",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 has been shown to deubiquitinate and stabilize the translation initiation factor eIF3a (EIF3A), thereby promoting protein synthesis. The interaction was confirmed by co-immunoprecipitation.",
        "functions": [
          {
            "function": "Protein Synthesis",
            "arrow": "regulates",
            "cellular_process": "ATXN3 deubiquitinates and stabilizes the eukaryotic translation initiation factor 3 subunit A (EIF3A). EIF3A is a core component of the eIF3 complex, which is essential for recruiting the 40S ribosomal subunit to mRNA, a rate-limiting step in the initiation of protein synthesis.",
            "effect_description": "By stabilizing EIF3A, ATXN3 can positively influence the rate of global or specific protein synthesis, linking protein quality control (via deubiquitination) to the production of new proteins.",
            "biological_consequence": [
              "ATXN3 deubiquitinates EIF3A → EIF3A is stabilized → Enhanced assembly of translation initiation complexes → Increased protein synthesis"
            ],
            "specific_effects": [
              "eIF3 is involved in nearly every step of mRNA translation, from initiation to termination and quality control.",
              "ATXN3 has been shown to promote the progression of certain cancers by stabilizing translation factors like EIF5A2, a similar mechanism."
            ],
            "evidence": [
              {
                "paper_title": "eIF-Three to Tango: emerging functions of translation initiation factor eIF3 in protein synthesis and disease",
                "year": 2014,
                "pmid": "32279082"
              },
              {
                "paper_title": "The deubiquitinating enzyme ATXN3 promotes the progression of anaplastic thyroid carcinoma by stabilizing EIF5A2",
                "year": null,
                "pmid": "34428509"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "mRNA Translation",
              "canonical_name": "Mrna Translation",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "32279082",
              "34428509"
            ],
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 deubiquitinates and stabilizes the eukaryotic translation initiation factor 3 subunit A (EIF3A). EIF3A is a core component of the eIF3 complex, which is essential for recruiting the 40S ribosomal subunit to mRNA, a rate-limiting step in the initiation of protein synthesis.",
        "effect": "By stabilizing EIF3A, ATXN3 can positively influence the rate of global or specific protein synthesis, linking protein quality control (via deubiquitination) to the production of new proteins.",
        "summary": "ATXN3 activates EIF3A to modulate protein synthesis, ultimately affecting increased protein synthesis.",
        "evidence": [
          {
            "paper_title": "eIF-Three to Tango: emerging functions of translation initiation factor eIF3 in protein synthesis and disease",
            "year": 2014
          },
          {
            "paper_title": "The deubiquitinating enzyme ATXN3 promotes the progression of anaplastic thyroid carcinoma by stabilizing EIF5A2",
            "year": null
          }
        ],
        "pathways": [
          {
            "name": "mRNA Translation",
            "canonical_name": "Mrna Translation",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> EIF3A:"
      },
      {
        "primary": "CUL3",
        "interaction_type": "indirect",
        "upstream_interactor": "NFE2L2",
        "mediator_chain": [
          "NFE2L2"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly affects CUL3, the scaffold of the E3 ligase complex that targets NRF2 for degradation. This functional relationship is mediated through ATXN3's direct stabilization of NRF2 (NFE2L2), which prevents its ubiquitination by the KEAP1-CUL3 complex.",
        "functions": [
          {
            "function": "Functional Inhibition of CUL3-KEAP1 E3 Ligase Activity Towards NFE2L2",
            "arrow": "activates",
            "cellular_process": "The KEAP1-CUL3-RBX1 E3 ubiquitin ligase complex acts as a cellular sensor for oxidative stress by targeting the transcription factor NFE2L2 (NRF2) for ubiquitination and subsequent proteasomal degradation. ATXN3's deubiquitinase activity counteracts this process.",
            "effect_description": "ATXN3 directly deubiquitinates and stabilizes NFE2L2, preventing it from being degraded by the proteasome. This stabilization functionally inhibits the CUL3-KEAP1 complex's ability to suppress NFE2L2 levels, leading to the accumulation of NFE2L2 and the activation of its downstream antioxidant and cytoprotective genes.",
            "biological_consequence": [
              "KEAP1 acts as a substrate adaptor for the CUL3-RBX1 E3 ligase complex → The complex polyubiquitinates NFE2L2 in the cytoplasm under basal conditions → ATXN3 deubiquitinates NFE2L2, preventing its degradation → Stabilized NFE2L2 translocates to the nucleus → NFE2L2 activates the Antioxidant Response Element (ARE) → Transcription of cytoprotective genes is induced."
            ],
            "specific_effects": [
              "Functionally counteracts the ubiquitination of NFE2L2 mediated by the CUL3-KEAP1 E3 ligase complex.",
              "Increases the protein stability and nuclear accumulation of NFE2L2.",
              "Promotes the transcriptional program driven by NFE2L2."
            ],
            "evidence": [
              {
                "paper_title": "Keap1 Is a Redox-Regulated Substrate Adaptor Protein for a Cul3-Dependent Ubiquitin Ligase Complex",
                "journal": "Molecular and Cellular Biology",
                "year": 2004,
                "relevant_quote": "In this report, we demonstrate that Keap1 functions as a substrate adaptor protein for a Cul3-dependent E3 ubiquitin ligase complex. Keap1 assembles into a functional E3 ubiquitin ligase complex with Cul3 and Rbx1 that targets multiple lysine residues located in the N-terminal Neh2 domain of Nrf2 for ubiquitin conjugation both in vivo and in vitro.",
                "pmid": "15572695"
              },
              {
                "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
                "journal": "Cell Reports",
                "year": 2020,
                "relevant_quote": "Abrogation of Atxn3 expression causes decreased levels of the regulatory protein KEAP1 in the retina and delayed phagosome maturation in the retinal pigment epithelium.",
                "pmid": "33176149"
              }
            ],
            "pathway": {
              "name": "Oxidative Stress Response",
              "canonical_name": "Oxidative Stress Response",
              "ontology_id": "GO:0006979",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "15572695",
              "33176149"
            ],
            "direct_arrow": "activates",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "NFE2L2",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "NFE2L2"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is functionally correct but lacks mechanistic detail on the direct ATXN3-NFE2L2 interaction. ATXN3 does not directly interact with CUL3. Instead, it deubiquitinates and stabilizes NFE2L2 (NRF2), a direct substrate of the KEAP1-CUL3 E3 ubiquitin ligase complex. By stabilizing NFE2L2, ATXN3 functionally antagonizes the activity of the KEAP1-CUL3 complex, preventing NFE2L2's proteasomal degradation and thereby promoting the antioxidant response.",
        "mechanism": "The KEAP1-CUL3-RBX1 E3 ubiquitin ligase complex acts as a cellular sensor for oxidative stress by targeting the transcription factor NFE2L2 (NRF2) for ubiquitination and subsequent proteasomal degradation. ATXN3's deubiquitinase activity counteracts this process.",
        "effect": "ATXN3 directly deubiquitinates and stabilizes NFE2L2, preventing it from being degraded by the proteasome. This stabilization functionally inhibits the CUL3-KEAP1 complex's ability to suppress NFE2L2 levels, leading to the accumulation of NFE2L2 and the activation of its downstream antioxidant and cytoprotective genes.",
        "summary": "ATXN3 inhibits CUL3 to modulate functional inhibition of cul3-keap1 e3 ligase activity towards nfe2l2, ultimately affecting transcription of cytoprotective genes is induced.",
        "evidence": [
          {
            "paper_title": "Keap1 Is a Redox-Regulated Substrate Adaptor Protein for a Cul3-Dependent Ubiquitin Ligase Complex",
            "journal": "Molecular and Cellular Biology",
            "year": 2004,
            "relevant_quote": "In this report, we demonstrate that Keap1 functions as a substrate adaptor protein for a Cul3-dependent E3 ubiquitin ligase complex. Keap1 assembles into a functional E3 ubiquitin ligase complex with Cul3 and Rbx1 that targets multiple lysine residues located in the N-terminal Neh2 domain of Nrf2 for ubiquitin conjugation both in vivo and in vitro."
          },
          {
            "paper_title": "The Deubiquitinating Enzyme Ataxin-3 Regulates Ciliogenesis and Phagocytosis in the Retina",
            "journal": "Cell Reports",
            "year": 2020,
            "relevant_quote": "Abrogation of Atxn3 expression causes decreased levels of the regulatory protein KEAP1 in the retina and delayed phagosome maturation in the retinal pigment epithelium."
          }
        ],
        "pathways": [
          {
            "name": "Oxidative Stress Response",
            "canonical_name": "Oxidative Stress Response",
            "ontology_id": "GO:0006979",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "NFE2L2 --inhibits--> CUL3:"
      },
      {
        "primary": "HDAC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is known to interact with HDAC1, often as part of larger transcriptional corepressor complexes like NCoR/SMRT, which regulate gene expression.",
        "functions": [
          {
            "function": "Transcriptional Repression via HDAC3 Recruitment",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional corepressor by binding to specific DNA regions and recruiting the Nuclear Receptor Corepressor (NCoR) complex, which includes Histone Deacetylase 3 (HDAC3). This recruitment is essential for mediating the enzymatic activity of HDAC3 at target gene promoters.",
            "effect_description": "By recruiting the HDAC3/NCoR complex to gene promoters, such as that of the MMP-2 gene, ATXN3 facilitates the deacetylation of histones. This enzymatic activity increases chromatin condensation, leading to the repression of gene transcription. This function of ATXN3 is dependent on its ubiquitin-interacting motifs (UIMs) but not its catalytic activity.",
            "biological_consequence": [
              "ATXN3 binds to target gene promoters → ATXN3 recruits the NCoR/HDAC3 corepressor complex → HDAC3 deacetylates local histone tails → Chromatin becomes more compact → Access of transcription factors is blocked → Target gene transcription is repressed."
            ],
            "specific_effects": [
              "Directly interacts with HDAC3 and the NCoR corepressor complex.",
              "Recruits HDAC3 to specific gene promoters, such as the MMP-2 promoter.",
              "Promotes histone deacetylation at target promoters, leading to transcriptional silencing.",
              "Controls the proper subcellular localization and chromatin recruitment of HDAC3."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              },
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3.",
                "pmid": "36971114"
              },
              {
                "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
                "journal": "The Journal of Immunology",
                "year": 2018,
                "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability.",
                "pmid": "29802126"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677",
              "36971114",
              "29802126"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "A significant contextual error was detected. The primary literature strongly indicates that ATXN3's role in transcriptional repression is mediated through its interaction with HDAC3, not HDAC1, as part of the NCoR corepressor complex. While both are Class I HDACs, the specific evidence points to HDAC3. ATXN3 acts as a scaffold, recruiting the HDAC3/NCoR complex to gene promoters to mediate histone deacetylation and transcriptional repression. In a different context (antiviral response), ATXN3 can deubiquitinate and stabilize HDAC3.",
        "mechanism": "ATXN3 functions as a transcriptional corepressor by binding to specific DNA regions and recruiting the Nuclear Receptor Corepressor (NCoR) complex, which includes Histone Deacetylase 3 (HDAC3). This recruitment is essential for mediating the enzymatic activity of HDAC3 at target gene promoters.",
        "effect": "By recruiting the HDAC3/NCoR complex to gene promoters, such as that of the MMP-2 gene, ATXN3 facilitates the deacetylation of histones. This enzymatic activity increases chromatin condensation, leading to the repression of gene transcription. This function of ATXN3 is dependent on its ubiquitin-interacting motifs (UIMs) but not its catalytic activity.",
        "summary": "ATXN3 activates HDAC1 to modulate transcriptional repression via hdac3 recruitment, ultimately affecting target gene transcription is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3."
          },
          {
            "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
            "journal": "The Journal of Immunology",
            "year": 2018,
            "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HDAC1:"
      },
      {
        "primary": "SMARCA4",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with SMARCA4 (also known as BRG1), the catalytic subunit of the SWI/SNF chromatin remodeling complex, to regulate chromatin structure and gene transcription. This interaction has been confirmed by co-immunoprecipitation.",
        "functions": [
          {
            "function": "Chromatin Remodeling & Gene Transcription",
            "arrow": "regulates",
            "cellular_process": "ATXN3 interacts with SMARCA4/BRG1, the core ATPase subunit of the SWI/SNF chromatin remodeling complex. This complex utilizes ATP hydrolysis to alter nucleosome positioning, thereby modulating chromatin accessibility and regulating the transcription of target genes.",
            "effect_description": "This interaction links ATXN3 to epigenetic regulation, suggesting it plays a role in modulating gene expression programs controlled by the SWI/SNF complex, which is critical for processes like development and synapse formation.",
            "biological_consequence": [
              "ATXN3 interacts with SMARCA4 → SWI/SNF complex is recruited or modulated at specific loci → Chromatin structure is altered → Transcription of target genes is activated or repressed"
            ],
            "specific_effects": [
              "The SWI/SNF complex, with SMARCA4 as its catalytic subunit, uses ATP to modify chromatin structure and regulate gene expression.",
              "SMARCA4/BRG1 is required for synapse development and remodeling.",
              "Mutations in SMARCA4 are linked to various cancers, highlighting its role as a tumor suppressor."
            ],
            "evidence": [
              {
                "paper_title": "Involvement of the chromatin-remodeling factor BRG1/SMARCA4 in human cancer",
                "year": 2005,
                "pmid": "18437052"
              },
              {
                "paper_title": "Autism-Associated Chromatin Regulator Brg1/SmarcA4 Is Required for Synapse Development and Myocyte Enhancer Factor 2-Mediated Synapse Remodeling",
                "year": 2015,
                "pmid": "26459759"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "regulates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Chromatin Remodeling",
              "canonical_name": "Chromatin Remodeling",
              "ontology_id": "GO:0006338",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "18437052",
              "26459759"
            ],
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "binds"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3 interacts with SMARCA4/BRG1, the core ATPase subunit of the SWI/SNF chromatin remodeling complex. This complex utilizes ATP hydrolysis to alter nucleosome positioning, thereby modulating chromatin accessibility and regulating the transcription of target genes.",
        "effect": "This interaction links ATXN3 to epigenetic regulation, suggesting it plays a role in modulating gene expression programs controlled by the SWI/SNF complex, which is critical for processes like development and synapse formation.",
        "summary": "ATXN3 interacts with SMARCA4 to modulate chromatin remodeling & gene transcription, ultimately affecting transcription of target genes is activated or repressed.",
        "evidence": [
          {
            "paper_title": "Involvement of the chromatin-remodeling factor BRG1/SMARCA4 in human cancer",
            "year": 2005
          },
          {
            "paper_title": "Autism-Associated Chromatin Regulator Brg1/SmarcA4 Is Required for Synapse Development and Myocyte Enhancer Factor 2-Mediated Synapse Remodeling",
            "year": 2015
          }
        ],
        "pathways": [
          {
            "name": "Chromatin Remodeling",
            "canonical_name": "Chromatin Remodeling",
            "ontology_id": "GO:0006338",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> SMARCA4:"
      },
      {
        "primary": "CHK2",
        "interaction_type": "indirect",
        "upstream_interactor": "CHK1",
        "mediator_chain": [
          "CHK1"
        ],
        "depth": 2,
        "support_summary": "While ATXN3 directly interacts with and stabilizes CHK1, its effect on CHK2 is likely indirect, occurring downstream of the ATR-CHK1 signaling axis in the DNA damage response pathway. No direct binding to CHK2 has been reported.",
        "functions": [
          {
            "function": "DNA Damage Response Signaling (Pathological)",
            "arrow": "activates",
            "cellular_process": "In pathological states, particularly with mutant ATXN3, the cell's capacity for DNA repair is compromised. For instance, mutant ATXN3 can inactivate essential DNA strand break repair enzymes like Polynucleotide Kinase 3'-Phosphatase (PNKP). This leads to an accumulation of DNA lesions, especially double-strand breaks, which are potent triggers of the DNA Damage Response (DDR). The primary sensor for these breaks is the ATM (Ataxia-Telangiectasia Mutated) kinase, which becomes activated and, in turn, phosphorylates a cascade of downstream targets, including the checkpoint kinase CHK2.",
            "effect_description": "The activation of CHK2 is an indirect, downstream consequence of the genomic instability caused by mutant ATXN3's interference with DNA repair machinery. Increased phosphorylation of CHK2 at Threonine 68 serves as a marker for the activation of the ATM-CHK2 signaling axis, indicating severe cellular stress and the initiation of cell cycle arrest or apoptosis.",
            "biological_consequence": [
              "Mutant ATXN3 impairs DNA repair protein function (e.g., PNKP) → DNA double-strand breaks accumulate → ATM kinase is autophosphorylated and activated at Ser1981 → Activated ATM phosphorylates CHK2 at Threonine 68 → Activated CHK2 phosphorylates downstream targets (e.g., p53) → Cell cycle arrest and/or apoptosis is initiated."
            ],
            "specific_effects": [
              "Expression of mutant ATXN3 (ATXN3-Q84) leads to increased phosphorylation of CHK2 at Threonine 68.",
              "The ATM-CHK2 signaling pathway is principally activated in response to double-strand breaks, which accumulate due to ATXN3-mediated repair defects."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "Expression of ATXN3-Q84 strongly activated the ATM pathway, inducing the phosphorylation of ATM and H2AX and ATM’s downstream substrates Chk2 and p53... By contrast, expression of wild-type ATXN3-Q28 did not activate the ATM pathway, suggesting that mutant ATXN3 strongly activates the DNA damage-response pathway and the polyQ sequence length is important for ATM pathway activation.",
                "pmid": "25590633"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "activates",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "CHK1",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "CHK1"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is indirect. ATXN3 does not directly bind to or regulate CHK2. Instead, in pathological conditions, mutant ATXN3 impairs the function of DNA repair proteins (like PNKP), leading to the accumulation of DNA double-strand breaks. This genomic instability triggers a broad DNA Damage Response (DDR) cascade, which involves the activation of the ATM kinase. Activated ATM then phosphorylates and activates CHK2 as a downstream effector of the pathway. Therefore, CHK2 activation is a consequence of the cellular stress induced by ATXN3 dysfunction, not a direct interaction.",
        "mechanism": "In pathological states, particularly with mutant ATXN3, the cell's capacity for DNA repair is compromised. For instance, mutant ATXN3 can inactivate essential DNA strand break repair enzymes like Polynucleotide Kinase 3'-Phosphatase (PNKP). This leads to an accumulation of DNA lesions, especially double-strand breaks, which are potent triggers of the DNA Damage Response (DDR). The primary sensor for these breaks is the ATM (Ataxia-Telangiectasia Mutated) kinase, which becomes activated and, in turn, phosphorylates a cascade of downstream targets, including the checkpoint kinase CHK2.",
        "effect": "The activation of CHK2 is an indirect, downstream consequence of the genomic instability caused by mutant ATXN3's interference with DNA repair machinery. Increased phosphorylation of CHK2 at Threonine 68 serves as a marker for the activation of the ATM-CHK2 signaling axis, indicating severe cellular stress and the initiation of cell cycle arrest or apoptosis.",
        "summary": "ATXN3 activates CHK2 to modulate dna damage response signaling (pathological), ultimately affecting cell cycle arrest and/or apoptosis is initiated.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "Expression of ATXN3-Q84 strongly activated the ATM pathway, inducing the phosphorylation of ATM and H2AX and ATM’s downstream substrates Chk2 and p53... By contrast, expression of wild-type ATXN3-Q28 did not activate the ATM pathway, suggesting that mutant ATXN3 strongly activates the DNA damage-response pathway and the polyQ sequence length is important for ATM pathway activation."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "CHK1 --activates--> CHK2:"
      },
      {
        "primary": "CSNK2A1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 was found to associate with the alpha subunit of protein casein kinase 2 (CSNK2A1/CK2), and CK2-dependent phosphorylation of ATXN3 controls its nuclear localization, stability, and aggregation.",
        "functions": [
          {
            "function": "ATXN3 Nuclear Localization and Stability",
            "arrow": "activates",
            "cellular_process": "The catalytic alpha subunit of Casein Kinase 2 (CSNK2A1) directly interacts with and phosphorylates ATXN3. This post-translational modification is a key determinant of ATXN3's subcellular distribution, promoting its translocation into the nucleus.",
            "effect_description": "CK2-mediated phosphorylation enhances the nuclear localization and stability of ATXN3. This is significant in the context of Spinocerebellar Ataxia Type 3 (SCA3), as the nuclear accumulation of polyQ-expanded mutant ATXN3 is a critical step in the formation of toxic nuclear inclusions, a hallmark of the disease. Pharmacological inhibition of CK2 reduces the nuclear levels of ATXN3 and mitigates the formation of these aggregates.",
            "biological_consequence": [
              "CSNK2A1 (CK2α) binds to ATXN3 → CSNK2A1 phosphorylates ATXN3 at specific serine residues (S340 and S352) → Phosphorylated ATXN3 shows enhanced nuclear import and increased protein stability → For mutant ATXN3, this leads to increased concentration in the nucleus → Promotes the formation of toxic nuclear inclusions/aggregates → Contributes to cellular cytotoxicity in SCA3."
            ],
            "specific_effects": [
              "ATXN3 directly associates with the catalytic alpha subunit of CK2 (CSNK2A1).",
              "Phosphorylation by CK2, particularly at serines 340 and 352, controls the nuclear localization, stability, and aggregation of ATXN3.",
              "Inhibition of CK2 with pharmacological agents leads to a decrease in the nuclear concentration of ATXN3 and a reduction in the formation of nuclear inclusions."
            ],
            "evidence": [
              {
                "paper_title": "CK2-dependent phosphorylation determines cellular localization and stability of ataxin-3",
                "journal": "Human Molecular Genetics",
                "year": 2009,
                "relevant_quote": "Here we show that protein casein kinase 2 (CK2)-dependent phosphorylation controls the nuclear localization, aggregation and stability of ataxin-3 (ATXN3), the disease protein in spinocerebellar ataxia type 3 (SCA3). Serine 340 and 352 within the third ubiquitin-interacting motif of ATXN3 were particularly important for nuclear localization of normal and expanded ATXN3... ATXN3 associated with CK2alpha and pharmacological inhibition of CK2 decreased nuclear ATXN3 levels and the formation of nuclear inclusions.",
                "pmid": "19542537"
              },
              {
                "paper_title": "Casein kinase 2 interacts with and phosphorylates ataxin-3",
                "journal": "Zhonghua Yi Xue Yi Chuan Xue Za Zhi",
                "year": 2008,
                "relevant_quote": "Results (1) Both wild type and expanded ataxin-3 interacted with CK2alpha and CK2beta in vitro... (3) CK2 phosphorylated wild type and expanded ataxin-3. Conclusion: Ataxin-3 is a substrate of protein kinase CK2.",
                "pmid": "18839019"
              }
            ],
            "pathway": {
              "name": "Protein Trafficking",
              "canonical_name": "Vesicle Transport",
              "ontology_id": "GO:0016192",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "19542537",
              "18839019"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The catalytic alpha subunit of Casein Kinase 2 (CSNK2A1) directly interacts with and phosphorylates ATXN3. This post-translational modification is a key determinant of ATXN3's subcellular distribution, promoting its translocation into the nucleus.",
        "effect": "CK2-mediated phosphorylation enhances the nuclear localization and stability of ATXN3. This is significant in the context of Spinocerebellar Ataxia Type 3 (SCA3), as the nuclear accumulation of polyQ-expanded mutant ATXN3 is a critical step in the formation of toxic nuclear inclusions, a hallmark of the disease. Pharmacological inhibition of CK2 reduces the nuclear levels of ATXN3 and mitigates the formation of these aggregates.",
        "summary": "ATXN3 activates CSNK2A1 to modulate regulation of atxn3 nuclear localization and stability, ultimately affecting contributes to cellular cytotoxicity in sca3.",
        "evidence": [
          {
            "paper_title": "CK2-dependent phosphorylation determines cellular localization and stability of ataxin-3",
            "journal": "Human Molecular Genetics",
            "year": 2009,
            "relevant_quote": "Here we show that protein casein kinase 2 (CK2)-dependent phosphorylation controls the nuclear localization, aggregation and stability of ataxin-3 (ATXN3), the disease protein in spinocerebellar ataxia type 3 (SCA3). Serine 340 and 352 within the third ubiquitin-interacting motif of ATXN3 were particularly important for nuclear localization of normal and expanded ATXN3... ATXN3 associated with CK2alpha and pharmacological inhibition of CK2 decreased nuclear ATXN3 levels and the formation of nuclear inclusions."
          },
          {
            "paper_title": "Casein kinase 2 interacts with and phosphorylates ataxin-3",
            "journal": "Zhonghua Yi Xue Yi Chuan Xue Za Zhi",
            "year": 2008,
            "relevant_quote": "Results (1) Both wild type and expanded ataxin-3 interacted with CK2alpha and CK2beta in vitro... (3) CK2 phosphorylated wild type and expanded ataxin-3. Conclusion: Ataxin-3 is a substrate of protein kinase CK2."
          }
        ],
        "pathways": [
          {
            "name": "Protein Trafficking",
            "canonical_name": "Vesicle Transport",
            "ontology_id": "GO:0016192",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- CSNK2A1:"
      }
    ]
  }
}