{
  "snapshot_json": {
    "main": "ATXN3",
    "interactors": [
      {
        "primary": "VCP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to VCP/p97, an interaction modulated by the polyglutamine tract. This interaction is crucial for ATXN3's role in the ERAD pathway.",
        "functions": [
          {
            "function": "ER-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly binds to the N-terminal domain of VCP/p97. This interaction positions ATXN3 to compete with the VCP cofactor UFD1 for VCP binding. The binding of ATXN3 to VCP is mutually exclusive with UFD1 binding, which reduces the association of the VCP/p97 complex with ubiquitinated ERAD substrates. This ultimately impairs the retrotranslocation (extraction) of misfolded proteins from the endoplasmic reticulum to the cytosol for proteasomal degradation.",
            "effect_description": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating the interaction between VCP and its cofactor UFD1, ATXN3 controls the rate of substrate extraction from the ER, and its overexpression leads to the accumulation of ERAD substrates.",
            "biological_consequence": [
              "ATXN3 binds to VCP/p97 → ATXN3 competitively displaces the UFD1 cofactor from VCP/p97 → The VCP-UFD1-NPL4 complex is disrupted → Reduced extraction of polyubiquitinated ERAD substrates from the ER → Accumulation of misfolded proteins within the ER → ER stress"
            ],
            "specific_effects": [
              "ATXN3 and Ufd1 bind to VCP in a mutually exclusive manner.",
              "ATXN3 binding to VCP decreases the interaction between VCP and ubiquitylated proteins.",
              "ATXN3 inhibits the VCP-dependent retrotranslocation of ERAD substrates from the ER.",
              "Pathological polyglutamine expansion in ATXN3 enhances its binding to VCP, leading to a more pronounced impairment of ERAD."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pathway": {
              "name": "ER-Associated Degradation",
              "canonical_name": "ER-Associated Degradation",
              "ontology_id": "GO:0036503",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "16822850"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "Autophagy Initiation",
            "arrow": "activates",
            "cellular_process": "The interaction between VCP/p97 and ATXN3 stimulates the deubiquitinase (DUB) activity of wild-type ATXN3. This enhanced DUB activity targets the essential autophagy protein BECN1 (Beclin-1). ATXN3 removes ubiquitin chains from BECN1, protecting it from proteasomal degradation and thereby increasing its stability. Stabilized BECN1 is a core component of the Class III phosphatidylinositol 3-kinase (PtdIns3K) complex, and its increased abundance promotes the assembly and activity of this complex, which is a critical step for autophagy initiation.",
            "effect_description": "The ATXN3-VCP interaction promotes the initiation of autophagy by enhancing the stability of BECN1. VCP acts as a direct activator of ATXN3's enzymatic function, which in turn leads to the stabilization of a key autophagy-initiating factor.",
            "biological_consequence": [
              "VCP/p97 binds to and activates ATXN3's deubiquitinase activity → Activated ATXN3 deubiquitinates BECN1 → BECN1 is stabilized and protected from proteasomal degradation → Increased levels of BECN1 promote the assembly and kinase activity of the PtdIns3K complex → Enhanced production of PtdIns3P on endomembranes → Recruitment of downstream autophagy effectors (e.g., WIPI2) → Autophagosome formation is initiated"
            ],
            "specific_effects": [
              "VCP/p97 directly stimulates the ubiquitin hydrolase activity of wild-type ATXN3.",
              "The VCP-ATXN3 interaction is required for the deubiquitination and stabilization of BECN1.",
              "Inhibition of VCP's ATPase activity leads to decreased BECN1 levels and impaired autophagy initiation.",
              "VCP's activation of ATXN3 is specific to the wild-type protein; it does not enhance the activity of polyQ-expanded ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
                "journal": "Autophagy",
                "year": 2021,
                "relevant_quote": "VCP stimulates the deubiquitinase activity of ATXN3 (ataxin 3) to stabilize BECN1 protein levels and also interacts with and promotes the assembly and kinase activity of the PtdIns3K complex.",
                "pmid": "33719912"
              },
              {
                "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
                "journal": "PLoS One",
                "year": 2012,
                "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3, In contrast, we observed no significant alterations in ataxin-3 enzyme kinetics or substrate preference in the presence of hHR23A alone or in combination with VCP.",
                "pmid": "22970133"
              }
            ],
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "33719912",
              "22970133"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds to the N-terminal domain of VCP/p97; The interaction between VCP/p97 and ATXN3 stimulates the deubiquitinase (DUB) activity of wild-type ",
        "effect": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating the interaction between VCP and its cofactor UFD1, ATXN3 controls the rate of substrate extraction from the ER, and its overexpression leads to the accumulation of ERAD substrates.; The ATXN3-VCP interaction promotes the initiation of autophagy by enhancing the stability of BECN1. VCP acts as a direct activator of ATXN3's enzymatic function, which in turn leads to the stabilization of a key autophagy-initiating factor.",
        "summary": "ATXN3 regulates VCP to regulate er-associated degradation (erad) and autophagy initiation, ultimately affecting er stress.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          },
          {
            "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
            "journal": "Autophagy",
            "year": 2021,
            "relevant_quote": "VCP stimulates the deubiquitinase activity of ATXN3 (ataxin 3) to stabilize BECN1 protein levels and also interacts with and promotes the assembly and kinase activity of the PtdIns3K complex."
          },
          {
            "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
            "journal": "PLoS One",
            "year": 2012,
            "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3, In contrast, we observed no significant alterations in ataxin-3 enzyme kinetics or substrate preference in the presence of hHR23A alone or in combination with VCP."
          }
        ],
        "pathways": [
          {
            "name": "ER-Associated Degradation",
            "canonical_name": "ER-Associated Degradation",
            "ontology_id": "GO:0036503",
            "ontology_source": "GO",
            "confidence": 0.8
          },
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> VCP:"
      },
      {
        "primary": "RAD23B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the DNA repair protein RAD23B, which is involved in proteasomal substrate delivery.",
        "functions": [
          {
            "function": "ATXN3 Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with the proteasome-associated shuttle protein RAD23B (human homolog HHR23B). This interaction is mediated by the Ubiquitin-Binding Site 2 (UbS2) within the Josephin domain of ATXN3. The binding of RAD23B to this site shields ATXN3 from the proteasome, thereby inhibiting its ubiquitination-independent degradation and increasing its protein stability.",
            "effect_description": "The interaction between ATXN3 and RAD23B serves as a mechanism to control the cellular levels of ATXN3. By binding to RAD23B, ATXN3 is stabilized and protected from proteasomal turnover. Disruption of this interaction leads to decreased ATXN3 protein levels.",
            "biological_consequence": [
              "ATXN3 binds to RAD23B via its UbS2 domain → The ATXN3-RAD23B complex is formed at the proteasome → RAD23B binding protects ATXN3 from being degraded by the proteasome → Cellular half-life and steady-state levels of ATXN3 protein are increased"
            ],
            "specific_effects": [
              "ATXN3 interacts with RAD23B through its N-terminal Ubiquitin-Binding Site 2 (UbS2).",
              "This interaction prevents the proteasomal degradation of ATXN3.",
              "Knockdown of Rad23 results in lower cellular levels of ATXN3 protein.",
              "Mutating the UbS2 site in ATXN3 disrupts the interaction and increases its proteasomal turnover."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2.",
                "pmid": "25144244"
              },
              {
                "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
                "journal": "Human Molecular Genetics",
                "year": 2000,
                "relevant_quote": "To explore the function of ataxin-3, we used the two-hybrid system to screen for the protein(s) that interacts with ataxin-3. We found that ataxin-3 interacts with two human homologs of the yeast DNA repair protein RAD23, HHR23A and HHR23B.",
                "pmid": "10915768"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25144244",
              "10915768"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' proteasomal substrate delivery via RAD23B is imprecise and potentially misleading. The more accurately defined mechanism is that the interaction between ATXN3 and RAD23B regulates the stability of ATXN3 itself. RAD23B binding to ATXN3's Ubiquitin-Binding Site 2 (UbS2) protects ATXN3 from proteasomal degradation. While this links ATXN3 to the proteasome machinery, the primary effect is stabilization of ATXN3, not a direct activation of general substrate delivery.",
        "mechanism": "ATXN3 directly interacts with the proteasome-associated shuttle protein RAD23B (human homolog HHR23B). This interaction is mediated by the Ubiquitin-Binding Site 2 (UbS2) within the Josephin domain of ATXN3. The binding of RAD23B to this site shields ATXN3 from the proteasome, thereby inhibiting its ubiquitination-independent degradation and increasing its protein stability.",
        "effect": "The interaction between ATXN3 and RAD23B serves as a mechanism to control the cellular levels of ATXN3. By binding to RAD23B, ATXN3 is stabilized and protected from proteasomal turnover. Disruption of this interaction leads to decreased ATXN3 protein levels.",
        "summary": "ATXN3 interacts with RAD23B to modulate regulation of atxn3 stability, ultimately affecting cellular half-life and steady-state levels of atxn3 protein are increased.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels in cultured mammalian cells and in Drosophila melanogaster by increasing its proteasomal turnover. Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2."
          },
          {
            "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
            "journal": "Human Molecular Genetics",
            "year": 2000,
            "relevant_quote": "To explore the function of ataxin-3, we used the two-hybrid system to screen for the protein(s) that interacts with ataxin-3. We found that ataxin-3 interacts with two human homologs of the yeast DNA repair protein RAD23, HHR23A and HHR23B."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- RAD23B:"
      },
      {
        "primary": "RAD23A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 has been shown to directly interact with RAD23A, a homolog of RAD23B involved in DNA repair and the ubiquitin-proteasome system.",
        "functions": [
          {
            "function": "Association with DNA Repair Pathways",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with RAD23A (human homolog HHR23A), a key protein in the Nucleotide Excision Repair (NER) pathway. The interaction occurs between ATXN3 and the N-terminal ubiquitin-like (UBL) domain of RAD23A. This physical association links ATXN3 to the cellular machinery responsible for recognizing and repairing certain types of DNA damage, suggesting a potential role for ATXN3 in the DNA damage response.",
            "effect_description": "The interaction with RAD23A functionally places ATXN3 in the context of DNA repair, specifically the NER pathway. While the precise consequence of this binding on NER efficiency is not fully defined, it suggests ATXN3 may participate in or influence the process. In pathological conditions, mutant ATXN3 can sequester RAD23A into nuclear inclusions, implying a disruption of normal function.",
            "biological_consequence": [
              "ATXN3 binds to the UBL domain of RAD23A → ATXN3 becomes associated with the NER protein complex → Potential modulation of DNA damage recognition or repair (Note: This is a hypothesized consequence based on the interaction)"
            ],
            "specific_effects": [
              "ATXN3 directly binds to the N-terminal ubiquitin-like (UBL) domain of HHR23A.",
              "The interaction does not depend on the polyglutamine tract length of ATXN3.",
              "Mutant, polyQ-expanded ATXN3 can recruit HHR23A into pathological intranuclear inclusions."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
                "journal": "Human Molecular Genetics",
                "year": 2000,
                "relevant_quote": "Furthermore, we confirmed that ataxin-3 interacts with the ubiquitin-like domain at the N-terminus of the HHR23 proteins, which is important for nucleotide excision repair; however, ataxin-3 does not interact with ubiquitin, implying that ataxin-3 might be functionally associated with the HHR23 proteins through this specific interaction.",
                "pmid": "10915768"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "10915768"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' Nucleotide Excision Repair (NER) is not strongly supported by primary literature. The evidence confirms a direct physical interaction between ATXN3 and the NER protein RAD23A, which suggests a functional association with the DNA damage response. However, a specific, multi-step mechanism demonstrating that ATXN3 directly activates or enhances the NER pathway has not been clearly elucidated. The interaction itself is the most verifiable claim.",
        "mechanism": "ATXN3 directly interacts with RAD23A (human homolog HHR23A), a key protein in the Nucleotide Excision Repair (NER) pathway. The interaction occurs between ATXN3 and the N-terminal ubiquitin-like (UBL) domain of RAD23A. This physical association links ATXN3 to the cellular machinery responsible for recognizing and repairing certain types of DNA damage, suggesting a potential role for ATXN3 in the DNA damage response.",
        "effect": "The interaction with RAD23A functionally places ATXN3 in the context of DNA repair, specifically the NER pathway. While the precise consequence of this binding on NER efficiency is not fully defined, it suggests ATXN3 may participate in or influence the process. In pathological conditions, mutant ATXN3 can sequester RAD23A into nuclear inclusions, implying a disruption of normal function.",
        "summary": "ATXN3 interacts with RAD23A to modulate association with dna repair pathways, ultimately affecting potential modulation of dna damage recognition or repair (note: this is a hypothesized consequence based on the interaction).",
        "evidence": [
          {
            "paper_title": "Ataxin-3, the MJD1 gene product, interacts with the two human homologs of yeast DNA repair protein RAD23, HHR23A and HHR23B",
            "journal": "Human Molecular Genetics",
            "year": 2000,
            "relevant_quote": "Furthermore, we confirmed that ataxin-3 interacts with the ubiquitin-like domain at the N-terminus of the HHR23 proteins, which is important for nucleotide excision repair; however, ataxin-3 does not interact with ubiquitin, implying that ataxin-3 might be functionally associated with the HHR23 proteins through this specific interaction."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> RAD23A:"
      },
      {
        "primary": "p53",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 stabilizes the tumor suppressor p53 by removing polyubiquitin chains, a function that is altered by the polyQ expansion.",
        "functions": [
          {
            "function": "TP53 Protein Stability and Apoptotic Function",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinating enzyme (DUB) for the tumor suppressor protein p53. By binding to polyubiquitinated p53, ATXN3 removes ubiquitin chains, thereby preventing its degradation via the ubiquitin-proteasome system.",
            "effect_description": "The stabilization of p53 by ATXN3 leads to an increase in its protein levels and subsequent enhancement of its transcriptional activity. This promotes p53-mediated downstream cellular processes, including apoptosis and cell cycle arrest.",
            "biological_consequence": [
              "ATXN3 binds to polyubiquitinated p53 → ATXN3 cleaves ubiquitin chains from p53 → p53 is shielded from proteasomal degradation → p53 protein levels accumulate in the nucleus → Increased transcriptional activation of p53 target genes (e.g., BAX, PUMA) → Induction of apoptosis and cell cycle arrest."
            ],
            "specific_effects": [
              "ATXN3 directly deubiquitinates and stabilizes p53 protein.",
              "Loss of ATXN3 function leads to reduced p53 protein levels and diminished p53 activity.",
              "The polyQ-expanded form of ATXN3 found in SCA3 exhibits an enhanced binding affinity and deubiquitination activity towards p53.",
              "Pathogenic polyQ-expanded ATXN3 leads to excessive stabilization of p53, contributing to increased p53-dependent neurodegeneration."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Biology",
                "year": 2016,
                "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis... Furthermore, the polyglutamine (polyQ)-expanded ATX-3 retains enhanced interaction and deubiquitination catalytic activity to p53 and causes more severe p53-dependent neurodegeneration...",
                "pmid": "27851749"
              }
            ],
            "pathway": {
              "name": "Apoptosis",
              "canonical_name": "Apoptosis",
              "ontology_id": "GO:0006915",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "27851749"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a deubiquitinating enzyme (DUB) for the tumor suppressor protein p53. By binding to polyubiquitinated p53, ATXN3 removes ubiquitin chains, thereby preventing its degradation via the ubiquitin-proteasome system.",
        "effect": "The stabilization of p53 by ATXN3 leads to an increase in its protein levels and subsequent enhancement of its transcriptional activity. This promotes p53-mediated downstream cellular processes, including apoptosis and cell cycle arrest.",
        "summary": "ATXN3 activates p53 to modulate tp53 protein stability and apoptotic function, ultimately affecting induction of apoptosis and cell cycle arrest.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Biology",
            "year": 2016,
            "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis... Furthermore, the polyglutamine (polyQ)-expanded ATX-3 retains enhanced interaction and deubiquitination catalytic activity to p53 and causes more severe p53-dependent neurodegeneration..."
          }
        ],
        "pathways": [
          {
            "name": "Apoptosis",
            "canonical_name": "Apoptosis",
            "ontology_id": "GO:0006915",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> p53:"
      },
      {
        "primary": "HDAC3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the histone deacetylase HDAC3 as part of its role in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Normal ATXN3 acts as a transcriptional corepressor by forming a complex with the corepressor NCoR and histone deacetylase 3 (HDAC3). ATXN3 functions as a scaffold, binding to specific chromatin regions and recruiting the HDAC3/NCoR complex.",
            "effect_description": "The recruitment of this complex to target gene promoters, such as the MMP-2 promoter, results in the deacetylation of local histones (H3 and H4). This increases chromatin condensation and leads to the repression of gene transcription.",
            "biological_consequence": [
              "ATXN3 binds to specific DNA sequences in a target gene promoter (e.g., MMP-2) → ATXN3 recruits the NCoR/HDAC3 corepressor complex → HDAC3 deacetylates histone tails at the promoter region → Local chromatin structure becomes more compact → Access of transcriptional machinery is blocked → Transcription of the target gene is silenced."
            ],
            "specific_effects": [
              "Normal ATXN3 binds to target promoters and recruits HDAC3 and NCoR to repress transcription.",
              "This transcriptional repression function requires intact ubiquitin-interacting motifs (UIMs) on ATXN3.",
              "ATXN3 controls the nuclear localization and recruitment of HDAC3 to chromatin.",
              "PolyQ-expanded ATXN3 loses the ability to form these repressive complexes on chromatin, leading to a loss of repressor function and aberrant gene activation."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter. Expanded AT3 lost the repressor function and displayed altered DNA/chromatin binding that was not associated with recruitment of HDAC3, NCoR, and deacetylation of the promoter, allowing aberrant MMP-2 transcription...",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The term 'activates' is contextually imprecise. ATXN3 does not activate the enzymatic function of HDAC3 itself, but rather recruits HDAC3 into a functional repressor complex at specific gene promoters, thereby enabling its repressive activity at those locations. The overall effect on target genes is inhibitory (transcriptional repression).",
        "mechanism": "Normal ATXN3 acts as a transcriptional corepressor by forming a complex with the corepressor NCoR and histone deacetylase 3 (HDAC3). ATXN3 functions as a scaffold, binding to specific chromatin regions and recruiting the HDAC3/NCoR complex.",
        "effect": "The recruitment of this complex to target gene promoters, such as the MMP-2 promoter, results in the deacetylation of local histones (H3 and H4). This increases chromatin condensation and leads to the repression of gene transcription.",
        "summary": "ATXN3 inhibits HDAC3 to modulate transcriptional repression, ultimately affecting transcription of the target gene is silenced.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter. Expanded AT3 lost the repressor function and displayed altered DNA/chromatin binding that was not associated with recruitment of HDAC3, NCoR, and deacetylation of the promoter, allowing aberrant MMP-2 transcription..."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HDAC3:"
      },
      {
        "primary": "HDAC6",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to HDAC6, an interaction involved in the cellular machinery that sorts protein aggregates.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3 facilitates the formation of aggresomes, which are perinuclear inclusion bodies for the sequestration and clearance of misfolded proteins. ATXN3's deubiquitinase activity is crucial for this process. It interacts with polyubiquitinated protein aggregates and cleaves ubiquitin chains to generate unanchored ubiquitin C-terminal tails. These exposed C-termini are specifically recognized and bound by the zinc finger ubiquitin-binding domain (ZnF-UBP) of HDAC6. HDAC6 then acts as an adaptor, linking the ubiquitinated cargo to the dynein motor complex for retrograde transport along microtubules to the microtubule-organizing center (MTOC), where the aggresome is formed.",
            "effect_description": "ATXN3 activates aggresome formation by editing ubiquitin chains on misfolded proteins, which creates a specific signal for their recognition by HDAC6 and subsequent transport by the dynein motor complex.",
            "biological_consequence": [
              "ATXN3 deubiquitinates polyubiquitinated misfolded proteins → Unanchored ubiquitin C-terminal diglycine motifs are exposed on the aggregate surface → The ZnF-UBP domain of HDAC6 specifically binds these exposed C-termini → HDAC6 recruits the dynein motor complex to the protein aggregate cargo → The entire complex undergoes retrograde transport along microtubules → Misfolded protein cargo accumulates at the MTOC, forming an aggresome."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with HDAC6 and the dynein motor complex.",
              "ATXN3's deubiquitinase activity generates unanchored ubiquitin C-termini on protein aggregates.",
              "HDAC6 specifically recognizes and binds to the unanchored C-terminal diglycine motif of ubiquitin generated by ATXN3.",
              "Knockdown of ATXN3 significantly reduces the formation of aggresomes.",
              "The interaction facilitates the sequestration of misfolded proteins, which is a cellular quality control and protective mechanism."
            ],
            "evidence": [
              {
                "paper_title": "Protein aggregates are recruited to aggresome by histone deacetylase 6 via unanchored ubiquitin C termini",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "The unanchored ubiquitin C termini in the aggregates are generated in situ by aggregate-associated deubiquitinase ataxin-3. These results provide structural and mechanistic bases for the role of HDAC6 in aggresome formation and further suggest a novel ubiquitin-mediated signaling pathway, where the exposure of ubiquitin C termini within protein aggregates enables HDAC6 recognition and transport to the aggresome.",
                "pmid": "22069321"
              },
              {
                "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRDeltaF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRDeltaF508, demonstrating a critical role of AT3 in this process.",
                "pmid": "15767577"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "22069321",
              "15767577"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 facilitates the formation of aggresomes, which are perinuclear inclusion bodies for the sequestration and clearance of misfolded proteins. ATXN3's deubiquitinase activity is crucial for this process. It interacts with polyubiquitinated protein aggregates and cleaves ubiquitin chains to generate unanchored ubiquitin C-terminal tails. These exposed C-termini are specifically recognized and bound by the zinc finger ubiquitin-binding domain (ZnF-UBP) of HDAC6. HDAC6 then acts as an adaptor, linking the ubiquitinated cargo to the dynein motor complex for retrograde transport along microtubules to the microtubule-organizing center (MTOC), where the aggresome is formed.",
        "effect": "ATXN3 activates aggresome formation by editing ubiquitin chains on misfolded proteins, which creates a specific signal for their recognition by HDAC6 and subsequent transport by the dynein motor complex.",
        "summary": "ATXN3 activates HDAC6 to modulate aggresome formation, ultimately affecting misfolded protein cargo accumulates at the mtoc, forming an aggresome.",
        "evidence": [
          {
            "paper_title": "Protein aggregates are recruited to aggresome by histone deacetylase 6 via unanchored ubiquitin C termini",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "The unanchored ubiquitin C termini in the aggregates are generated in situ by aggregate-associated deubiquitinase ataxin-3. These results provide structural and mechanistic bases for the role of HDAC6 in aggresome formation and further suggest a novel ubiquitin-mediated signaling pathway, where the exposure of ubiquitin C termini within protein aggregates enables HDAC6 recognition and transport to the aggresome."
          },
          {
            "paper_title": "The polyglutamine neurodegenerative protein Ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRDeltaF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRDeltaF508, demonstrating a critical role of AT3 in this process."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HDAC6:"
      },
      {
        "primary": "CBP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation studies show that ATXN3 interacts with the transcriptional co-activator CBP.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) CBP (also known as CREBBP). The C-terminal, polyglutamine-containing domain of ATXN3 is required for binding to CBP. This interaction inhibits the transcriptional coactivator function of CBP. One proposed mechanism is that the N-terminal Josephin domain of ATXN3 directly inhibits the histone acetyltransferase (HAT) activity of CBP/p300, thereby preventing the acetylation of histones at target gene promoters. This leads to a more condensed chromatin state and repression of gene expression.",
            "effect_description": "ATXN3 binds to the transcriptional co-activator CBP and inhibits its function, leading to the repression of genes that are normally activated by CBP-mediated histone acetylation.",
            "biological_consequence": [
              "The C-terminal domain of ATXN3 binds to the transcriptional co-activator CBP → The N-terminal Josephin domain of ATXN3 inhibits the HAT activity of CBP → Histone acetylation at target gene promoters is reduced → Chromatin becomes more condensed → Transcription of CBP-regulated genes is repressed."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with CBP, an interaction confirmed by co-immunoprecipitation of the endogenous proteins.",
              "The C-terminal domain of ATXN3 is required for binding to CBP.",
              "The N-terminal domain of ATXN3 inhibits histone acetylation by p300/CBP in vitro.",
              "ATXN3 represses the transcriptional activity of CBP in reporter assays."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators. Importantly, endogenous ataxin-3 is co-immunoprecipitated with each of these coactivators in non-transfected cells.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 acts as a transcriptional corepressor by directly interacting with the histone acetyltransferase (HAT) CBP (also known as CREBBP). The C-terminal, polyglutamine-containing domain of ATXN3 is required for binding to CBP. This interaction inhibits the transcriptional coactivator function of CBP. One proposed mechanism is that the N-terminal Josephin domain of ATXN3 directly inhibits the histone acetyltransferase (HAT) activity of CBP/p300, thereby preventing the acetylation of histones at target gene promoters. This leads to a more condensed chromatin state and repression of gene expression.",
        "effect": "ATXN3 binds to the transcriptional co-activator CBP and inhibits its function, leading to the repression of genes that are normally activated by CBP-mediated histone acetylation.",
        "summary": "ATXN3 inhibits CBP to modulate transcriptional repression, ultimately affecting transcription of cbp-regulated genes is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators. Importantly, endogenous ataxin-3 is co-immunoprecipitated with each of these coactivators in non-transfected cells."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CBP:"
      },
      {
        "primary": "EP300",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 cooperates with the transcriptional regulator p300 (EP300), a histone acetyltransferase.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a transcriptional corepressor through its direct interaction with the histone acetyltransferase (HAT) p300 (EP300). The binding is mediated by the C-terminal domain of ATXN3. This interaction leads to the inhibition of p300's co-activator function. The N-terminal Josephin domain of ATXN3 is responsible for inhibiting the HAT activity of p300, which prevents the acetylation of histones. This results in a chromatin state that is non-permissive for transcription, thereby repressing the expression of p300-target genes.",
            "effect_description": "By binding to the transcriptional co-activator p300, ATXN3 inhibits its histone acetyltransferase activity, which leads to the repression of gene transcription.",
            "biological_consequence": [
              "ATXN3's C-terminal domain binds to the transcriptional co-activator p300 → ATXN3's N-terminal Josephin domain inhibits the HAT activity of p300 → Reduced histone acetylation at target promoters → Chromatin condensation → Transcriptional repression of p300-regulated genes."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with p300, as shown by co-immunoprecipitation.",
              "The C-terminal domain of ATXN3 is necessary for the interaction with p300.",
              "The N-terminal domain of ATXN3 inhibits p300-mediated histone acetylation in vitro.",
              "ATXN3 represses p300-dependent transcriptional activation."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "The N-terminal domain of ataxin-3 inhibits histone acetylation by p300 in vitro and inhibits transcription in vivo. Histone binding and blocking access of coactivators to acetylation sites on histones appears to be the mechanism of inhibition. ... The C-terminal polyglutamine-containing domain of ataxin-3 inhibits coactivator-dependent transcription and is required for binding coactivators.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a transcriptional corepressor through its direct interaction with the histone acetyltransferase (HAT) p300 (EP300). The binding is mediated by the C-terminal domain of ATXN3. This interaction leads to the inhibition of p300's co-activator function. The N-terminal Josephin domain of ATXN3 is responsible for inhibiting the HAT activity of p300, which prevents the acetylation of histones. This results in a chromatin state that is non-permissive for transcription, thereby repressing the expression of p300-target genes.",
        "effect": "By binding to the transcriptional co-activator p300, ATXN3 inhibits its histone acetyltransferase activity, which leads to the repression of gene transcription.",
        "summary": "ATXN3 inhibits EP300 to modulate transcriptional repression, ultimately affecting transcriptional repression of p300-regulated genes.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "The N-terminal domain of ataxin-3 inhibits histone acetylation by p300 in vitro and inhibits transcription in vivo. Histone binding and blocking access of coactivators to acetylation sites on histones appears to be the mechanism of inhibition. ... The C-terminal polyglutamine-containing domain of ataxin-3 inhibits coactivator-dependent transcription and is required for binding coactivators."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> EP300:"
      },
      {
        "primary": "PML",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation experiments have demonstrated an interaction between ATXN3 and the promyelocytic leukemia protein (PML).",
        "functions": [
          {
            "function": "ATXN3 Deubiquitinase Activity",
            "arrow": "inhibits",
            "cellular_process": "The PML-II isoform of the promyelocytic leukemia protein specifically binds to ATXN3 and recruits it to PML nuclear bodies (NBs). These subnuclear structures are involved in various cellular processes including protein modification and degradation.",
            "effect_description": "Upon recruitment to the PML-NBs, the deubiquitinase (DUB) activity of ATXN3 is inhibited by the PML-II isoform. This interaction occurs with both wild-type and polyQ-expanded ATXN3. The sequestration and inhibition of ATXN3's enzymatic activity within these nuclear bodies serve as a regulatory mechanism for ATXN3's function.",
            "biological_consequence": [
              "PML-II specifically binds to the C-terminal region of ATXN3 → ATXN3 is recruited and co-localized with PML-II in PML nuclear bodies → The deubiquitinase activity of ATXN3 is inhibited → The ubiquitination status of ATXN3 substrates is altered, affecting protein turnover and signaling pathways."
            ],
            "specific_effects": [
              "PML-II recruits both normal (13Q) and pathological (79Q) forms of ATXN3 to nuclear bodies.",
              "The interaction with PML-II leads to the inhibition of ATXN3's deubiquitinase activity.",
              "Expression of mutant ATXN3 can alter the normal nuclear distribution of PML."
            ],
            "evidence": [
              {
                "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
                "journal": "Biochemical and Biophysical Research Communications",
                "year": 2021,
                "relevant_quote": "The interaction between ataxin-3 and PML-II was confirmed by co-immunoprecipition assays, and immunofluorescent microscopy revealed that PML-II and ataxin-3 were co-localized in PML-NBs. In addition, PML-II not only interacts with ataxin-3 with a normal range of poly-Q repeats (13Q), but also with a pathological form of ataxin-3 with extended poly-Q repeats (79Q). Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II.",
                "pmid": "33798946"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "33798946"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "_context": {
          "type": "direct",
          "query_protein": null,
          "chain": null
        },
        "arrow": "inhibits",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The PML-II isoform of the promyelocytic leukemia protein specifically binds to ATXN3 and recruits it to PML nuclear bodies (NBs). These subnuclear structures are involved in various cellular processes including protein modification and degradation.",
        "effect": "Upon recruitment to the PML-NBs, the deubiquitinase (DUB) activity of ATXN3 is inhibited by the PML-II isoform. This interaction occurs with both wild-type and polyQ-expanded ATXN3. The sequestration and inhibition of ATXN3's enzymatic activity within these nuclear bodies serve as a regulatory mechanism for ATXN3's function.",
        "summary": "ATXN3 inhibits PML to modulate atxn3 deubiquitinase activity, ultimately affecting the ubiquitination status of atxn3 substrates is altered, affecting protein turnover and signaling pathways.",
        "evidence": [
          {
            "paper_title": "PML-II recruits ataxin-3 to PML-NBs and inhibits its deubiquitinating activity",
            "journal": "Biochemical and Biophysical Research Communications",
            "year": 2021,
            "relevant_quote": "The interaction between ataxin-3 and PML-II was confirmed by co-immunoprecipition assays, and immunofluorescent microscopy revealed that PML-II and ataxin-3 were co-localized in PML-NBs. In addition, PML-II not only interacts with ataxin-3 with a normal range of poly-Q repeats (13Q), but also with a pathological form of ataxin-3 with extended poly-Q repeats (79Q). Importantly, the deubiquitinase activity of ataxin-3 was inhibited by PML-II."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--inhibits-- PML:"
      },
      {
        "primary": "PARK2",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the E3 ligase Parkin (PARK2) through its UIM domains, which inhibits Parkin's autoubiquitination and activity.",
        "functions": [
          {
            "function": "PARK2 Autoubiquitination",
            "arrow": "inhibits",
            "cellular_process": "ATXN3, a deubiquitinating enzyme, directly interacts with the E3 ubiquitin ligase Parkin (PARK2). This interaction serves to counteract Parkin's self-ubiquitination, a process essential for its E3 ligase activity.",
            "effect_description": "ATXN3 interferes with the ubiquitination of PARK2 by stabilizing the complex between PARK2 and its E2 ubiquitin-conjugating enzyme. This stabilization hinders the efficient charging of the E2 enzyme with ubiquitin and diverts the ubiquitin transfer away from PARK2 and towards ATXN3 itself. While both wild-type and polyQ-expanded ATXN3 can deubiquitinate PARK2, the polyQ-expanded form increases the turnover of PARK2, potentially contributing to Parkinson-like symptoms in Machado-Joseph disease.",
            "biological_consequence": [
              "ATXN3 binds to PARK2 → The complex between PARK2 and its E2 ubiquitin-conjugating enzyme is stabilized → The transfer of ubiquitin from the E2 enzyme to PARK2 is impeded → PARK2 autoubiquitination is reduced → PARK2 E3 ligase activity and stability are altered, modulating processes like mitophagy."
            ],
            "specific_effects": [
              "ATXN3 counteracts Parkin self-ubiquitination in vitro and in cells.",
              "ATXN3 interferes with the attachment of ubiquitin to Parkin during conjugation but does not hydrolyze pre-assembled Parkin-ubiquitin conjugates.",
              "PolyQ-expanded ATXN3 increases the turnover of PARK2."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub.",
                "pmid": "22081612"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "The FEBS Journal",
                "year": 2022,
                "relevant_quote": "Although both ATXN3-WT and ATXN3-PolyQ can deubiquitinate the E3 ligase Parkin, associated with PD, ATXN3-PolyQ increases the turnover of Parkin, which could possibly contribute to some of the Parkinson-like features in SCA3.",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "22081612",
              "39320846"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, a deubiquitinating enzyme, directly interacts with the E3 ubiquitin ligase Parkin (PARK2). This interaction serves to counteract Parkin's self-ubiquitination, a process essential for its E3 ligase activity.",
        "effect": "ATXN3 interferes with the ubiquitination of PARK2 by stabilizing the complex between PARK2 and its E2 ubiquitin-conjugating enzyme. This stabilization hinders the efficient charging of the E2 enzyme with ubiquitin and diverts the ubiquitin transfer away from PARK2 and towards ATXN3 itself. While both wild-type and polyQ-expanded ATXN3 can deubiquitinate PARK2, the polyQ-expanded form increases the turnover of PARK2, potentially contributing to Parkinson-like symptoms in Machado-Joseph disease.",
        "summary": "ATXN3 inhibits PARK2 to modulate park2 autoubiquitination, ultimately affecting park2 e3 ligase activity and stability are altered, modulating processes like mitophagy.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "The FEBS Journal",
            "year": 2022,
            "relevant_quote": "Although both ATXN3-WT and ATXN3-PolyQ can deubiquitinate the E3 ligase Parkin, associated with PD, ATXN3-PolyQ increases the turnover of Parkin, which could possibly contribute to some of the Parkinson-like features in SCA3."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> PARK2:"
      },
      {
        "primary": "STUB1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the E3 ligase CHIP (STUB1) to regulate the degradation of misfolded chaperone substrates.",
        "functions": [
          {
            "function": "STUB1/CHIP Stability",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 interacts with the E3 ubiquitin ligase CHIP (carboxy-terminus of Hsc70-interacting protein, also known as STUB1) to regulate protein quality control. This interaction is part of a coordinated cycle where CHIP's activity is modulated.",
            "effect_description": "The interaction between ATXN3 and STUB1/CHIP is stabilized by the monoubiquitination of CHIP. ATXN3 then acts to limit the length of ubiquitin chains attached to CHIP's substrates. In the context of Machado-Joseph disease, the polyglutamine-expanded form of ATXN3 binds to CHIP with a higher affinity. This enhanced binding leads to a decrease in the protein levels of CHIP, which can impair chaperone-mediated degradation pathways.",
            "biological_consequence": [
              "Monoubiquitination of STUB1/CHIP by the E2 enzyme Ube2w → Stabilized interaction between STUB1/CHIP and ATXN3 → ATXN3 limits ubiquitin chain extension on STUB1/CHIP substrates → PolyQ-expanded ATXN3 binds STUB1/CHIP with higher affinity → Decreased protein levels of STUB1/CHIP → Impaired degradation of misfolded chaperone-dependent substrates."
            ],
            "specific_effects": [
              "Monoubiquitination of CHIP stabilizes its interaction with ATXN3.",
              "ATXN3's deubiquitinase activity limits the length of ubiquitin chains on CHIP substrates.",
              "Polyglutamine-expanded ataxin-3 binds CHIP with higher affinity.",
              "The enhanced binding of polyQ-expanded ATXN3 to CHIP is associated with decreased levels of CHIP in a mouse model of SCA3."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "The EMBO Journal",
                "year": 2011,
                "relevant_quote": "Our results also provide new insight into SCA3 disease pathogenesis: polyglutamine-expanded ataxin-3 binds CHIP with higher affinity, and this change is associated with decreased levels of this neuroprotective E3 in a mouse model of SCA3.",
                "pmid": "21855799"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21855799"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with the E3 ubiquitin ligase CHIP (carboxy-terminus of Hsc70-interacting protein, also known as STUB1) to regulate protein quality control. This interaction is part of a coordinated cycle where CHIP's activity is modulated.",
        "effect": "The interaction between ATXN3 and STUB1/CHIP is stabilized by the monoubiquitination of CHIP. ATXN3 then acts to limit the length of ubiquitin chains attached to CHIP's substrates. In the context of Machado-Joseph disease, the polyglutamine-expanded form of ATXN3 binds to CHIP with a higher affinity. This enhanced binding leads to a decrease in the protein levels of CHIP, which can impair chaperone-mediated degradation pathways.",
        "summary": "ATXN3 inhibits STUB1 to modulate stub1/chip stability, ultimately affecting impaired degradation of misfolded chaperone-dependent substrates.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "The EMBO Journal",
            "year": 2011,
            "relevant_quote": "Our results also provide new insight into SCA3 disease pathogenesis: polyglutamine-expanded ataxin-3 binds CHIP with higher affinity, and this change is associated with decreased levels of this neuroprotective E3 in a mouse model of SCA3."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> STUB1:"
      },
      {
        "primary": "FOXO4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 plays a role in regulating the FOXO4-dependent antioxidant stress response, suggesting a direct regulatory interaction.",
        "functions": [
          {
            "function": "Antioxidant Gene Expression",
            "arrow": "activates",
            "cellular_process": "In response to oxidative stress, ATXN3 functions as a transcriptional coactivator for the transcription factor FOXO4. Both proteins translocate from the cytoplasm to the nucleus, where they form a complex that binds to the promoter of the manganese superoxide dismutase (SOD2) gene, thereby activating its transcription.",
            "effect_description": "The interaction enhances the transcription of SOD2, a crucial antioxidant enzyme responsible for detoxifying reactive oxygen species (ROS). This activation of the FOXO4-dependent antioxidant stress response helps protect cells from oxidative damage. Notably, this function is impaired by polyQ-expanded ATXN3, which has a reduced capacity to activate SOD2 expression and interferes with the binding of FOXO4 to the SOD2 promoter. The interaction does not involve the deubiquitinase activity of ATXN3, and ATXN3 does not modify the ubiquitination status of FOXO4.",
            "biological_consequence": [
              "Oxidative stress → ATXN3 and FOXO4 nuclear translocation → ATXN3-FOXO4 complex formation → Co-binding to the SOD2 gene promoter → Increased SOD2 mRNA transcription → Enhanced clearance of reactive oxygen species (ROS) → Increased cellular protection against oxidative stress"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with FOXO4 via its N-terminal Josephin domain.",
              "ATXN3 acts as a transcriptional coactivator, enhancing FOXO4's ability to activate SOD2 gene expression.",
              "Upon oxidative stress, ATXN3 and FOXO4 concomitantly bind to the same region of the SOD2 gene promoter.",
              "Mutant ATXN3 shows an impaired capability to activate FOXO4-dependent transcription and reduces the binding of FOXO4 to the SOD2 promoter.",
              "The deubiquitinating function of ATXN3 is not involved in this interaction; ubiquitination of FOXO4 is not modified by ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2. Compared with normal ATXN3, mutant ATXN3 has a reduced capability to activate the FOXO4-mediated SOD2 expression and interferes with binding of FOXO4 to the SOD2 gene promoter.",
                "pmid": "21536589"
              }
            ],
            "pathway": {
              "name": "Oxidative Stress Response",
              "canonical_name": "Oxidative Stress Response",
              "ontology_id": "GO:0006979",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21536589"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In response to oxidative stress, ATXN3 functions as a transcriptional coactivator for the transcription factor FOXO4. Both proteins translocate from the cytoplasm to the nucleus, where they form a complex that binds to the promoter of the manganese superoxide dismutase (SOD2) gene, thereby activating its transcription.",
        "effect": "The interaction enhances the transcription of SOD2, a crucial antioxidant enzyme responsible for detoxifying reactive oxygen species (ROS). This activation of the FOXO4-dependent antioxidant stress response helps protect cells from oxidative damage. Notably, this function is impaired by polyQ-expanded ATXN3, which has a reduced capacity to activate SOD2 expression and interferes with the binding of FOXO4 to the SOD2 promoter. The interaction does not involve the deubiquitinase activity of ATXN3, and ATXN3 does not modify the ubiquitination status of FOXO4.",
        "summary": "ATXN3 activates FOXO4 to modulate antioxidant gene expression, ultimately affecting increased cellular protection against oxidative stress.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2. Compared with normal ATXN3, mutant ATXN3 has a reduced capability to activate the FOXO4-mediated SOD2 expression and interferes with binding of FOXO4 to the SOD2 gene promoter."
          }
        ],
        "pathways": [
          {
            "name": "Oxidative Stress Response",
            "canonical_name": "Oxidative Stress Response",
            "ontology_id": "GO:0006979",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> FOXO4:"
      },
      {
        "primary": "PNKP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with and promotes the phosphatase activity of PNKP, a key enzyme in DNA repair.",
        "functions": [
          {
            "function": "DNA 3'-Phosphatase Activity",
            "arrow": "regulates",
            "cellular_process": "ATXN3 interacts with Polynucleotide Kinase 3'-Phosphatase (PNKP), a critical enzyme that processes damaged DNA ends during single- and double-strand break repair. The functional outcome of this interaction is dichotomous and depends on the polyglutamine tract length in ATXN3. Wild-type ATXN3 stimulates PNKP's 3'-phosphatase activity, promoting efficient DNA repair. Conversely, polyQ-expanded mutant ATXN3 binds to and inhibits this activity.",
            "effect_description": "By stimulating PNKP's enzymatic function, wild-type ATXN3 contributes to the maintenance of genomic integrity. In contrast, the inhibition of PNKP by mutant ATXN3 leads to the accumulation of unrepaired DNA strand breaks. This triggers a chronic DNA damage response (DDR) mediated by the ATM kinase, leading to downstream activation of pro-apoptotic pathways involving p53 and PKCδ, ultimately contributing to neuronal cell death in Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "DNA strand break → ATXN3 (WT) binds PNKP → Stimulation of PNKP 3'-phosphatase activity → Efficient processing of DNA 3'-phosphate termini → DNA repair and genomic stability → Neuronal survival",
              "DNA strand break → ATXN3 (Mutant) binds and inhibits PNKP → Accumulation of DNA strand breaks → Chronic activation of ATM kinase → Activation of p53 and c-Abl/PKCδ pathways → Pro-apoptotic gene expression → Neuronal dysfunction and apoptosis"
            ],
            "specific_effects": [
              "Wild-type ATXN3 directly interacts with and stimulates the 3'-phosphatase activity of PNKP.",
              "PolyQ-expanded mutant ATXN3 interacts with and inhibits the 3'-phosphatase activity of PNKP.",
              "Inhibition of PNKP by mutant ATXN3 leads to the persistent accumulation of DNA strand breaks.",
              "The accumulation of DNA damage due to PNKP inactivation causes chronic activation of the ATM signaling pathway.",
              "Overexpression of PNKP can rescue the cell death mediated by mutant ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "Collectively, these data, together with the data presented in the accompanying manuscript by Chatterjee et al, suggest that the wild-type ATXN3 interacts with and stimulates PNKP’s 3’-phosphatase activity, and this interaction possibly modulates the efficacy of DNA repair, and helps maintain genomic integrity and neuronal survival. In contrast, mutant ATXN3 interacts with PNKP and abrogates its 3’-phosphatase activity, resulting in increased accumulation of DNA damage that chronically activates ATM→p53 and ATM→c-Abl→PKCδ pro-apoptotic signaling to trigger neuronal dysfunction and apoptosis in SCA3 (illustrated in Fig. 8).",
                "pmid": "25590633"
              },
              {
                "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
                "journal": "eLife",
                "year": 2019,
                "relevant_quote": "We recently reported that the wild-type (wt) form of the deubiquitinating enzyme ataxin-3 (wtATXN3) enhances the activity of polynucleotide kinase-3'-phosphatase (PNKP)... In contrast, mutant ATXN3 (mATXN3) abrogates PNKP activity to induce DNA strand breaks and activate the DDR-ATM→p53 pathway, as observed in spinocerebellar ataxia 3 (SCA3).",
                "pmid": "30994454"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633",
              "30994454"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with Polynucleotide Kinase 3'-Phosphatase (PNKP), a critical enzyme that processes damaged DNA ends during single- and double-strand break repair. The functional outcome of this interaction is dichotomous and depends on the polyglutamine tract length in ATXN3. Wild-type ATXN3 stimulates PNKP's 3'-phosphatase activity, promoting efficient DNA repair. Conversely, polyQ-expanded mutant ATXN3 binds to and inhibits this activity.",
        "effect": "By stimulating PNKP's enzymatic function, wild-type ATXN3 contributes to the maintenance of genomic integrity. In contrast, the inhibition of PNKP by mutant ATXN3 leads to the accumulation of unrepaired DNA strand breaks. This triggers a chronic DNA damage response (DDR) mediated by the ATM kinase, leading to downstream activation of pro-apoptotic pathways involving p53 and PKCδ, ultimately contributing to neuronal cell death in Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "ATXN3 interacts with PNKP to modulate dna 3'-phosphatase activity, ultimately affecting neuronal survival.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "Collectively, these data, together with the data presented in the accompanying manuscript by Chatterjee et al, suggest that the wild-type ATXN3 interacts with and stimulates PNKP’s 3’-phosphatase activity, and this interaction possibly modulates the efficacy of DNA repair, and helps maintain genomic integrity and neuronal survival. In contrast, mutant ATXN3 interacts with PNKP and abrogates its 3’-phosphatase activity, resulting in increased accumulation of DNA damage that chronically activates ATM→p53 and ATM→c-Abl→PKCδ pro-apoptotic signaling to trigger neuronal dysfunction and apoptosis in SCA3 (illustrated in Fig. 8)."
          },
          {
            "paper_title": "Mutant huntingtin impairs PNKP and ATXN3, disrupting DNA repair and transcription",
            "journal": "eLife",
            "year": 2019,
            "relevant_quote": "We recently reported that the wild-type (wt) form of the deubiquitinating enzyme ataxin-3 (wtATXN3) enhances the activity of polynucleotide kinase-3'-phosphatase (PNKP)... In contrast, mutant ATXN3 (mATXN3) abrogates PNKP activity to induce DNA strand breaks and activate the DDR-ATM→p53 pathway, as observed in spinocerebellar ataxia 3 (SCA3)."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> PNKP:"
      },
      {
        "primary": "YAP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation and in vitro pulldown assays confirm a direct interaction between ATXN3 and YAP, with ATXN3 stabilizing YAP by deubiquitination.",
        "functions": [
          {
            "function": "YAP1 Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinase (DUB) for Yes-associated protein 1 (YAP1), the primary transcriptional co-activator of the Hippo signaling pathway. ATXN3 directly binds to YAP1 and removes K48-linked polyubiquitin chains, which are signals for proteasomal degradation.",
            "effect_description": "By cleaving these ubiquitin chains, ATXN3 protects YAP1 from degradation by the proteasome, thereby increasing its protein stability and half-life. Elevated levels of YAP1 lead to its enhanced nuclear activity and increased transcription of YAP/TEAD target genes, such as CTGF and CYR61, which are involved in promoting cell proliferation, invasion, and stem-like properties, particularly in cancer contexts like prostate cancer.",
            "biological_consequence": [
              "ATXN3 binds to YAP1 via Josephin-WW domain interaction → ATXN3 removes K48-linked polyubiquitin chains from YAP1 → Proteasomal degradation of YAP1 is prevented → YAP1 protein half-life and abundance increase → Enhanced nuclear translocation and transcriptional co-activator activity of YAP1 → Increased expression of target genes (e.g., CTGF, CYR61) → Promotion of cell proliferation and invasion"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with, deubiquitinates, and stabilizes the YAP1 protein.",
              "The interaction is mediated by the Josephin domain of ATXN3 binding to the WW domain of YAP1.",
              "ATXN3 specifically removes K48-linked polyubiquitin chains from YAP1, which is dependent on its catalytic DUB activity.",
              "Depletion of ATXN3 reduces YAP1 protein levels, decreases its stability, and downregulates the expression of its downstream target genes.",
              "The stabilization of YAP1 by ATXN3 promotes tumor growth, invasion, and stem-like properties in prostate cancer cells."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "journal": "Cell Communication and Signaling",
                "year": 2023,
                "relevant_quote": "In the present study, we identified ATXN3, a DUB enzyme in the ubiquitin-specific proteases family, as a bona fide deubiquitylase of YAP in PC. ATXN3 was shown to interact with, deubiquitylate, and stabilize YAP in a deubiquitylation activity-dependent manner... Further mechanistic study revealed that the Josephin domain of ATXN3 interacted with the WW domain of YAP. ATXN3 stabilized YAP protein via inhibiting K48-specific poly-ubiquitination process on YAP protein.",
                "pmid": "37349820"
              },
              {
                "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
                "journal": "American Journal of Cancer Research",
                "year": 2023,
                "relevant_quote": "At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation. Immunohistology analysis revealed a strong positive correlation between ATXN3 and YAP1 protein expression in human breast and pancreatic cancers. Collectively, our study defines ATXN3 as a previously unknown YAP1 deubiquitinase in tumorigenesis...",
                "pmid": "37818078"
              }
            ],
            "pathway": {
              "name": "Hippo Signaling Pathway",
              "canonical_name": "Hippo Signaling",
              "ontology_id": "hsa04390",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "37349820",
              "37818078"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 functions as a deubiquitinase (DUB) for Yes-associated protein 1 (YAP1), the primary transcriptional co-activator of the Hippo signaling pathway. ATXN3 directly binds to YAP1 and removes K48-linked polyubiquitin chains, which are signals for proteasomal degradation.",
        "effect": "By cleaving these ubiquitin chains, ATXN3 protects YAP1 from degradation by the proteasome, thereby increasing its protein stability and half-life. Elevated levels of YAP1 lead to its enhanced nuclear activity and increased transcription of YAP/TEAD target genes, such as CTGF and CYR61, which are involved in promoting cell proliferation, invasion, and stem-like properties, particularly in cancer contexts like prostate cancer.",
        "summary": "ATXN3 activates YAP1 to modulate yap1 protein stability, ultimately affecting promotion of cell proliferation and invasion.",
        "evidence": [
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "journal": "Cell Communication and Signaling",
            "year": 2023,
            "relevant_quote": "In the present study, we identified ATXN3, a DUB enzyme in the ubiquitin-specific proteases family, as a bona fide deubiquitylase of YAP in PC. ATXN3 was shown to interact with, deubiquitylate, and stabilize YAP in a deubiquitylation activity-dependent manner... Further mechanistic study revealed that the Josephin domain of ATXN3 interacted with the WW domain of YAP. ATXN3 stabilized YAP protein via inhibiting K48-specific poly-ubiquitination process on YAP protein."
          },
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth",
            "journal": "American Journal of Cancer Research",
            "year": 2023,
            "relevant_quote": "At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation. Immunohistology analysis revealed a strong positive correlation between ATXN3 and YAP1 protein expression in human breast and pancreatic cancers. Collectively, our study defines ATXN3 as a previously unknown YAP1 deubiquitinase in tumorigenesis..."
          }
        ],
        "pathways": [
          {
            "name": "Hippo Signaling Pathway",
            "canonical_name": "Hippo Signaling",
            "ontology_id": "hsa04390",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> YAP1:"
      },
      {
        "primary": "MAP1LC3C",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts specifically with LC3C, a key autophagy protein, during the early stages of the autophagic pathway.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with MAP1LC3C (LC3C), a member of the ATG8 family, during the early stages of autophagy.",
            "effect_description": "This transient regulatory interaction supports the progression of the autophagic pathway.",
            "biological_consequence": [
              "ATXN3-LC3C interaction → Facilitation of autophagosome formation → Clearance of cellular components"
            ],
            "specific_effects": [
              "The interaction occurs via two regions within the Josephin domain of ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 directly interacts with MAP1LC3C (LC3C), a member of the ATG8 family, during the early stages of autophagy.",
        "effect": "This transient regulatory interaction supports the progression of the autophagic pathway.",
        "summary": "ATXN3 activates MAP1LC3C to modulate autophagy, ultimately affecting clearance of cellular components.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> MAP1LC3C:"
      },
      {
        "primary": "GABARAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 has a transient regulatory interaction with GABARAP, a member of the LC3/GABARAP protein family, during autophagy.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3 engages in a transient regulatory interaction with GABARAP, an ATG8 family protein crucial for autophagosome maturation.",
            "effect_description": "This interaction, occurring in the early stages of the autophagic pathway, suggests a role for ATXN3 in modulating autophagosome dynamics.",
            "biological_consequence": [
              "ATXN3-GABARAP interaction → Regulation of autophagosome maturation → Cellular quality control"
            ],
            "specific_effects": [
              "The interaction supports the role of ATXN3 as a positive regulator of autophagy."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 engages in a transient regulatory interaction with GABARAP, an ATG8 family protein crucial for autophagosome maturation.",
        "effect": "This interaction, occurring in the early stages of the autophagic pathway, suggests a role for ATXN3 in modulating autophagosome dynamics.",
        "summary": "ATXN3 activates GABARAP to modulate autophagy, ultimately affecting cellular quality control.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> GABARAP:"
      },
      {
        "primary": "CHK1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and stabilizes Chk1 by antagonizing its polyubiquitination, which is important for DNA damage checkpoints.",
        "functions": [
          {
            "function": "CHK1 Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3 functions as a deubiquitinase for the checkpoint kinase CHK1. It directly interacts with CHK1 and removes polyubiquitin chains, thereby protecting it from proteasomal degradation mediated by E3 ligases like DDB1/CUL4A and FBXO6/CUL1.",
            "effect_description": "By stabilizing CHK1, ATXN3 maintains its steady-state levels, which is essential for proper DNA damage checkpoint signaling and subsequent DNA repair.",
            "biological_consequence": [
              "ATXN3 deubiquitinates CHK1 → Increased CHK1 protein half-life → Robust G2/M checkpoint activation upon DNA damage → Cell cycle arrest and DNA repair"
            ],
            "specific_effects": [
              "ATXN3 is essential for maintaining steady-state levels of CHK1.",
              "Loss of ATXN3 leads to reduced CHK1 levels and increased sensitivity to DNA damage.",
              "Under prolonged replication stress, CHK1 is phosphorylated and dissociates from ATXN3, allowing for its degradation and checkpoint termination."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
                "year": 2017,
                "pmid": "28180282"
              },
              {
                "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
                "year": 2022,
                "pmid": "38497605"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28180282",
              "38497605",
              "39320846"
            ]
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 functions as a deubiquitinase for the checkpoint kinase CHK1. It directly interacts with CHK1 and removes polyubiquitin chains, thereby protecting it from proteasomal degradation mediated by E3 ligases like DDB1/CUL4A and FBXO6/CUL1.",
        "effect": "By stabilizing CHK1, ATXN3 maintains its steady-state levels, which is essential for proper DNA damage checkpoint signaling and subsequent DNA repair.",
        "summary": "ATXN3 activates CHK1 to modulate chk1 protein stability, ultimately affecting cell cycle arrest and dna repair.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
            "year": 2017
          },
          {
            "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
            "year": 2022
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "arrow_notation": "ATXN3 --activates--> CHK1:"
      },
      {
        "primary": "MDC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "During the DNA damage response, ATXN3 stabilizes MDC1 on chromatin by counteracting RNF4-induced polyubiquitination.",
        "functions": [
          {
            "function": "DNA Double-Strand Break Response",
            "arrow": "activates",
            "cellular_process": "At sites of DNA double-strand breaks (DSBs), the SUMO-targeted ubiquitin ligase RNF4 ubiquitinates the checkpoint mediator protein MDC1, targeting it for removal from chromatin. ATXN3 is recruited to DSBs in a SUMOylation-dependent manner and directly counteracts RNF4 activity by deubiquitinating MDC1.",
            "effect_description": "By removing ubiquitin chains from MDC1, ATXN3 prevents its premature dissociation from damaged chromatin. This stabilization of MDC1 at the DSB site prolongs its chromatin residence time, which is crucial for the sustained recruitment of downstream DNA damage response (DDR) factors and efficient DNA repair.",
            "biological_consequence": [
              "ATXN3 is recruited to DSBs via a SUMO-dependent mechanism → ATXN3 deubiquitinates RNF4-modified MDC1 → MDC1 chromatin dwell time at DSBs is increased → Sustained recruitment and retention of downstream DDR factors (RNF8, RNF168, 53BP1, BRCA1) → Consolidation of DNA repair signaling and efficient repair by both NHEJ and HR pathways."
            ],
            "specific_effects": [
              "Directly counteracts RNF4-mediated ubiquitination of MDC1.",
              "Prolongs the chromatin dwell time of MDC1 at sites of DNA damage.",
              "Loss of ATXN3 impairs the recruitment of RNF8, RNF168, 53BP1, and BRCA1 to DSBs.",
              "Required for efficient MDC1-dependent DSB repair by non-homologous end-joining (NHEJ) and homologous recombination (HR)."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4.",
                "pmid": "28275011"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "At sites of DNA double-strand breaks (DSBs), the SUMO-targeted ubiquitin ligase RNF4 ubiquitinates the checkpoint mediator protein MDC1, targeting it for removal from chromatin. ATXN3 is recruited to DSBs in a SUMOylation-dependent manner and directly counteracts RNF4 activity by deubiquitinating MDC1.",
        "effect": "By removing ubiquitin chains from MDC1, ATXN3 prevents its premature dissociation from damaged chromatin. This stabilization of MDC1 at the DSB site prolongs its chromatin residence time, which is crucial for the sustained recruitment of downstream DNA damage response (DDR) factors and efficient DNA repair.",
        "summary": "ATXN3 activates MDC1 to modulate dna double-strand break response, ultimately affecting consolidation of dna repair signaling and efficient repair by both nhej and hr pathways.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> MDC1:"
      },
      {
        "primary": "RHEB",
        "interaction_type": "direct",
        "upstream_interactor": "TSC-TBC complex",
        "mediator_chain": [
          "TSC-TBC complex"
        ],
        "depth": 2,
        "support_summary": "ATXN3 acts as a negative regulator of mTORC1 signaling by deubiquitinating RHEB, which promotes RHEB's inactivation by the TSC-TBC complex.",
        "functions": [
          {
            "function": "mTORC1 Signaling",
            "arrow": "inhibits",
            "cellular_process": "Under amino acid-starved conditions, inactive Rag GTPases recruit ATXN3 to the lysosomal surface. There, ATXN3 acts as a deubiquitinase for the small GTPase RHEB, maintaining it in a hypo-ubiquitinated and inactive state. Upon amino acid stimulation, active Rags release ATXN3 from the lysosome, allowing RHEB to become polyubiquitinated. Polyubiquitination enhances RHEB's binding affinity for mTORC1, leading to robust pathway activation.",
            "effect_description": "By deubiquitinating RHEB on the lysosome, ATXN3 functions as a negative regulator of mTORC1 signaling. Its activity directly suppresses the interaction between RHEB and mTORC1, thereby inhibiting cell growth and protein synthesis in the absence of sufficient amino acids.",
            "biological_consequence": [
              "Amino acid starvation → Inactive Rag GTPases recruit ATXN3 to the lysosome → ATXN3 deubiquitinates lysosomal RHEB → RHEB is maintained in a hypo-ubiquitinated state → RHEB-mTORC1 interaction is prevented → mTORC1 kinase activity is inhibited → Downregulation of protein synthesis and cell growth."
            ],
            "specific_effects": [
              "Acts as a deubiquitinase for RHEB.",
              "Localizes to the lysosome in an amino acid- and Rag GTPase-dependent manner.",
              "Deubiquitination of RHEB by ATXN3 prevents mTORC1 activation.",
              "Ablation of ATXN3 leads to accumulation of polyubiquitinated RHEB and enhanced mTORC1 activation."
            ],
            "evidence": [
              {
                "paper_title": "Amino acids enhance polyubiquitination of Rheb and its binding to mTORC1 by blocking lysosomal ATXN3 deubiquitinase activity",
                "journal": "Molecular Cell",
                "year": 2020,
                "relevant_quote": "We report that amino acids enhance the polyubiquitination of Rheb (Ub-Rheb), which shows a strong binding preference for mTORC1 and supports its activation... Mechanistically, we identified ATXN3 as a Ub-Rheb deubiquitinase whose lysosomal localization is blocked by the active Rags in response to amino acid stimulation.",
                "pmid": "33157014"
              }
            ],
            "pathway": {
              "name": "mTOR Signaling",
              "canonical_name": "mTOR Signaling",
              "ontology_id": "hsa04150",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "33157014"
            ],
            "direct_arrow": "not_applicable",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim contains a 'Mechanistic Opposite' error. The input suggests ATXN3-mediated deubiquitination of RHEB promotes its inactivation, thus inhibiting mTORC1. The reality is the opposite: polyubiquitination of RHEB is a positive signal for mTORC1 activation. ATXN3 deubiquitinates RHEB under amino acid starvation to keep mTORC1 OFF. When amino acids are present, ATXN3 is removed from the lysosome, allowing RHEB to be polyubiquitinated, which promotes its binding to and activation of mTORC1. Therefore, ATXN3's activity on RHEB is a negative regulator of mTORC1, but the mechanism described in the input was incorrect.",
        "mechanism": "Under amino acid-starved conditions, inactive Rag GTPases recruit ATXN3 to the lysosomal surface. There, ATXN3 acts as a deubiquitinase for the small GTPase RHEB, maintaining it in a hypo-ubiquitinated and inactive state. Upon amino acid stimulation, active Rags release ATXN3 from the lysosome, allowing RHEB to become polyubiquitinated. Polyubiquitination enhances RHEB's binding affinity for mTORC1, leading to robust pathway activation.",
        "effect": "By deubiquitinating RHEB on the lysosome, ATXN3 functions as a negative regulator of mTORC1 signaling. Its activity directly suppresses the interaction between RHEB and mTORC1, thereby inhibiting cell growth and protein synthesis in the absence of sufficient amino acids.",
        "summary": "ATXN3 inhibits RHEB to modulate mtorc1 signaling regulation, ultimately affecting downregulation of protein synthesis and cell growth.",
        "evidence": [
          {
            "paper_title": "Amino acids enhance polyubiquitination of Rheb and its binding to mTORC1 by blocking lysosomal ATXN3 deubiquitinase activity",
            "journal": "Molecular Cell",
            "year": 2020,
            "relevant_quote": "We report that amino acids enhance the polyubiquitination of Rheb (Ub-Rheb), which shows a strong binding preference for mTORC1 and supports its activation... Mechanistically, we identified ATXN3 as a Ub-Rheb deubiquitinase whose lysosomal localization is blocked by the active Rags in response to amino acid stimulation."
          }
        ],
        "pathways": [
          {
            "name": "mTOR Signaling",
            "canonical_name": "mTOR Signaling",
            "ontology_id": "hsa04150",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> RHEB:"
      },
      {
        "primary": "PCAF",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the histone acetyltransferase PCAF (P300/CBP-associated factor) as part of its role in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "ATXN3 is involved in transcriptional regulation through its interaction with histone acetyltransferases (HATs) and histone deacetylases (HDACs). ATXN3 directly interacts with the HAT PCAF (P300/CBP-associated factor), as well as the related coactivators p300 and CBP.",
            "effect_description": "Through its interaction with PCAF, ATXN3 represses the transcriptional co-activator function of PCAF. This leads to a reduction in histone acetylation at specific gene promoters, contributing to a more condensed chromatin state and transcriptional repression of target genes.",
            "biological_consequence": [
              "ATXN3 C-terminal domain binds to PCAF → The transcriptional co-activator and histone acetyltransferase activity of PCAF is repressed → Reduced histone acetylation at target gene promoters → Chromatin becomes less accessible to transcription machinery → Transcriptional repression."
            ],
            "specific_effects": [
              "The C-terminal domain of ATXN3 binds to PCAF, p300, and CBP.",
              "Represses the transcriptional activity of PCAF.",
              "Contributes to the regulation of histone acetylation levels."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity (Ref. 106).",
                "pmid": "39320846"
              },
              {
                "paper_title": "Ataxin-3 Represses Transcription via Chromatin Binding, Interaction with Histone Deacetylase 3, and Histone Deacetylation",
                "journal": "Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Another line of evidence suggests that AT3 acts as a transcriptional repressor via inhibition of histone acetyltransferase (HAT) activity of the major transcriptional coactivators, cAMP response element-binding protein (CREB) binding protein (CBP), p300, and p300/CBP-associated factor (PCAF) (Li et al., 2002).",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "39320846",
              "17079677"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 is involved in transcriptional regulation through its interaction with histone acetyltransferases (HATs) and histone deacetylases (HDACs). ATXN3 directly interacts with the HAT PCAF (P300/CBP-associated factor), as well as the related coactivators p300 and CBP.",
        "effect": "Through its interaction with PCAF, ATXN3 represses the transcriptional co-activator function of PCAF. This leads to a reduction in histone acetylation at specific gene promoters, contributing to a more condensed chromatin state and transcriptional repression of target genes.",
        "summary": "ATXN3 inhibits PCAF to modulate transcriptional repression, ultimately affecting transcriptional repression.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity (Ref. 106)."
          },
          {
            "paper_title": "Ataxin-3 Represses Transcription via Chromatin Binding, Interaction with Histone Deacetylase 3, and Histone Deacetylation",
            "journal": "Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Another line of evidence suggests that AT3 acts as a transcriptional repressor via inhibition of histone acetyltransferase (HAT) activity of the major transcriptional coactivators, cAMP response element-binding protein (CREB) binding protein (CBP), p300, and p300/CBP-associated factor (PCAF) (Li et al., 2002)."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> PCAF:"
      },
      {
        "primary": "NCoR1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 cooperates with the nuclear receptor co-repressor 1 (NCoR1) to regulate transcription.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Normal ATXN3 functions as a transcriptional co-repressor by forming a complex with the Nuclear Receptor Corepressor 1 (NCoR1) and Histone Deacetylase 3 (HDAC3). ATXN3 binds to specific gene promoters, such as that of the MMP-2 gene, and facilitates the recruitment of the NCoR1/HDAC3 complex.",
            "effect_description": "By recruiting this corepressor complex, ATXN3 promotes the deacetylation of histones at target gene promoters. This enzymatic activity leads to a more condensed chromatin structure, which represses gene transcription. Loss of ATXN3 function results in hyperacetylation at these promoters and aberrant gene expression. The polyQ-expanded form of ATXN3, while still able to interact with the complex, fails to properly recruit it to chromatin and results in reduced histone deacetylase activity, thereby losing its repressive function.",
            "biological_consequence": [
              "ATXN3 binds to target gene promoters → ATXN3 recruits the NCoR1/HDAC3 corepressor complex → HDAC3 deacetylates local histone tails → Chromatin structure becomes condensed → Transcription of the target gene is silenced."
            ],
            "specific_effects": [
              "Directly interacts with both NCoR1 and HDAC3.",
              "Promotes the nuclear localization and chromatin recruitment of HDAC3.",
              "Normal ATXN3-containing complexes exhibit increased histone deacetylase (HDAC) activity.",
              "Loss of ATXN3 leads to decreased levels of NCoR1 and HDAC3 at target promoters, resulting in histone hyperacetylation and increased transcription.",
              "PolyQ-expanded ATXN3 fails to recruit the complex to chromatin, leading to a loss of repressive function."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              },
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS One",
                "year": 2018,
                "relevant_quote": "We further show that, in the absence of ATXN3, Efna3 upregulation is associated with hyperacetylation of histones H3 and H4 at the Efna3 promoter, which in turn is induced by decreased levels of HDAC3 and NCoR in ATXN3 null cells.",
                "pmid": "30231063"
              },
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3.",
                "pmid": "36971114"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677",
              "30231063",
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Normal ATXN3 functions as a transcriptional co-repressor by forming a complex with the Nuclear Receptor Corepressor 1 (NCoR1) and Histone Deacetylase 3 (HDAC3). ATXN3 binds to specific gene promoters, such as that of the MMP-2 gene, and facilitates the recruitment of the NCoR1/HDAC3 complex.",
        "effect": "By recruiting this corepressor complex, ATXN3 promotes the deacetylation of histones at target gene promoters. This enzymatic activity leads to a more condensed chromatin structure, which represses gene transcription. Loss of ATXN3 function results in hyperacetylation at these promoters and aberrant gene expression. The polyQ-expanded form of ATXN3, while still able to interact with the complex, fails to properly recruit it to chromatin and results in reduced histone deacetylase activity, thereby losing its repressive function.",
        "summary": "ATXN3 inhibits NCoR1 to modulate transcriptional repression, ultimately affecting transcription of the target gene is silenced.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS One",
            "year": 2018,
            "relevant_quote": "We further show that, in the absence of ATXN3, Efna3 upregulation is associated with hyperacetylation of histones H3 and H4 at the Efna3 promoter, which in turn is induced by decreased levels of HDAC3 and NCoR in ATXN3 null cells."
          },
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> NCoR1:"
      },
      {
        "primary": "TAF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is known to interact with TATA box-binding protein (TBP)-associated factor 4 (TAF4), implicating it in the basal transcription machinery.",
        "functions": [
          {
            "function": "Basal Transcription",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 has been reported to interact with TAF4, a subunit of the general transcription factor TFIID. TFIID is a core component of the RNA polymerase II preinitiation complex, responsible for recognizing the core promoter and initiating transcription.",
            "effect_description": "The precise functional outcome of the ATXN3-TAF4 interaction is not well-defined in primary literature. It is hypothesized that by binding to a core component of TFIID, ATXN3 may be positioned to influence the assembly or activity of the basal transcription machinery, but specific effects on transcription initiation rates or promoter selectivity have not been detailed.",
            "biological_consequence": [
              "ATXN3 binds to TAF4 → Consequence on TFIID assembly or function is currently undefined."
            ],
            "specific_effects": [
              "The interaction between ATXN3 and TAF4 is documented in literature reviews, linking ATXN3 to the general transcription machinery."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
                "journal": "Molecular Therapy",
                "year": 2016,
                "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)...",
                "pmid": "24293103"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130...",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "24293103",
              "39320846"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "While the interaction between ATXN3 and TAF4 (also known as TAFII130) is cited in review literature, a primary source detailing the specific molecular mechanism and the direct functional consequence on TFIID activity was not found. The claim that this interaction modulates basal transcription is an inference based on TAF4's known role within the TFIID complex, rather than a demonstrated outcome of the ATXN3-TAF4 interaction itself.",
        "mechanism": "ATXN3 has been reported to interact with TAF4, a subunit of the general transcription factor TFIID. TFIID is a core component of the RNA polymerase II preinitiation complex, responsible for recognizing the core promoter and initiating transcription.",
        "effect": "The precise functional outcome of the ATXN3-TAF4 interaction is not well-defined in primary literature. It is hypothesized that by binding to a core component of TFIID, ATXN3 may be positioned to influence the assembly or activity of the basal transcription machinery, but specific effects on transcription initiation rates or promoter selectivity have not been detailed.",
        "summary": "ATXN3 interacts with TAF4 to modulate basal transcription, ultimately affecting consequence on tfiid assembly or function is currently undefined.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
            "journal": "Molecular Therapy",
            "year": 2016,
            "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)..."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "Indeed, ATXN3 additionally has been shown to interact with several transcriptional components, such as the TATA-binding protein-associated factor TAFII130..."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TAF4:"
      },
      {
        "primary": "TBP",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the TATA-box-binding protein (TBP), a key component of the transcriptional machinery.",
        "functions": [
          {
            "function": "Basal Transcription",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 is reported to interact with the TATA-box-binding protein (TBP), a central component of the TFIID complex that nucleates the formation of the transcriptional preinitiation complex at the promoter.",
            "effect_description": "The specific molecular outcome of the ATXN3-TBP interaction remains to be elucidated. In other polyglutamine diseases, sequestration of TBP by the mutant protein is a known pathogenic mechanism. While an interaction is noted for ATXN3, it is not clearly defined whether ATXN3 modulates TBP's DNA binding, its incorporation into TFIID, or its recruitment to promoters.",
            "biological_consequence": [
              "ATXN3 binds to TBP → Specific functional consequence on transcriptional initiation is currently undefined."
            ],
            "specific_effects": [
              "Interaction with TBP links ATXN3 to the core of the transcriptional machinery.",
              "In the context of polyglutamine disorders, interactions with TBP are often implicated in transcriptional dysregulation, though the specific mechanism for ATXN3 is not detailed."
            ],
            "evidence": [
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS One",
                "year": 2018,
                "relevant_quote": "ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes.",
                "pmid": "30231063"
              },
              {
                "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
                "journal": "Molecular Therapy",
                "year": 2016,
                "relevant_quote": "The nuclear environment has been suggested to promote the formation of nuclear aggregates, and additional proteins, such as TBP and CBP, were found to be recruited to the aggregates in human brain and SCA3 animal models.",
                "pmid": "24293103"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "30231063",
              "24293103"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction between ATXN3 and the TATA-box-binding protein (TBP) is cited in the context of transcriptional regulation and polyglutamine disease pathology. However, primary literature detailing the direct, functional consequences of this specific interaction on preinitiation complex assembly or basal transcription rates is lacking. The input's description is an inference based on TBP's function, not a demonstrated mechanism for the ATXN3-TBP interaction.",
        "mechanism": "ATXN3 is reported to interact with the TATA-box-binding protein (TBP), a central component of the TFIID complex that nucleates the formation of the transcriptional preinitiation complex at the promoter.",
        "effect": "The specific molecular outcome of the ATXN3-TBP interaction remains to be elucidated. In other polyglutamine diseases, sequestration of TBP by the mutant protein is a known pathogenic mechanism. While an interaction is noted for ATXN3, it is not clearly defined whether ATXN3 modulates TBP's DNA binding, its incorporation into TFIID, or its recruitment to promoters.",
        "summary": "ATXN3 interacts with TBP to modulate basal transcription, ultimately affecting specific functional consequence on transcriptional initiation is currently undefined.",
        "evidence": [
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS One",
            "year": 2018,
            "relevant_quote": "ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes."
          },
          {
            "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
            "journal": "Molecular Therapy",
            "year": 2016,
            "relevant_quote": "The nuclear environment has been suggested to promote the formation of nuclear aggregates, and additional proteins, such as TBP and CBP, were found to be recruited to the aggregates in human brain and SCA3 animal models."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> TBP:"
      },
      {
        "primary": "HSPA8",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3's ubiquitin-interacting motifs (UIMs) interact with Hsc70 (HSPA8). This interaction unexpectedly enhances the aggregation and toxicity of polyQ-expanded ATXN3.",
        "functions": [
          {
            "function": "Mutant ATXN3 Aggregation and Toxicity",
            "arrow": "activates",
            "cellular_process": "The heat shock cognate protein Hsc70-4 (Drosophila ortholog of human HSPA8) directly interacts with the ubiquitin-interacting motifs (UIMs) adjacent to the polyglutamine (polyQ) tract of mutant ATXN3.",
            "effect_description": "This interaction, contrary to the expected protective role of a chaperone, exacerbates the aggregation of polyQ-expanded ATXN3 and enhances its cellular toxicity. This suggests that HSPA8 is a pathogenic enhancer in the context of Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "HSPA8 binds to the UIMs of polyQ-expanded ATXN3 → Facilitates intermolecular interactions between mutant ATXN3 proteins → Enhances the formation of protein aggregates → Increases cellular toxicity and neurodegeneration"
            ],
            "specific_effects": [
              "The interaction is dependent on the UIMs of ATXN3; mutating the UIMs reduces the toxic effects.",
              "Reduction of Hsc70-4 (HSPA8 ortholog) levels diminishes the toxicity of pathogenic ATXN3 in a UIM-dependent manner.",
              "Hsc70-4 knockdown leads to reduced formation of SDS-resistant ATXN3 species and fewer aggregates in filter-trap assays.",
              "This pathogenic enhancement represents a pleiotropic effect of HSP70 chaperones, which are generally thought to suppress polyglutamine degeneration."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-interacting motifs of ataxin-3 regulate its polyglutamine toxicity through Hsc70-4-dependent aggregation",
                "journal": "eLife",
                "year": 2020,
                "relevant_quote": "We found that ataxin-3 pathogenicity is saliently controlled by polyglutamine-adjacent ubiquitin-interacting motifs (UIMs) that enhance aggregation and toxicity. UIMs function by interacting with the heat shock protein, Hsc70-4, whose reduction diminishes ataxin-3 toxicity in a UIM-dependent manner.",
                "pmid": "32955441"
              }
            ],
            "pathway": {
              "name": "Chaperone-Mediated Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "32955441"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The provided input correctly identifies a dual, context-dependent role for HSPA8 (Hsc70) in modulating ATXN3 aggregation. However, the mechanism is more nuanced. HSPA8's interaction with the UIMs of polyQ-expanded ATXN3 paradoxically enhances aggregation and toxicity, contrary to its canonical chaperone function of preventing misfolding. This represents a pathogenic gain-of-function interaction rather than a simple activation.",
        "mechanism": "The heat shock cognate protein Hsc70-4 (Drosophila ortholog of human HSPA8) directly interacts with the ubiquitin-interacting motifs (UIMs) adjacent to the polyglutamine (polyQ) tract of mutant ATXN3.",
        "effect": "This interaction, contrary to the expected protective role of a chaperone, exacerbates the aggregation of polyQ-expanded ATXN3 and enhances its cellular toxicity. This suggests that HSPA8 is a pathogenic enhancer in the context of Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "ATXN3 activates HSPA8 to modulate mutant atxn3 aggregation and toxicity, ultimately affecting increases cellular toxicity and neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-interacting motifs of ataxin-3 regulate its polyglutamine toxicity through Hsc70-4-dependent aggregation",
            "journal": "eLife",
            "year": 2020,
            "relevant_quote": "We found that ataxin-3 pathogenicity is saliently controlled by polyglutamine-adjacent ubiquitin-interacting motifs (UIMs) that enhance aggregation and toxicity. UIMs function by interacting with the heat shock protein, Hsc70-4, whose reduction diminishes ataxin-3 toxicity in a UIM-dependent manner."
          }
        ],
        "pathways": [
          {
            "name": "Chaperone-Mediated Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- HSPA8:"
      },
      {
        "primary": "SQSTM1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with p62/SQSTM1, an autophagic receptor protein involved in aggresome formation and clearance of protein aggregates.",
        "functions": [
          {
            "function": "Aggresome Formation of Pathogenic ATXN3",
            "arrow": "activates",
            "cellular_process": "SQSTM1/p62, a selective autophagy receptor, directly interacts with polyglutamine (polyQ)-expanded pathogenic ATXN3, but not the normal form. This interaction is a critical step in the cellular response to misfolded protein stress.",
            "effect_description": "This interaction facilitates the recruitment of pathogenic ATXN3 aggregates to the microtubule-organizing center (MTOC) to form a large inclusion body known as an aggresome. This sequestration process is a protective mechanism to manage and attempt to clear toxic protein aggregates.",
            "biological_consequence": [
              "PolyQ-expanded ATXN3 forms aggregates → SQSTM1/p62 recognizes and binds to pathogenic ATXN3 → The ATXN3-SQSTM1 complex is transported along microtubules → Sequestration into a perinuclear aggresome → Reduced cytotoxicity of diffuse aggregates"
            ],
            "specific_effects": [
              "p62 physically interacts with pathogenic ataxin-3 (ATXN3-Q80), but not normal ataxin-3 (ATXN3-Q20).",
              "p62 regulates the aggresome formation of polyQ-expanded ataxin-3 in a microtubule-dependent manner.",
              "The interaction with p62 and subsequent aggresome formation protects cells against polyQ-expanded ataxin-3-induced cell death."
            ],
            "evidence": [
              {
                "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
                "journal": "International Journal of Molecular Sciences",
                "year": 2014,
                "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death.",
                "pmid": "25158237"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "25158237"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input is generally correct. The interaction between ATXN3 and SQSTM1/p62 is a key step in recognizing and processing protein aggregates. However, the interaction is more specific to the pathogenic, polyQ-expanded form of ATXN3 and is crucial for sequestering these aggregates into aggresomes for eventual clearance, thereby playing a protective role against cytotoxicity.",
        "mechanism": "SQSTM1/p62, a selective autophagy receptor, directly interacts with polyglutamine (polyQ)-expanded pathogenic ATXN3, but not the normal form. This interaction is a critical step in the cellular response to misfolded protein stress.",
        "effect": "This interaction facilitates the recruitment of pathogenic ATXN3 aggregates to the microtubule-organizing center (MTOC) to form a large inclusion body known as an aggresome. This sequestration process is a protective mechanism to manage and attempt to clear toxic protein aggregates.",
        "summary": "ATXN3 activates SQSTM1 to modulate aggresome formation of pathogenic atxn3, ultimately affecting reduced cytotoxicity of diffuse aggregates.",
        "evidence": [
          {
            "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
            "journal": "International Journal of Molecular Sciences",
            "year": 2014,
            "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- SQSTM1:"
      },
      {
        "primary": "TUBB",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic and biochemical analyses have demonstrated a direct and tight interaction between ATXN3 and tubulin, a core component of microtubules.",
        "functions": [
          {
            "function": "Microtubule-Dependent Transport for Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly binds to α- and β-tubulin, the primary components of microtubules. This high-affinity interaction physically links ATXN3 and its associated cargo (misfolded proteins) to the cellular transport network.",
            "effect_description": "By binding to tubulin, ATXN3 facilitates the retrograde transport of ubiquitinated protein aggregates along microtubules towards the microtubule-organizing center (MTOC). This process is essential for the formation of the aggresome, a central quality control compartment.",
            "biological_consequence": [
              "ATXN3 binds ubiquitinated protein cargo → ATXN3 binds tubulin dimers within microtubules → The entire complex is transported by dynein motor proteins → Cargo is delivered to the perinuclear region → Aggresome is formed"
            ],
            "specific_effects": [
              "ATXN3 binds to tubulin dimers with a high affinity, showing a dissociation constant (Kd) of approximately 50 nM.",
              "The interaction involves three distinct, discontinuous tubulin-binding regions (TBRs) on ATXN3: one in the N-terminal Josephin domain and two in the C-terminal disordered region.",
              "Absence of any of the three TBRs results in a drastic reduction in binding affinity to tubulin.",
              "This interaction is a key component of the machinery that sorts aggregated proteins to aggresomes."
            ],
            "evidence": [
              {
                "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
                "journal": "The International Journal of Biochemistry & Cell Biology",
                "year": 2014,
                "relevant_quote": "By SPR analysis we have demonstrated that AT3 binds to tubulin dimer with a 50nM affinity. Binding fits with a Langmuir 1:1 model and involves a single binding interface. Nevertheless, the interaction surface consists of three distinct, discontinuous tubulin-binding regions (TBR), one located in the JD, and the two others in the disordered domain, upstream and downstream of the polyQ stretch.",
                "pmid": "24685680"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "24685680"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input is validated. The interaction between ATXN3 and tubulin is direct and of high affinity, providing the physical link between protein quality control machinery and the cytoskeletal network required for aggresome formation.",
        "mechanism": "ATXN3 directly binds to α- and β-tubulin, the primary components of microtubules. This high-affinity interaction physically links ATXN3 and its associated cargo (misfolded proteins) to the cellular transport network.",
        "effect": "By binding to tubulin, ATXN3 facilitates the retrograde transport of ubiquitinated protein aggregates along microtubules towards the microtubule-organizing center (MTOC). This process is essential for the formation of the aggresome, a central quality control compartment.",
        "summary": "ATXN3 interacts with TUBB to modulate microtubule-dependent transport for aggresome formation, ultimately affecting aggresome is formed.",
        "evidence": [
          {
            "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
            "journal": "The International Journal of Biochemistry & Cell Biology",
            "year": 2014,
            "relevant_quote": "By SPR analysis we have demonstrated that AT3 binds to tubulin dimer with a 50nM affinity. Binding fits with a Langmuir 1:1 model and involves a single binding interface. Nevertheless, the interaction surface consists of three distinct, discontinuous tubulin-binding regions (TBR), one located in the JD, and the two others in the disordered domain, upstream and downstream of the polyQ stretch."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TUBB:"
      },
      {
        "primary": "DYNC1H1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with dynein, a motor protein essential for retrograde axonal transport along microtubules, which is relevant to aggresome formation.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "ATXN3 acts as a crucial adaptor protein that links polyubiquitinated misfolded proteins to the dynein motor complex. This interaction is essential for the retrograde transport of protein aggregates along microtubules to the microtubule-organizing center (MTOC).",
            "effect_description": "By facilitating the transport of ubiquitinated cargo, ATXN3 promotes the sequestration of misfolded proteins into a single large inclusion body known as an aggresome. This process is dependent on both the deubiquitinase (DUB) activity and the ubiquitin-interacting motifs (UIMs) of ATXN3, which are required for its association with the dynein complex.",
            "biological_consequence": [
              "ATXN3 binds polyubiquitinated cargo via its UIMs → ATXN3 associates with the DYNC1H1 motor complex → The entire complex undergoes retrograde transport along microtubules → Misfolded protein aggregates accumulate at the MTOC → Aggresome formation is completed."
            ],
            "specific_effects": [
              "ATXN3 co-immunoprecipitates with endogenous dynein.",
              "Small interfering RNA (siRNA) knockdown of ATXN3 significantly reduces the formation of aggresomes.",
              "Mutations in the catalytic active site or the UIMs of ATXN3 impair its association with dynein and prevent the rescue of aggresome formation in knockdown cells."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process... AT3 with mutations in the active site or ubiquitin interacting motifs cannot restore aggresome formation in AT3 knockdown cells. These same mutations decrease the association of AT3 and dynein.",
                "pmid": "15767577"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "15767577"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 acts as a crucial adaptor protein that links polyubiquitinated misfolded proteins to the dynein motor complex. This interaction is essential for the retrograde transport of protein aggregates along microtubules to the microtubule-organizing center (MTOC).",
        "effect": "By facilitating the transport of ubiquitinated cargo, ATXN3 promotes the sequestration of misfolded proteins into a single large inclusion body known as an aggresome. This process is dependent on both the deubiquitinase (DUB) activity and the ubiquitin-interacting motifs (UIMs) of ATXN3, which are required for its association with the dynein complex.",
        "summary": "ATXN3 activates DYNC1H1 to modulate aggresome formation, ultimately affecting aggresome formation is completed.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process... AT3 with mutations in the active site or ubiquitin interacting motifs cannot restore aggresome formation in AT3 knockdown cells. These same mutations decrease the association of AT3 and dynein."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> DYNC1H1:"
      },
      {
        "primary": "CCT5",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic studies have shown that mutant ATXN3 abnormally interacts with CCT5, a subunit of the chaperonin containing TCP-1 (CCT/TRiC) complex involved in protein folding.",
        "functions": [
          {
            "function": "Protein Folding",
            "arrow": "activates",
            "cellular_process": "The Chaperonin Containing TCP-1 (CCT/TRiC) complex, which includes the CCT5 subunit, is essential for folding key cellular proteins. PolyQ-expanded mutant ATXN3 exhibits a weakened interaction with CCT5 and other components of this complex.",
            "effect_description": "This loss of normal interaction with the CCT/TRiC chaperonin complex by mutant ATXN3 is believed to impair the complex's integrity and its crucial role in cellular proteostasis. The disruption of CCT's folding machinery can lead to an accumulation of misfolded proteins, contributing to cellular toxicity and the formation of aggregates in Spinocerebellar Ataxia type 3 (SCA3).",
            "biological_consequence": [
              "PolyQ expansion in ATXN3 occurs → Mutant ATXN3 loses its normal interaction with the CCT5 subunit of the CCT/TRiC complex → The protein folding capacity of the CCT/TRiC complex is compromised → Cellular proteostasis is disrupted → Misfolded proteins, including ATXN3 itself, accumulate."
            ],
            "specific_effects": [
              "In a SCA3 knock-in mouse model (Ki150), CCT5 was found to be highly depleted in high-molecular-weight fractions containing mutant ataxin-3 compared to controls with wild-type ataxin-3.",
              "The presence of mutant ataxin-3 protein results in a weakened or complete loss of interaction with CCT chaperone complexes."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... In fractions 282–218 kDa we found that proteins CCT5 and 6, and Tcp1 involved in Chaperon Containing TCP1-complex (CCT complex; T-complex), responsible for the regulation of protein folding, aggregation, and transport along neurites, were highly depleted in Ki150 brain fractions vs. Ki21 fractions.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Chaperone-Mediated Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is specific to mutant, polyQ-expanded ATXN3, which shows a weakened interaction or loss of binding, rather than a direct inhibitory enzymatic action. This impaired association disrupts the function of the CCT/TRiC complex.",
        "mechanism": "The Chaperonin Containing TCP-1 (CCT/TRiC) complex, which includes the CCT5 subunit, is essential for folding key cellular proteins. PolyQ-expanded mutant ATXN3 exhibits a weakened interaction with CCT5 and other components of this complex.",
        "effect": "This loss of normal interaction with the CCT/TRiC chaperonin complex by mutant ATXN3 is believed to impair the complex's integrity and its crucial role in cellular proteostasis. The disruption of CCT's folding machinery can lead to an accumulation of misfolded proteins, contributing to cellular toxicity and the formation of aggregates in Spinocerebellar Ataxia type 3 (SCA3).",
        "summary": "ATXN3 inhibits CCT5 to modulate protein folding regulation, ultimately affecting misfolded proteins, including atxn3 itself, accumulate.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... In fractions 282–218 kDa we found that proteins CCT5 and 6, and Tcp1 involved in Chaperon Containing TCP1-complex (CCT complex; T-complex), responsible for the regulation of protein folding, aggregation, and transport along neurites, were highly depleted in Ki150 brain fractions vs. Ki21 fractions."
          }
        ],
        "pathways": [
          {
            "name": "Chaperone-Mediated Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> CCT5:"
      },
      {
        "primary": "CAMK2A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic analysis revealed that mutant ATXN3 has an abnormal interaction with CAMK2A, a calcium/calmodulin-dependent protein kinase.",
        "functions": [
          {
            "function": "Calcium Signaling",
            "arrow": "inhibits",
            "cellular_process": "CAMK2A (Calcium/calmodulin-dependent protein kinase II alpha) is a critical enzyme in synaptic plasticity and calcium signaling pathways. Proteomic analysis of a SCA3 mouse model revealed that the polyQ-expanded, mutant form of ATXN3 has a significantly weakened interaction with CAMK2A.",
            "effect_description": "The abnormal, reduced association between mutant ATXN3 and CAMK2A suggests a disruption of CAMK2A's function. This may lead to dysregulated kinase activity, altered calcium homeostasis, and impaired synaptic function, which are potential contributors to the neuronal dysfunction observed in SCA3.",
            "biological_consequence": [
              "ATXN3 undergoes polyQ expansion → Mutant ATXN3 abnormally interacts with and shows weakened binding to CAMK2A → CAMK2A-dependent signaling pathways are dysregulated → Synaptic plasticity and neuronal calcium homeostasis are altered → Neuronal dysfunction and neurodegeneration are promoted."
            ],
            "specific_effects": [
              "Proteomic analysis of brain lysates from a SCA3 mouse model (Ki150) showed that mutant ataxin-3 abnormally interacted with CAMK2A and CAMK2B subunits.",
              "The interaction between mutant ataxin-3 and several calcium binding proteins and kinases, including CAMK2A, was strongly downregulated in the SCA3 model."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Calcium Signaling Pathway",
              "canonical_name": "Calcium Signaling",
              "ontology_id": "hsa04020",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The interaction is specific to mutant, polyQ-expanded ATXN3, which displays an abnormal and weakened interaction with CAMK2A. The effect is a consequence of this impaired binding, not direct enzymatic inhibition by ATXN3.",
        "mechanism": "CAMK2A (Calcium/calmodulin-dependent protein kinase II alpha) is a critical enzyme in synaptic plasticity and calcium signaling pathways. Proteomic analysis of a SCA3 mouse model revealed that the polyQ-expanded, mutant form of ATXN3 has a significantly weakened interaction with CAMK2A.",
        "effect": "The abnormal, reduced association between mutant ATXN3 and CAMK2A suggests a disruption of CAMK2A's function. This may lead to dysregulated kinase activity, altered calcium homeostasis, and impaired synaptic function, which are potential contributors to the neuronal dysfunction observed in SCA3.",
        "summary": "ATXN3 inhibits CAMK2A to modulate calcium signaling regulation, ultimately affecting neuronal dysfunction and neurodegeneration are promoted.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "pathways": [
          {
            "name": "Calcium Signaling Pathway",
            "canonical_name": "Calcium Signaling",
            "ontology_id": "hsa04020",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CAMK2A:"
      },
      {
        "primary": "PJA1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The E3 ubiquitin ligase PJA1 interacts with ATXN3 to promote its degradation through both the proteasome and autophagy.",
        "functions": [
          {
            "function": "ATXN3 Protein Stability",
            "arrow": "inhibits",
            "cellular_process": "The RING-H2 type E3 ubiquitin ligase PJA1 (Praja1) directly interacts with ATXN3 and catalyzes its polyubiquitination.",
            "effect_description": "The ubiquitination of ATXN3 by PJA1 serves as a signal for degradation, targeting ATXN3 to two major cellular protein clearance pathways: the ubiquitin-proteasome system (UPS) and the autophagy pathway. This process is crucial for regulating the cellular turnover and steady-state levels of both wild-type and polyglutamine-expanded ATXN3.",
            "biological_consequence": [
              "PJA1 binds to ATXN3 → PJA1 mediates the attachment of ubiquitin chains to ATXN3 → Ubiquitinated ATXN3 is recognized by proteasomes and autophagosomes → ATXN3 is degraded → Cellular levels of ATXN3 are reduced."
            ],
            "specific_effects": [
              "PJA1 promotes the degradation of both wild-type and polyglutamine-expanded forms of ATXN3.",
              "PJA1-mediated degradation of ATXN3 occurs via both the proteasome and autophagy."
            ],
            "evidence": [
              {
                "paper_title": "Praja1 ubiquitin ligase facilitates degradation of polyglutamine proteins and suppresses polyglutamine-mediated toxicity",
                "journal": "bioRxiv",
                "year": 2020,
                "relevant_quote": "PJA1 facilitates degradation of wild type and polyglutamine expanded ataxin-3 by promoting ubiquitination.",
                "pmid": "34161122"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "The FEBS Journal",
                "year": 2024,
                "relevant_quote": "For example, the E3 ligase PJA1 promotes ATXN3 degradation by the proteasome and also by autophagy (Ref. 31).",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "34161122",
              "39320846"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The RING-H2 type E3 ubiquitin ligase PJA1 (Praja1) directly interacts with ATXN3 and catalyzes its polyubiquitination.",
        "effect": "The ubiquitination of ATXN3 by PJA1 serves as a signal for degradation, targeting ATXN3 to two major cellular protein clearance pathways: the ubiquitin-proteasome system (UPS) and the autophagy pathway. This process is crucial for regulating the cellular turnover and steady-state levels of both wild-type and polyglutamine-expanded ATXN3.",
        "summary": "ATXN3 inhibits PJA1 to modulate atxn3 protein stability, ultimately affecting cellular levels of atxn3 are reduced.",
        "evidence": [
          {
            "paper_title": "Praja1 ubiquitin ligase facilitates degradation of polyglutamine proteins and suppresses polyglutamine-mediated toxicity",
            "journal": "bioRxiv",
            "year": 2020,
            "relevant_quote": "PJA1 facilitates degradation of wild type and polyglutamine expanded ataxin-3 by promoting ubiquitination."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "The FEBS Journal",
            "year": 2024,
            "relevant_quote": "For example, the E3 ligase PJA1 promotes ATXN3 degradation by the proteasome and also by autophagy (Ref. 31)."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--inhibits-- PJA1:"
      },
      {
        "primary": "AMFR",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The E3 ubiquitin ligase Gp78 (AMFR) interacts with ATXN3 to promote its polyubiquitination and subsequent degradation via the ERAD pathway.",
        "functions": [
          {
            "function": "ATXN3 Protein Stability",
            "arrow": "inhibits",
            "cellular_process": "The Endoplasmic Reticulum (ER)-associated E3 ubiquitin ligase AMFR (also known as Gp78) directly interacts with ATXN3 at the ER membrane.",
            "effect_description": "AMFR mediates the polyubiquitination of ATXN3, which flags the protein for degradation via the ER-associated degradation (ERAD) pathway. This quality control mechanism involves the removal of ATXN3 from the ER and its subsequent destruction by the proteasome in the cytosol, thereby regulating the abundance of ER-associated ATXN3.",
            "biological_consequence": [
              "AMFR interacts with ATXN3 at the ER → AMFR catalyzes the polyubiquitination of ATXN3 → Ubiquitinated ATXN3 is targeted for ERAD → ATXN3 is retrotranslocated to the cytosol for proteasomal degradation → ER-associated ATXN3 protein levels are down-regulated."
            ],
            "specific_effects": [
              "Overexpression of AMFR enhances the ubiquitination and degradation of ATXN3.",
              "Knockdown of AMFR results in the stabilization and accumulation of ATXN3 protein.",
              "AMFR-mediated degradation targets ATXN3 to the ERAD pathway."
            ],
            "evidence": [
              {
                "paper_title": "Gp78, an ER associated E3, promotes SOD1 and ataxin-3 degradation",
                "journal": "Human Molecular Genetics",
                "year": 2009,
                "relevant_quote": "Overexpression of gp78 promotes the ubiquitination and degradation of these two proteins [SOD1 and ataxin-3], whereas knockdown of gp78 stabilizes them. ... Thus, our results suggest that gp78 functions in the regulation of SOD1 and ataxin-3 to target them for ERAD.",
                "pmid": "19661182"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "The FEBS Journal",
                "year": 2024,
                "relevant_quote": "E3 ubiquitin ligase Gp78 additionally promotes the polyubiquitination and degradation of ATXN3, targeting it for endoplasmic reticulum-associated protein degradation (ERAD), a cellular pathway that degrades misfolded proteins (Ref. 34).",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "19661182",
              "39320846"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The Endoplasmic Reticulum (ER)-associated E3 ubiquitin ligase AMFR (also known as Gp78) directly interacts with ATXN3 at the ER membrane.",
        "effect": "AMFR mediates the polyubiquitination of ATXN3, which flags the protein for degradation via the ER-associated degradation (ERAD) pathway. This quality control mechanism involves the removal of ATXN3 from the ER and its subsequent destruction by the proteasome in the cytosol, thereby regulating the abundance of ER-associated ATXN3.",
        "summary": "ATXN3 inhibits AMFR to modulate atxn3 protein stability, ultimately affecting er-associated atxn3 protein levels are down-regulated.",
        "evidence": [
          {
            "paper_title": "Gp78, an ER associated E3, promotes SOD1 and ataxin-3 degradation",
            "journal": "Human Molecular Genetics",
            "year": 2009,
            "relevant_quote": "Overexpression of gp78 promotes the ubiquitination and degradation of these two proteins [SOD1 and ataxin-3], whereas knockdown of gp78 stabilizes them. ... Thus, our results suggest that gp78 functions in the regulation of SOD1 and ataxin-3 to target them for ERAD."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "The FEBS Journal",
            "year": 2024,
            "relevant_quote": "E3 ubiquitin ligase Gp78 additionally promotes the polyubiquitination and degradation of ATXN3, targeting it for endoplasmic reticulum-associated protein degradation (ERAD), a cellular pathway that degrades misfolded proteins (Ref. 34)."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- AMFR:"
      },
      {
        "primary": "HIST1H1C",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 binds to histone proteins, including linker histone H1, and is involved in regulating chromatin structure.",
        "functions": [
          {
            "function": "Chromatin Organization",
            "arrow": "activates",
            "cellular_process": "Wild-type ATXN3 binds to chromatin and functions as a scaffold protein to recruit the histone deacetylase 3 (HDAC3). This role is independent of ATXN3's catalytic deubiquitinase activity.",
            "effect_description": "By recruiting HDAC3 to chromatin, ATXN3 promotes a more condensed, transcriptionally repressed chromatin state known as heterochromatin. This structural organization is critical for regulating DNA accessibility, thereby controlling processes like DNA replication timing and global gene transcription. The interaction affects the dynamics of linker histones like HIST1H1C.",
            "biological_consequence": [
              "ATXN3 binds to chromatin → ATXN3 recruits and ensures the correct nuclear localization of HDAC3 → HDAC3 deacetylates histones on chromatin → Chromatin compaction increases, forming heterochromatin → Global transcription is repressed and DNA replication timing is controlled."
            ],
            "specific_effects": [
              "Loss of ATXN3 or expression of polyQ-expanded ATXN3 impairs the recruitment of HDAC3 to chromatin, causing HDAC3 mislocalization.",
              "Impaired HDAC3 recruitment leads to a more open chromatin state (euchromatin), characterized by increased mobility of linker histone H1.",
              "The resulting open chromatin structure leads to altered DNA replication timing and increased global transcription."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "Wild-type ATXN3 controls chromatin organization by recruiting HDAC3, thereby increasing heterochromatin and controlling DNA replication and transcription, whereas lack of or PolyQ-expanded ATXN3 triggers mislocalization of HDAC3 and euchromatin prevalence.",
                "pmid": "36971114"
              },
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "These findings demonstrate that normal AT3 binds target promoter regions and represses transcription of a GATA-2-dependent target gene via formation of histone-deacetylating repressor complexes requiring its UIM-associated function.",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Chromatin Remodeling",
              "canonical_name": "Chromatin Remodeling",
              "ontology_id": "GO:0006338",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "36971114",
              "17079677"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Wild-type ATXN3 binds to chromatin and functions as a scaffold protein to recruit the histone deacetylase 3 (HDAC3). This role is independent of ATXN3's catalytic deubiquitinase activity.",
        "effect": "By recruiting HDAC3 to chromatin, ATXN3 promotes a more condensed, transcriptionally repressed chromatin state known as heterochromatin. This structural organization is critical for regulating DNA accessibility, thereby controlling processes like DNA replication timing and global gene transcription. The interaction affects the dynamics of linker histones like HIST1H1C.",
        "summary": "ATXN3 activates HIST1H1C to modulate chromatin organization, ultimately affecting global transcription is repressed and dna replication timing is controlled.",
        "evidence": [
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "Wild-type ATXN3 controls chromatin organization by recruiting HDAC3, thereby increasing heterochromatin and controlling DNA replication and transcription, whereas lack of or PolyQ-expanded ATXN3 triggers mislocalization of HDAC3 and euchromatin prevalence."
          },
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "These findings demonstrate that normal AT3 binds target promoter regions and represses transcription of a GATA-2-dependent target gene via formation of histone-deacetylating repressor complexes requiring its UIM-associated function."
          }
        ],
        "pathways": [
          {
            "name": "Chromatin Remodeling",
            "canonical_name": "Chromatin Remodeling",
            "ontology_id": "GO:0006338",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HIST1H1C:"
      },
      {
        "primary": "ATM",
        "interaction_type": "indirect",
        "upstream_interactor": "PNKP",
        "mediator_chain": [
          "PNKP"
        ],
        "depth": 2,
        "support_summary": "Mutant ATXN3 inactivates its direct interactor PNKP, leading to the accumulation of DNA damage, which in turn causes chronic activation of the DNA damage-response kinase ATM.",
        "functions": [
          {
            "function": "DNA Damage Response Signaling",
            "arrow": "activates",
            "cellular_process": "The activation of ATM by ATXN3 is an indirect effect that occurs in the context of the polyQ-expanded, mutant form of ATXN3. Mutant ATXN3 directly binds to and inhibits the enzymatic activity of the DNA repair enzyme Polynucleotide Kinase 3'-Phosphatase (PNKP).",
            "effect_description": "The inhibition of PNKP by mutant ATXN3 leads to a failure to repair DNA strand breaks, resulting in the persistent accumulation of genomic damage. This chronic DNA damage serves as a signal to trigger the DNA Damage Response (DDR) pathway, leading to the sustained activation of the central DDR kinase, ATM (Ataxia-Telangiectasia Mutated).",
            "biological_consequence": [
              "Mutant ATXN3 binds to and inactivates the 3'-phosphatase activity of PNKP → Accumulation of unrepaired DNA strand breaks → Chronic activation of ATM kinase via autophosphorylation at Ser1981 → ATM phosphorylates downstream targets including p53 (at Ser15) and CHK2 (at Thr68) → Activation of pro-apoptotic signaling pathways → Neuronal dysfunction and cell death."
            ],
            "specific_effects": [
              "The activation of ATM is indirect, mediated by the ATXN3-polyQ inhibition of PNKP.",
              "Expression of mutant ATXN3 induces phosphorylation of ATM at Ser1981 and its substrates, γH2AX and p53.",
              "Pharmacological inhibition of ATM with inhibitors like Ku55933 can ameliorate mutant ATXN3-induced caspase-3 activation and cell death."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "inhibits",
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PNKP",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PNKP"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The activation of ATM by ATXN3 is an indirect effect that occurs in the context of the polyQ-expanded, mutant form of ATXN3. Mutant ATXN3 directly binds to and inhibits the enzymatic activity of the DNA repair enzyme Polynucleotide Kinase 3'-Phosphatase (PNKP).",
        "effect": "The inhibition of PNKP by mutant ATXN3 leads to a failure to repair DNA strand breaks, resulting in the persistent accumulation of genomic damage. This chronic DNA damage serves as a signal to trigger the DNA Damage Response (DDR) pathway, leading to the sustained activation of the central DDR kinase, ATM (Ataxia-Telangiectasia Mutated).",
        "summary": "ATXN3 activates ATM to modulate dna damage response signaling, ultimately affecting neuronal dysfunction and cell death.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "PNKP --activates--> ATM:"
      },
      {
        "primary": "TCP1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic analysis following ataxin-3 pull-down from brain lysates identified TCP1, a subunit of the CCT/TRiC chaperonin complex, as an interactor, particularly showing abnormal interaction with mutant ataxin-3.",
        "functions": [
          {
            "function": "Protein Folding",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with TCP1 (T-complex protein 1), a key subunit of the CCT/TRiC chaperonin complex. This complex is crucial for the proper folding of numerous cytosolic proteins, particularly cytoskeletal components like actin and tubulin.",
            "effect_description": "Proteomic analysis of brain lysates from a SCA3 mouse model (Ki150) revealed that the polyQ-expanded, mutant form of ATXN3 has a significantly weakened or lost interaction with TCP1 and other CCT subunits. This abnormal interaction impairs the overall function of the CCT/TRiC complex, compromising its protein folding capacity and contributing to cellular proteostasis collapse.",
            "biological_consequence": [
              "Mutant ATXN3 exhibits weakened binding to the TCP1 subunit → The structural and functional integrity of the CCT/TRiC chaperonin complex is compromised → Defective folding of nascent client proteins (e.g., actin, tubulin) → Accumulation of misfolded proteins and increased aggregation → Cellular toxicity and neurodegeneration."
            ],
            "specific_effects": [
              "Proteomic studies using pull-downs of ataxin-3 from SCA3 mouse model brains identified TCP1 as a protein with significantly weakened interaction with the mutant form.",
              "The disruption of the CCT complex function by mutant ATXN3 is linked to broader impairments in protein quality control and cellular transport mechanisms."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Chaperone-Mediated Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with TCP1 (T-complex protein 1), a key subunit of the CCT/TRiC chaperonin complex. This complex is crucial for the proper folding of numerous cytosolic proteins, particularly cytoskeletal components like actin and tubulin.",
        "effect": "Proteomic analysis of brain lysates from a SCA3 mouse model (Ki150) revealed that the polyQ-expanded, mutant form of ATXN3 has a significantly weakened or lost interaction with TCP1 and other CCT subunits. This abnormal interaction impairs the overall function of the CCT/TRiC complex, compromising its protein folding capacity and contributing to cellular proteostasis collapse.",
        "summary": "ATXN3 inhibits TCP1 to modulate protein folding, ultimately affecting cellular toxicity and neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b."
          }
        ],
        "pathways": [
          {
            "name": "Chaperone-Mediated Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TCP1:"
      },
      {
        "primary": "CCT6",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Mutant ataxin-3 was found to abnormally interact with CCT6, a subunit of the CCT/TRiC chaperonin complex, in proteomics studies of ataxin-3-positive large complexes from brain lysates.",
        "functions": [
          {
            "function": "Protein Folding",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with CCT6 (Chaperonin Containing TCP1 Subunit 6), a component of the essential CCT/TRiC chaperonin ring complex, which mediates the folding of vital cellular proteins.",
            "effect_description": "In the context of SCA3, the polyQ-expanded mutant ATXN3 protein displays an abnormal and weakened interaction with CCT6. This finding, derived from proteomic analysis of ataxin-3-associated complexes in a SCA3 mouse model, indicates that the disease protein disrupts the normal assembly or function of the CCT/TRiC complex, thereby inhibiting its chaperonin activity.",
            "biological_consequence": [
              "Mutant ATXN3 shows reduced interaction with the CCT6 subunit → The stability and/or function of the CCT/TRiC chaperonin complex is impaired → Reduced fidelity in the folding of client proteins → Increased burden of misfolded proteins, leading to aggregation and cellular stress → Contribution to neurotoxicity in SCA3."
            ],
            "specific_effects": [
              "Proteomic analysis of protein complexes isolated from a SCA3 knock-in mouse model (Ki150) brain showed that CCT6 was among the proteins with a significantly weakened interaction with mutant ataxin-3.",
              "The loss of interaction with CCT complex subunits like CCT6 is associated with downstream functional defects, such as altered mitochondrial transport in neurons."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1...",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Chaperone-Mediated Protein Folding",
              "canonical_name": "Protein Folding",
              "ontology_id": "GO:0006457",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 interacts with CCT6 (Chaperonin Containing TCP1 Subunit 6), a component of the essential CCT/TRiC chaperonin ring complex, which mediates the folding of vital cellular proteins.",
        "effect": "In the context of SCA3, the polyQ-expanded mutant ATXN3 protein displays an abnormal and weakened interaction with CCT6. This finding, derived from proteomic analysis of ataxin-3-associated complexes in a SCA3 mouse model, indicates that the disease protein disrupts the normal assembly or function of the CCT/TRiC complex, thereby inhibiting its chaperonin activity.",
        "summary": "ATXN3 inhibits CCT6 to modulate protein folding, ultimately affecting contribution to neurotoxicity in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits... Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1..."
          }
        ],
        "pathways": [
          {
            "name": "Chaperone-Mediated Protein Folding",
            "canonical_name": "Protein Folding",
            "ontology_id": "GO:0006457",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> CCT6:"
      },
      {
        "primary": "CAMK2B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic analysis of ataxin-3 pull-downs from brain lysates revealed that mutant ataxin-3 abnormally interacts with CAMK2B, a calcium/calmodulin-dependent protein kinase.",
        "functions": [
          {
            "function": "Calcium/Calmodulin-Dependent Signaling",
            "arrow": "regulates",
            "cellular_process": "ATXN3 is a component of protein complexes that include CAMK2B, the beta subunit of the calcium/calmodulin-dependent protein kinase II. This interaction is crucial for normal neuronal function, including mitochondrial transport.",
            "effect_description": "The expansion of the polyglutamine (polyQ) tract in mutant ATXN3 leads to a weakened or lost interaction with CAMK2B. This impaired association disrupts the function of the CaMKII complex, which is a key regulator of calcium signaling and is pivotal in the regulation of axonal transport of mitochondria. The disruption contributes to neuronal toxicity in Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "PolyQ expansion in ATXN3 → Weakened binding affinity for CAMK2B → Disruption of CaMKII complex integrity and function → Impaired axonal transport of mitochondria → Neuronal dysfunction and toxicity in SCA3"
            ],
            "specific_effects": [
              "Proteomic analysis of pull-downs from a SCA3 knock-in mouse model (Ki150) brain revealed a significantly weakened interaction between mutant ataxin-3 and CAMK2B.",
              "The impaired interaction with the CaMKII complex is linked to altered motility of mitochondria along SCA3 neurites."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits, several calcium binding proteins and kinases which were strongly downregulated.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Calcium Signaling Pathway",
              "canonical_name": "Calcium Signaling",
              "ontology_id": "hsa04020",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'inhibits' CAMK2B is a simplification. Primary literature shows that polyQ-expanded ATXN3 has a *weakened or impaired interaction* with CAMK2B. This loss of normal association, rather than a direct enzymatic inhibition, leads to the disruption of CAMK2 complex function.",
        "mechanism": "ATXN3 is a component of protein complexes that include CAMK2B, the beta subunit of the calcium/calmodulin-dependent protein kinase II. This interaction is crucial for normal neuronal function, including mitochondrial transport.",
        "effect": "The expansion of the polyglutamine (polyQ) tract in mutant ATXN3 leads to a weakened or lost interaction with CAMK2B. This impaired association disrupts the function of the CaMKII complex, which is a key regulator of calcium signaling and is pivotal in the regulation of axonal transport of mitochondria. The disruption contributes to neuronal toxicity in Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "ATXN3 interacts with CAMK2B to modulate calcium/calmodulin-dependent signaling, ultimately affecting neuronal dysfunction and toxicity in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "We fractionated ataxin-3-positive large complexes and independently we pulled-down ataxin-3 from brain lysates, and both were followed by proteomics. Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b... We demonstrated that the presence of mutant ataxin-3 protein results in weakened or loss of interaction with CCT chaperone complexes responsible for transport along neurits, several calcium binding proteins and kinases which were strongly downregulated."
          }
        ],
        "pathways": [
          {
            "name": "Calcium Signaling Pathway",
            "canonical_name": "Calcium Signaling",
            "ontology_id": "hsa04020",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> CAMK2B:"
      },
      {
        "primary": "ITGA5",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 regulates the stability of the α5 integrin subunit (ITGA5) by deubiquitinating it and rescuing it from proteasomal degradation, a function crucial for neuronal differentiation and cytoskeleton organization.",
        "functions": [
          {
            "function": "ITGA5 Protein Stability",
            "arrow": "activates",
            "cellular_process": "ATXN3, in its role as a deubiquitinating enzyme (DUB), directly interacts with the α5 integrin subunit (ITGA5). It removes ubiquitin chains from ITGA5, thereby preventing its recognition and subsequent degradation by the proteasome.",
            "effect_description": "By deubiquitinating ITGA5, ATXN3 stabilizes the protein, increasing its half-life and promoting its proper expression on the cell surface. This stabilization is essential for maintaining cytoskeletal organization, cell adhesion, and facilitating processes like myogenic and neuronal differentiation.",
            "biological_consequence": [
              "ATXN3 binds to ubiquitinated ITGA5 → Catalytically removes ubiquitin chains via its Josephin domain → ITGA5 is shielded from proteasomal degradation → ITGA5 protein half-life is increased → Enhanced cell adhesion and proper cellular differentiation"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with the α5 integrin subunit and stabilizes it by repressing its degradation through the ubiquitin-proteasome system (UPS).",
              "The regulation occurs at the post-translational level, as depletion of ATXN3 reduces ITGA5 protein levels without altering its transcript levels.",
              "Loss of ATXN3 function leads to increased ubiquitination and a shorter protein half-life of ITGA5."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Plays a Role in Mouse Myogenic Differentiation through Regulation of Integrin Subunit Levels",
                "journal": "PLoS ONE",
                "year": 2010,
                "relevant_quote": "Mouse ATX3 was found to interact with α5 integrin subunit and to stabilize this protein by repressing its degradation through the UPS... To confirm that mATX3 was indeed deubiquitinating the α5 integrin subunit, we performed an in vivo deubiquitination assay... These results show that mATX3 is able to deubiquitinate the α5 integrin subunit, rescuing it from degradation.",
                "pmid": "20668528"
              }
            ],
            "pathway": {
              "name": "Focal Adhesion",
              "canonical_name": "Focal Adhesion",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "20668528"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3, in its role as a deubiquitinating enzyme (DUB), directly interacts with the α5 integrin subunit (ITGA5). It removes ubiquitin chains from ITGA5, thereby preventing its recognition and subsequent degradation by the proteasome.",
        "effect": "By deubiquitinating ITGA5, ATXN3 stabilizes the protein, increasing its half-life and promoting its proper expression on the cell surface. This stabilization is essential for maintaining cytoskeletal organization, cell adhesion, and facilitating processes like myogenic and neuronal differentiation.",
        "summary": "ATXN3 activates ITGA5 to modulate itga5 protein stability, ultimately affecting enhanced cell adhesion and proper cellular differentiation.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Plays a Role in Mouse Myogenic Differentiation through Regulation of Integrin Subunit Levels",
            "journal": "PLoS ONE",
            "year": 2010,
            "relevant_quote": "Mouse ATX3 was found to interact with α5 integrin subunit and to stabilize this protein by repressing its degradation through the UPS... To confirm that mATX3 was indeed deubiquitinating the α5 integrin subunit, we performed an in vivo deubiquitination assay... These results show that mATX3 is able to deubiquitinate the α5 integrin subunit, rescuing it from degradation."
          }
        ],
        "pathways": [
          {
            "name": "Focal Adhesion",
            "canonical_name": "Focal Adhesion",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> ITGA5:"
      },
      {
        "primary": "FUS",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proximity ligation assays (PLA) have validated a direct interaction between ATXN3 and the RNA-binding protein FUS in the nucleus.",
        "functions": [
          {
            "function": "DNA Double-Strand Break Repair",
            "arrow": "activates",
            "cellular_process": "ATXN3 interacts with the RNA/DNA-binding protein FUS, a critical factor in the DNA damage response (DDR). FUS is recruited to sites of DNA damage and participates in both non-homologous end joining (NHEJ) and homologous recombination (HR) repair pathways.",
            "effect_description": "The interaction suggests a cooperative role for ATXN3 and FUS in responding to genomic stress. ATXN3's deubiquitinase activity may modulate the ubiquitination status of factors within FUS-containing repair complexes, thereby influencing the efficiency and fidelity of DNA repair.",
            "biological_consequence": [
              "DNA damage → ATXN3-FUS interaction at damage sites → Coordinated recruitment and stabilization of repair factors → Efficient DNA double-strand break repair → Maintenance of genomic stability"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with FUS in the nucleus.",
              "The interaction links ATXN3 to a key protein involved in both major DNA double-strand break repair pathways."
            ],
            "evidence": [
              {
                "paper_title": "Nuclear ATXN3 DUB physiological substrates: towards understanding their role in the context of Machado-Joseph Disease | FENS 2022",
                "year": null,
                "pmid": "38311960"
              },
              {
                "paper_title": "FUS-related amyotrophic lateral sclerosis-frontotemporal dementia and links to the DNA damage response: a systematic review",
                "year": 2024,
                "pmid": "41245603"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "38311960",
              "41245603"
            ],
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3 interacts with the RNA/DNA-binding protein FUS, a critical factor in the DNA damage response (DDR). FUS is recruited to sites of DNA damage and participates in both non-homologous end joining (NHEJ) and homologous recombination (HR) repair pathways.",
        "effect": "The interaction suggests a cooperative role for ATXN3 and FUS in responding to genomic stress. ATXN3's deubiquitinase activity may modulate the ubiquitination status of factors within FUS-containing repair complexes, thereby influencing the efficiency and fidelity of DNA repair.",
        "summary": "ATXN3 activates FUS to modulate dna double-strand break repair, ultimately affecting maintenance of genomic stability.",
        "evidence": [
          {
            "paper_title": "Nuclear ATXN3 DUB physiological substrates: towards understanding their role in the context of Machado-Joseph Disease | FENS 2022",
            "year": null
          },
          {
            "paper_title": "FUS-related amyotrophic lateral sclerosis-frontotemporal dementia and links to the DNA damage response: a systematic review",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds--> FUS:"
      },
      {
        "primary": "CUL1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proximity ligation assays (PLA) confirmed a direct interaction between ATXN3 and Cullin 1 (CUL1), a core component of SCF E3 ubiquitin ligase complexes.",
        "functions": [
          {
            "function": "SCF E3 Ligase Activity",
            "arrow": "inhibits",
            "cellular_process": "ATXN3, a deubiquitinase, directly interacts with Cullin 1 (CUL1), the central scaffold protein of the Skp1-CUL1-F-box (SCF) family of E3 ubiquitin ligases. SCF complexes polyubiquitinate a wide range of substrate proteins, targeting them for proteasomal degradation.",
            "effect_description": "This interaction allows ATXN3 to directly antagonize the action of SCF E3 ligases. By deubiquitinating substrates targeted by an SCF complex (such as CHK1), ATXN3 can reverse the degradation signal and rescue the protein from destruction, thereby creating a regulatory balance.",
            "biological_consequence": [
              "ATXN3 binds to CUL1 → Deubiquitination of SCF complex substrates → Reversal of SCF-mediated degradation signal → Increased stability of target proteins"
            ],
            "specific_effects": [
              "ATXN3 directly interacts with the core E3 ligase scaffold protein CUL1.",
              "The interaction provides a mechanism for ATXN3 to counteract ubiquitination mediated by SCF complexes."
            ],
            "evidence": [
              {
                "paper_title": "Nuclear ATXN3 DUB physiological substrates: towards understanding their role in the context of Machado-Joseph Disease | FENS 2022",
                "year": null,
                "pmid": "38311960"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "inhibits",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Proteasomal Degradation",
              "ontology_id": "GO:0010498",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "38311960",
              "39320846"
            ],
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_validation_status": "rejected",
        "mechanism": "ATXN3, a deubiquitinase, directly interacts with Cullin 1 (CUL1), the central scaffold protein of the Skp1-CUL1-F-box (SCF) family of E3 ubiquitin ligases. SCF complexes polyubiquitinate a wide range of substrate proteins, targeting them for proteasomal degradation.",
        "effect": "This interaction allows ATXN3 to directly antagonize the action of SCF E3 ligases. By deubiquitinating substrates targeted by an SCF complex (such as CHK1), ATXN3 can reverse the degradation signal and rescue the protein from destruction, thereby creating a regulatory balance.",
        "summary": "ATXN3 inhibits CUL1 to modulate scf e3 ligase activity, ultimately affecting increased stability of target proteins.",
        "evidence": [
          {
            "paper_title": "Nuclear ATXN3 DUB physiological substrates: towards understanding their role in the context of Machado-Joseph Disease | FENS 2022",
            "year": null
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Proteasomal Degradation",
            "ontology_id": "GO:0010498",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CUL1:"
      },
      {
        "primary": "TDP-43",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "ATXN3 functionally regulates the stability and clearance of TDP-43 C-terminal fragments. Overexpression of ATXN3 reduces the accumulation of phosphorylated TDP-43, a hallmark of ALS pathology, suggesting an indirect regulatory role.",
        "functions": [
          {
            "function": "TDP-43 Clearance and Aggregation",
            "arrow": "activates",
            "cellular_process": "ATXN3 indirectly promotes the clearance of pathogenic, phosphorylated, and aggregation-prone C-terminal fragments of TDP-43. Pathological TDP-43 is a hallmark of neurodegenerative diseases like ALS and FTLD, and its clearance is mediated by both the proteasome and autophagy pathways.",
            "effect_description": "By maintaining the efficiency of cellular protein quality control systems, ATXN3 helps reduce the accumulation of toxic TDP-43 species. Overexpression of functional ATXN3 can mitigate the buildup of these fragments, thereby reducing their cytotoxic effects. This suggests a neuroprotective role for ATXN3 in the context of TDP-43 proteinopathies.",
            "biological_consequence": [
              "Pathogenic C-terminal fragments of TDP-43 are generated → These fragments become hyperphosphorylated and form aggregates → ATXN3's function in protein quality control pathways (UPS/autophagy) enhances the degradation of these fragments → Accumulation of toxic TDP-43 aggregates is reduced → Cellular toxicity is decreased."
            ],
            "specific_effects": [
              "ATXN3's deubiquitinase activity is plausibly involved in the clearance of phosphorylated C-terminal fragments of TDP-43.",
              "Pathological TDP-43 inclusions are observed in MJD patients, and ATXN3 is considered a significant gene for ALS, establishing a pathological link.",
              "The clearance of TDP-43 aggregates is known to be dependent on both the proteasome and autophagy pathways."
            ],
            "evidence": [
              {
                "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
                "journal": "Neurobiology of Disease",
                "year": 2024,
                "relevant_quote": "TDP-43 C-terminal fragments are observed in the post-mortem tissue of 97% of ALS patients, and pathological TDP-43 inclusions are similarly observed in lower motor neurons in the brainstem and spinal cord of MJD patients. Whilst Cui et al., did not investigate the mechanism underpinning this effect of ATXN3 on phosphorylated C-terminal fragments of TDP-43, it is plausible that the DUB function of ataxin-3 may be involved.",
                "pmid": "38497605"
              },
              {
                "paper_title": "Regulation of TDP-43 aggregation by phosphorylation and p62/SQSTM1",
                "journal": "Journal of Neurochemistry",
                "year": 2011,
                "relevant_quote": "Inhibition of either proteasome or autophagy dramatically increases TDP-43 aggregation. ... These studies suggest that aggregation of TDP-43 C-terminal fragments is regulated by phosphorylation events and both the autophagy and proteasome-mediated degradation pathways.",
                "pmid": "21062285"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": "GO:0035973",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "38497605",
              "21062285"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "direct_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": "The interaction is indirect. ATXN3 does not directly bind TDP-43 but influences its clearance and aggregation, likely through its broad functions in the ubiquitin-proteasome system and autophagy, which are the primary pathways for degrading pathogenic TDP-43 fragments.",
        "mechanism": "ATXN3 indirectly promotes the clearance of pathogenic, phosphorylated, and aggregation-prone C-terminal fragments of TDP-43. Pathological TDP-43 is a hallmark of neurodegenerative diseases like ALS and FTLD, and its clearance is mediated by both the proteasome and autophagy pathways.",
        "effect": "By maintaining the efficiency of cellular protein quality control systems, ATXN3 helps reduce the accumulation of toxic TDP-43 species. Overexpression of functional ATXN3 can mitigate the buildup of these fragments, thereby reducing their cytotoxic effects. This suggests a neuroprotective role for ATXN3 in the context of TDP-43 proteinopathies.",
        "summary": "ATXN3 activates TDP-43 to modulate tdp-43 clearance and aggregation, ultimately affecting cellular toxicity is decreased.",
        "evidence": [
          {
            "paper_title": "The deubiquitinase function of ataxin-3 and its role in the pathogenesis of Machado-Joseph disease and other diseases",
            "journal": "Neurobiology of Disease",
            "year": 2024,
            "relevant_quote": "TDP-43 C-terminal fragments are observed in the post-mortem tissue of 97% of ALS patients, and pathological TDP-43 inclusions are similarly observed in lower motor neurons in the brainstem and spinal cord of MJD patients. Whilst Cui et al., did not investigate the mechanism underpinning this effect of ATXN3 on phosphorylated C-terminal fragments of TDP-43, it is plausible that the DUB function of ataxin-3 may be involved."
          },
          {
            "paper_title": "Regulation of TDP-43 aggregation by phosphorylation and p62/SQSTM1",
            "journal": "Journal of Neurochemistry",
            "year": 2011,
            "relevant_quote": "Inhibition of either proteasome or autophagy dramatically increases TDP-43 aggregation. ... These studies suggest that aggregation of TDP-43 C-terminal fragments is regulated by phosphorylation events and both the autophagy and proteasome-mediated degradation pathways."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": "GO:0035973",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> TDP-43:"
      },
      {
        "primary": "MFN1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "Expression of mutant ATXN3 leads to decreased protein levels of Mitofusin-1 (MFN1), a key regulator of mitochondrial fusion, resulting in disrupted mitochondrial dynamics and increased mitochondrial fission.",
        "functions": [
          {
            "function": "Mitochondrial Fusion",
            "arrow": "inhibits",
            "cellular_process": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), the expression of mutant, polyglutamine-expanded ATXN3, particularly its truncated fragments, leads to a reduction in the protein levels of Mitofusin-1 (MFN1). MFN1 is a GTPase embedded in the outer mitochondrial membrane that is essential for the fusion of mitochondria.",
            "effect_description": "The decrease in MFN1 protein levels disrupts the balance of mitochondrial dynamics, tipping it away from fusion and towards fission. This results in increased mitochondrial fragmentation, mitochondrial membrane potential collapse, and elevated reactive oxygen species (ROS) production, contributing to overall mitochondrial dysfunction.",
            "biological_consequence": [
              "Expression of mutant ATXN3 (polyQ-expanded) → Formation of truncated ATXN3 fragments → Decreased protein levels of MFN1 → Impaired outer mitochondrial membrane fusion → Increased mitochondrial fission and fragmentation → Mitochondrial dysfunction → Neuronal stress and degeneration"
            ],
            "specific_effects": [
              "Reduces the steady-state protein levels of MFN1, an effect observed in both cell culture and transgenic mouse models of SCA3.",
              "Indirectly causes a shift in the fission/fusion equilibrium, leading to a higher proportion of fragmented mitochondria."
            ],
            "evidence": [
              {
                "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2017,
                "relevant_quote": "In addition, truncated mutant ATXN3 caused more mitochondrial fission, and decreased the expression of mitochondrial fusion markers, including Mfn-1 and Mfn-2. Furthermore, truncated mutant ATXN3 decreased the mitochondrial membrane potential, increased reactive oxygen species and finally increased cell death rate.",
                "pmid": "28676741"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Dynamics",
              "canonical_name": "Mitochondrial Dynamics",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28676741"
            ],
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), the expression of mutant, polyglutamine-expanded ATXN3, particularly its truncated fragments, leads to a reduction in the protein levels of Mitofusin-1 (MFN1). MFN1 is a GTPase embedded in the outer mitochondrial membrane that is essential for the fusion of mitochondria.",
        "effect": "The decrease in MFN1 protein levels disrupts the balance of mitochondrial dynamics, tipping it away from fusion and towards fission. This results in increased mitochondrial fragmentation, mitochondrial membrane potential collapse, and elevated reactive oxygen species (ROS) production, contributing to overall mitochondrial dysfunction.",
        "summary": "ATXN3 inhibits MFN1 to modulate mitochondrial fusion, ultimately affecting neuronal stress and degeneration.",
        "evidence": [
          {
            "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2017,
            "relevant_quote": "In addition, truncated mutant ATXN3 caused more mitochondrial fission, and decreased the expression of mitochondrial fusion markers, including Mfn-1 and Mfn-2. Furthermore, truncated mutant ATXN3 decreased the mitochondrial membrane potential, increased reactive oxygen species and finally increased cell death rate."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Dynamics",
            "canonical_name": "Mitochondrial Dynamics",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> MFN1:"
      },
      {
        "primary": "MFN2",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 2,
        "support_summary": "Mutant ATXN3 expression causes a reduction in the levels of Mitofusin-2 (MFN2), a protein essential for mitochondrial fusion. This disruption contributes to abnormal mitochondrial morphology and dynamics observed in SCA3 models.",
        "functions": [
          {
            "function": "Mitochondrial Fusion",
            "arrow": "inhibits",
            "cellular_process": "Similar to its effect on MFN1, the expression of polyglutamine-expanded mutant ATXN3 results in reduced protein levels of Mitofusin-2 (MFN2), a key regulator of mitochondrial fusion located on the outer mitochondrial membrane.",
            "effect_description": "The reduction of MFN2 impairs the fusion of mitochondria, leading to an accumulation of fragmented and dysfunctional mitochondria. This process is a significant contributor to the neurodegenerative pathology observed in Spinocerebellar Ataxia Type 3 (SCA3).",
            "biological_consequence": [
              "Expression of mutant ATXN3 (polyQ-expanded) → Generation of toxic ATXN3 fragments → Decreased MFN2 protein abundance → Disruption of mitochondrial fusion machinery → Increased mitochondrial fragmentation and abnormal morphology → Impaired cellular bioenergetics → Neuronal dysfunction"
            ],
            "specific_effects": [
              "Indirectly lowers the cellular protein concentration of MFN2.",
              "Contributes to the disruption of the mitochondrial network's integrity and function."
            ],
            "evidence": [
              {
                "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2017,
                "relevant_quote": "In this study we observed truncated mutant ATXN3, TLQ, more easily formed insoluble aggregates, and translocated into the nucleus earlier in vitro. In addition, this also led to more mitochondrial fission due to lower expression of Mfn-1 and Mfn-2, two proteins for the fusion of the outer mitochondrial membrane.",
                "pmid": "28676741"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Dynamics",
              "canonical_name": "Mitochondrial Dynamics",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28676741"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "_chain_inferred": true,
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Similar to its effect on MFN1, the expression of polyglutamine-expanded mutant ATXN3 results in reduced protein levels of Mitofusin-2 (MFN2), a key regulator of mitochondrial fusion located on the outer mitochondrial membrane.",
        "effect": "The reduction of MFN2 impairs the fusion of mitochondria, leading to an accumulation of fragmented and dysfunctional mitochondria. This process is a significant contributor to the neurodegenerative pathology observed in Spinocerebellar Ataxia Type 3 (SCA3).",
        "summary": "ATXN3 inhibits MFN2 to modulate mitochondrial fusion, ultimately affecting neuronal dysfunction.",
        "evidence": [
          {
            "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2017,
            "relevant_quote": "In this study we observed truncated mutant ATXN3, TLQ, more easily formed insoluble aggregates, and translocated into the nucleus earlier in vitro. In addition, this also led to more mitochondrial fission due to lower expression of Mfn-1 and Mfn-2, two proteins for the fusion of the outer mitochondrial membrane."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Dynamics",
            "canonical_name": "Mitochondrial Dynamics",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> MFN2:"
      },
      {
        "primary": "BCL2",
        "interaction_type": "indirect",
        "upstream_interactor": "PARK2",
        "mediator_chain": [
          "PARK2"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly regulates the autophagy inhibitor Bcl-2 by interacting with and modulating the E3 ligase activity of Parkin (PARK2), which in turn monoubiquitinates Bcl-2.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3, as a deubiquitinating enzyme, directly interacts with and regulates the E3 ubiquitin ligase Parkin (PARK2). Parkin, in turn, interacts with the anti-apoptotic protein BCL2. However, contrary to the input claim, Parkin's E3 ligase activity mediates the monoubiquitination of BCL2, which does not promote its degradation or dissociation from Beclin-1 (BECN1). Instead, this modification enhances BCL2's stability and strengthens its inhibitory binding to BECN1.",
            "effect_description": "By regulating Parkin, ATXN3 indirectly influences the stability of the BCL2/BECN1 complex. The Parkin-mediated monoubiquitination of BCL2 sequesters BECN1, a core component of the autophagy initiation complex. This prevents the induction of autophagy. Therefore, the ATXN3-PARK2-BCL2 axis serves to inhibit, not activate, the autophagic process under basal or starvation conditions.",
            "biological_consequence": [
              "ATXN3 regulates PARK2 activity → PARK2 monoubiquitinates BCL2 → Monoubiquitination increases BCL2 stability → The inhibitory BCL2/BECN1 complex is stabilized and enhanced → BECN1 is sequestered and cannot initiate autophagy → Decreased autophagic flux"
            ],
            "specific_effects": [
              "ATXN3's regulation of Parkin indirectly leads to the stabilization of BCL2 protein through monoubiquitination.",
              "The ultimate effect of this pathway is the inhibition of general autophagy by strengthening the BCL2-BECN1 interaction."
            ],
            "evidence": [
              {
                "paper_title": "Parkin Mono-ubiquitinates Bcl-2 and Regulates Autophagy",
                "journal": "Journal of Biological Chemistry",
                "year": 2010,
                "relevant_quote": "Here, we identify the Bcl-2, an anti-apoptotic and autophagy inhibitory protein, as a substrate for parkin. Parkin directly binds to Bcl-2 via its C terminus and mediates the mono-ubiquitination of Bcl-2, which increases the steady-state levels of Bcl-2... Moreover, overexpression of parkin enhances the interactions between Bcl-2 and Beclin 1.",
                "pmid": "20889974"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "ATXN3 also regulates the activity of the E3 ligase Parkin, important for the ubiquitination of autophagy substrates and the autophagy inhibitor Bcl-2.",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": "GO:0006914",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "20889974",
              "39320846"
            ],
            "direct_arrow": "inhibits",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PARK2",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PARK2"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "MECHANISTIC OPPOSITE DETECTED. The input claim that ATXN3's regulation of PARK2 *activates* autophagy by promoting BCL2/BECN1 dissociation is incorrect. Primary literature shows that PARK2-mediated monoubiquitination of BCL2 *stabilizes* the BCL2/BECN1 complex, thereby *inhibiting* general autophagy. ATXN3 regulates PARK2, but the downstream effect on the BCL2-BECN1 interaction is inhibitory to autophagy, not activating.",
        "mechanism": "ATXN3, as a deubiquitinating enzyme, directly interacts with and regulates the E3 ubiquitin ligase Parkin (PARK2). Parkin, in turn, interacts with the anti-apoptotic protein BCL2. However, contrary to the input claim, Parkin's E3 ligase activity mediates the monoubiquitination of BCL2, which does not promote its degradation or dissociation from Beclin-1 (BECN1). Instead, this modification enhances BCL2's stability and strengthens its inhibitory binding to BECN1.",
        "effect": "By regulating Parkin, ATXN3 indirectly influences the stability of the BCL2/BECN1 complex. The Parkin-mediated monoubiquitination of BCL2 sequesters BECN1, a core component of the autophagy initiation complex. This prevents the induction of autophagy. Therefore, the ATXN3-PARK2-BCL2 axis serves to inhibit, not activate, the autophagic process under basal or starvation conditions.",
        "summary": "ATXN3 inhibits BCL2 to modulate autophagy, ultimately affecting decreased autophagic flux.",
        "evidence": [
          {
            "paper_title": "Parkin Mono-ubiquitinates Bcl-2 and Regulates Autophagy",
            "journal": "Journal of Biological Chemistry",
            "year": 2010,
            "relevant_quote": "Here, we identify the Bcl-2, an anti-apoptotic and autophagy inhibitory protein, as a substrate for parkin. Parkin directly binds to Bcl-2 via its C terminus and mediates the mono-ubiquitination of Bcl-2, which increases the steady-state levels of Bcl-2... Moreover, overexpression of parkin enhances the interactions between Bcl-2 and Beclin 1."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "ATXN3 also regulates the activity of the E3 ligase Parkin, important for the ubiquitination of autophagy substrates and the autophagy inhibitor Bcl-2."
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": "GO:0006914",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "PARK2 --regulates--> BCL2:"
      },
      {
        "primary": "UFD1",
        "interaction_type": "indirect",
        "upstream_interactor": "VCP",
        "mediator_chain": [
          "VCP"
        ],
        "depth": 2,
        "support_summary": "ATXN3 binding to VCP/p97 decreases the interaction between VCP/p97 and its cofactor UFD1. This competition reduces the retrotranslocation of ERAD substrates, indicating an indirect regulatory relationship between ATXN3 and UFD1.",
        "functions": [
          {
            "function": "ER-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly binds to the AAA-ATPase VCP/p97. This interaction competitively interferes with the binding of the VCP cofactor UFD1 to VCP/p97. The VCP-UFD1-NPL4 complex is essential for recognizing and extracting ubiquitinated, misfolded proteins from the endoplasmic reticulum (ER) for subsequent degradation by the proteasome.",
            "effect_description": "By binding to VCP/p97, ATXN3 displaces UFD1, leading to a reduced association of the VCP-UFD1-NPL4 complex with ubiquitinated ERAD substrates. This impairment of the complex's function hinders the retrotranslocation of misfolded proteins from the ER to the cytosol, ultimately inhibiting their degradation.",
            "biological_consequence": [
              "ATXN3 binds to VCP/p97 → UFD1 is displaced from the VCP/p97 complex → The VCP-UFD1-NPL4 complex has reduced interaction with ubiquitinated ERAD substrates → Retrotranslocation of misfolded proteins from the ER is inhibited → ERAD substrates accumulate in the ER."
            ],
            "specific_effects": [
              "ATXN3 and UFD1 bind to VCP/p97 in a mutually exclusive manner.",
              "ATXN3 expression decreases the amount of UFD1 associated with VCP/p97.",
              "ATXN3 inhibits the retrotranslocation of ERAD substrates from the ER.",
              "ATXN3 functions as a negative regulator of the ERAD pathway by modulating the VCP-dependent extraction of proteins from the ER."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pathway": {
              "name": "ER-Associated Degradation",
              "canonical_name": "ER-Associated Degradation",
              "ontology_id": "GO:0036503",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "16822850"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": "VCP",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [
                "VCP"
              ],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds to the AAA-ATPase VCP/p97. This interaction competitively interferes with the binding of the VCP cofactor UFD1 to VCP/p97. The VCP-UFD1-NPL4 complex is essential for recognizing and extracting ubiquitinated, misfolded proteins from the endoplasmic reticulum (ER) for subsequent degradation by the proteasome.",
        "effect": "By binding to VCP/p97, ATXN3 displaces UFD1, leading to a reduced association of the VCP-UFD1-NPL4 complex with ubiquitinated ERAD substrates. This impairment of the complex's function hinders the retrotranslocation of misfolded proteins from the ER to the cytosol, ultimately inhibiting their degradation.",
        "summary": "ATXN3 inhibits UFD1 to modulate er-associated degradation (erad), ultimately affecting erad substrates accumulate in the er.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          }
        ],
        "pathways": [
          {
            "name": "ER-Associated Degradation",
            "canonical_name": "ER-Associated Degradation",
            "ontology_id": "GO:0036503",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "VCP --inhibits--> UFD1:"
      }
    ]
  }
}