{
  "snapshot_json": {
    "main": "ATXN3",
    "interactors": [
      {
        "primary": "VCP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with VCP/p97, a crucial partner in the ERAD pathway. This interaction is supported by co-immunoprecipitation evidence and is involved in targeting proteins for proteasomal degradation.",
        "functions": [
          {
            "function": "ER-Associated Degradation (ERAD)",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 directly binds to the hexameric AAA+ ATPase VCP/p97, a central component of the ERAD pathway responsible for extracting misfolded proteins from the endoplasmic reticulum. ATXN3 and the VCP cofactor Ufd1 bind to VCP in a mutually exclusive manner. By competing with Ufd1, ATXN3 modulates the extraction of ubiquitinated ERAD substrates from the ER membrane.",
            "effect_description": "ATXN3 binding to VCP/p97 competitively inhibits the binding of the Ufd1 cofactor, which is required for efficient substrate processing. This leads to a decrease in the retrotranslocation of ERAD substrates from the ER to the cytosol for proteasomal degradation, effectively acting as a regulator of the ERAD pathway.",
            "biological_consequence": [
              "ATXN3 binds VCP/p97 → ATXN3 competitively displaces the VCP cofactor Ufd1 → VCP's interaction with ubiquitinated ERAD substrates is reduced → VCP-dependent retrotranslocation of substrates from the ER is inhibited → Degradation of ERAD substrates is decreased, leading to their accumulation."
            ],
            "specific_effects": [
              "ATXN3 and Ufd1 bind to VCP in a mutually exclusive manner.",
              "ATXN3 binding decreases the interaction of VCP with Ufd1 and associated ubiquitylated proteins.",
              "Overexpression of ATXN3 increases the cellular levels of the ERAD substrate CD3-delta by decreasing its degradation.",
              "In a reconstituted in vitro system, ATXN3 directly inhibits the VCP-dependent retrotranslocation of an ERAD substrate."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Binds VCP/p97 and Regulates Retrotranslocation of ERAD Substrates",
                "journal": "Human Molecular Genetics",
                "year": 2006,
                "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
                "pmid": "16822850"
              }
            ],
            "pathway": {
              "name": "ER-Associated Degradation",
              "canonical_name": "ER-Associated Degradation",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "16822850"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          },
          {
            "function": "Stimulation of ATXN3 Deubiquitinase Activity",
            "arrow": "activates",
            "cellular_process": "VCP/p97 directly interacts with ATXN3 and allosterically enhances its deubiquitinase (DUB) activity. This activation is specific to wild-type ATXN3 and is not observed with the polyglutamine-expanded, pathogenic form of ATXN3. This positions ATXN3 to process ubiquitin chains on substrates being handled by VCP-dependent pathways.",
            "effect_description": "VCP/p97 functions as a potent activator of wild-type ATXN3's ubiquitin hydrolase activity. This interaction enhances ATXN3's ability to cleave ubiquitin chains, thereby regulating the stability and fate of VCP-associated substrates, such as the autophagy-initiating protein BECN1 (Beclin-1).",
            "biological_consequence": [
              "VCP/p97 binds to wild-type ATXN3 → VCP/p97 enhances the catalytic (DUB) activity of ATXN3 → ATXN3 more efficiently deubiquitinates substrates like BECN1 → Stabilized BECN1 promotes the assembly and activity of the PtdIns3K complex → Autophagy initiation is promoted."
            ],
            "specific_effects": [
              "VCP/p97 specifically enhances the deubiquitinase activity of wild-type ATXN3 but not polyQ-expanded ATXN3.",
              "The VCP/p97-mediated activation of ATXN3 leads to the stabilization of BECN1, a key regulator of autophagy.",
              "The interaction is mediated by the 282-RKRR-285 motif on ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
                "journal": "PLoS ONE",
                "year": 2012,
                "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3, In contrast, we observed no significant alterations in ataxin-3 enzyme kinetics or substrate preference in the presence of hHR23A alone or in combination with VCP.",
                "pmid": "22970133"
              },
              {
                "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
                "journal": "Autophagy",
                "year": 2021,
                "relevant_quote": "VCP stimulates the deubiquitinase activity of ATXN3 (ataxin 3) to stabilize BECN1 protein levels and also interacts with and promotes the assembly and kinase activity of the PtdIns3K complex.",
                "pmid": "33719912"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "22970133",
              "33719912"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "ATXN3 directly binds to the hexameric AAA+ ATPase VCP/p97, a central component of the ERAD pathway r; VCP/p97 directly interacts with ATXN3 and allosterically enhances its deubiquitinase (DUB) activity",
        "effect": "ATXN3 binding to VCP/p97 competitively inhibits the binding of the Ufd1 cofactor, which is required for efficient substrate processing. This leads to a decrease in the retrotranslocation of ERAD substrates from the ER to the cytosol for proteasomal degradation, effectively acting as a regulator of the ERAD pathway.; VCP/p97 functions as a potent activator of wild-type ATXN3's ubiquitin hydrolase activity. This interaction enhances ATXN3's ability to cleave ubiquitin chains, thereby regulating the stability and fate of VCP-associated substrates, such as the autophagy-initiating protein BECN1 (Beclin-1).",
        "summary": "ATXN3 regulates VCP to regulate er-associated degradation (erad) regulation and stimulation of atxn3 deubiquitinase activity, ultimately affecting degradation of erad substrates is decreased, leading to their accumulation.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Binds VCP/p97 and Regulates Retrotranslocation of ERAD Substrates",
            "journal": "Human Molecular Genetics",
            "year": 2006,
            "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
          },
          {
            "paper_title": "Valosin-Containing Protein (VCP/p97) Is an Activator of Wild-Type Ataxin-3",
            "journal": "PLoS ONE",
            "year": 2012,
            "relevant_quote": "VCP/p97 was shown to be an activator specifically of wild-type ataxin-3, exhibiting no effect on expanded ataxin-3, In contrast, we observed no significant alterations in ataxin-3 enzyme kinetics or substrate preference in the presence of hHR23A alone or in combination with VCP."
          },
          {
            "paper_title": "VCP/p97 modulates PtdIns3P production and autophagy initiation",
            "journal": "Autophagy",
            "year": 2021,
            "relevant_quote": "VCP stimulates the deubiquitinase activity of ATXN3 (ataxin 3) to stabilize BECN1 protein levels and also interacts with and promotes the assembly and kinase activity of the PtdIns3K complex."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          },
          {
            "name": "ER-Associated Degradation",
            "canonical_name": "ER-Associated Degradation",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> VCP:"
      },
      {
        "primary": "RAD23A",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is known to interact with the human homologues of yeast protein RAD23, hHR23A and hHR23B, which are involved in the ubiquitin-proteasome system. Co-immunoprecipitation has validated this interaction.",
        "functions": [
          {
            "function": "Inhibition of ATXN3 Proteasomal Degradation",
            "arrow": "activates",
            "cellular_process": "ATXN3 directly interacts with the proteasome-associated shuttle protein RAD23A via its N-terminal Ubiquitin-binding site 2 (UbS2). This interaction shields ATXN3 from its own ubiquitination-independent degradation by the proteasome.",
            "effect_description": "By binding to RAD23A, ATXN3 is stabilized and its protein half-life is increased. Disrupting the ATXN3-RAD23A interaction (e.g., by mutating the UbS2 site) or reducing RAD23A levels leads to a marked increase in the proteasomal turnover of ATXN3.",
            "biological_consequence": [
              "ATXN3 binds to RAD23A via its UbS2 domain → The ATXN3-RAD23A complex prevents ATXN3 from being degraded by the 26S proteasome → Steady-state levels of ATXN3 protein are maintained."
            ],
            "specific_effects": [
              "The interaction is mediated by the Ubiquitin-binding site 2 (UbS2) on ATXN3.",
              "Binding of RAD23A to UbS2 impedes the ubiquitination-independent proteasomal degradation of ATXN3.",
              "Knockdown of RAD23A in cultured cells results in lower steady-state levels of ATXN3 protein."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels... Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein.",
                "pmid": "25144244"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25144244"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          },
          {
            "function": "Neuroprotective Signaling",
            "arrow": "activates",
            "cellular_process": "The physical interaction between ATXN3 and RAD23A is a prerequisite for a downstream neuroprotective pathway. This complex is necessary to increase the transcription and protein levels of the co-chaperone DnaJ-1 (HSP40).",
            "effect_description": "The ATXN3-RAD23A interaction activates a signaling cascade that upregulates DnaJ-1. Increased levels of DnaJ-1 then help to suppress the toxicity and aggregation of polyglutamine-expanded proteins, conferring a neuroprotective effect.",
            "biological_consequence": [
              "ATXN3 binds RAD23A → The ATXN3-RAD23A complex, in a manner dependent on ATXN3's catalytic activity, increases transcription of the DnaJ-1 gene → DnaJ-1 protein levels rise → DnaJ-1 functions with other chaperones to reduce polyQ protein aggregation and suppress neurodegeneration."
            ],
            "specific_effects": [
              "The neuroprotective function requires both the ATXN3-RAD23A interaction and the deubiquitinase activity of ATXN3.",
              "This pathway is distinct from protein degradation, as ATXN3 suppresses polyQ toxicity by upregulating chaperones rather than by increasing turnover of the toxic species."
            ],
            "evidence": [
              {
                "paper_title": "The deubiquitinase ataxin-3 requires Rad23 and DnaJ-1 for its neuroprotective role in Drosophila melanogaster",
                "journal": "Human Molecular Genetics",
                "year": 2015,
                "relevant_quote": "Instead this deubiquitinase, through its interaction with Rad23, leads to increased protein levels of the co-chaperone DnaJ-1 and depends on it to protect against degeneration. Through DnaJ-1, our data connect ataxin-3 and Rad23 to protective processes involved with protein folding rather than increased turnover of toxic polyQ species.",
                "pmid": "26007638"
              }
            ],
            "pathway": {
              "name": "Neuronal Survival Pathway",
              "canonical_name": "Neuronal Survival Pathway",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "26007638"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' proteasomal degradation via RAD23A is a contextual error and mechanistic opposite. The primary literature demonstrates that the direct interaction between ATXN3 and RAD23A *prevents* the proteasomal degradation of ATXN3 itself, thereby stabilizing it. The interaction is also required for a downstream neuroprotective signaling cascade.",
        "mechanism": "ATXN3 directly interacts with the proteasome-associated shuttle protein RAD23A via its N-terminal Ubiquitin-binding site 2 (UbS2). This interaction shields ATXN3 from its own ubiquitination-independent degradation by the proteasome. The physical interaction between ATXN3 and RAD23A is a prerequisite for a downstream neuroprotective pathway. This complex is necessary to increase the transcription and protein levels of the co-chaperone DnaJ-1 (HSP40).",
        "effect": "By binding to RAD23A, ATXN3 is stabilized and its protein half-life is increased. Disrupting the ATXN3-RAD23A interaction (e.g., by mutating the UbS2 site) or reducing RAD23A levels leads to a marked increase in the proteasomal turnover of ATXN3.; The ATXN3-RAD23A interaction activates a signaling cascade that upregulates DnaJ-1. Increased levels of DnaJ-1 then help to suppress the toxicity and aggregation of polyglutamine-expanded proteins, conferring a neuroprotective effect.",
        "summary": "ATXN3 activates RAD23A to regulate inhibition of atxn3 proteasomal degradation and neuroprotective signaling, ultimately affecting steady-state levels of atxn3 protein are maintained.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Here we show that, unlike most proteins, ataxin-3 turnover does not require its ubiquitination, but is regulated by ubiquitin-binding site 2 (UbS2) on its N terminus. Mutating UbS2 decreases ataxin-3 protein levels... Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein."
          },
          {
            "paper_title": "The deubiquitinase ataxin-3 requires Rad23 and DnaJ-1 for its neuroprotective role in Drosophila melanogaster",
            "journal": "Human Molecular Genetics",
            "year": 2015,
            "relevant_quote": "Instead this deubiquitinase, through its interaction with Rad23, leads to increased protein levels of the co-chaperone DnaJ-1 and depends on it to protect against degeneration. Through DnaJ-1, our data connect ataxin-3 and Rad23 to protective processes involved with protein folding rather than increased turnover of toxic polyQ species."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          },
          {
            "name": "Neuronal Survival Pathway",
            "canonical_name": "Neuronal Survival Pathway",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds--> RAD23A:"
      },
      {
        "primary": "RAD23B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with RAD23B, a key component of the ubiquitin-proteasome pathway. This interaction has been confirmed through co-immunoprecipitation experiments.",
        "functions": [
          {
            "function": "Inhibition of ATXN3 Proteasomal Degradation",
            "arrow": "activates",
            "cellular_process": "Similar to its homolog RAD23A, ATXN3 directly interacts with the proteasome shuttle protein RAD23B through its Ubiquitin-binding site 2 (UbS2). This binding event protects ATXN3 from proteasomal turnover.",
            "effect_description": "The interaction with RAD23B shields ATXN3 from degradation, thus increasing its stability and cellular protein levels. This function is considered redundant with RAD23A.",
            "biological_consequence": [
              "ATXN3 binds to RAD23B via its UbS2 domain → This interaction prevents ATXN3 from being targeted for proteasomal degradation → Steady-state levels of ATXN3 protein are maintained."
            ],
            "specific_effects": [
              "The interaction is mediated by the Ubiquitin-binding site 2 (UbS2) on ATXN3.",
              "Binding of RAD23B to UbS2 impedes the ubiquitination-independent proteasomal degradation of ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
                "journal": "Nature Communications",
                "year": 2014,
                "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein.",
                "pmid": "25144244"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25144244"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          },
          {
            "function": "Protein Phase Separation",
            "arrow": "inhibits",
            "cellular_process": "ATXN3 is capable of undergoing liquid-liquid phase separation (LLPS), forming protein-rich droplets that can mature into solid, amyloid-like fibrillar aggregates, a hallmark of polyglutamine diseases. RAD23B, a key component of proteasomal condensates, directly interacts with ATXN3.",
            "effect_description": "Through heterotypic interactions, RAD23B inhibits the maturation or 'aging' of ATXN3 liquid droplets. This interaction delays the liquid-to-solid phase transition, thereby preventing the rapid formation of pathological, solid ATXN3 aggregates.",
            "biological_consequence": [
              "ATXN3 undergoes liquid-liquid phase separation to form droplets → RAD23B interacts with ATXN3 within these condensates → The interaction with RAD23B delays the maturation of ATXN3 droplets → The transition to solid, amyloid-like aggregates is slowed."
            ],
            "specific_effects": [
              "RAD23B is a known interactor of ATXN3 that drives the formation of proteasomal condensates.",
              "Heterotypic interactions with RAD23B inhibit the maturation of ATXN3 droplets but do not prevent amyloid formation in dilute conditions."
            ],
            "evidence": [
              {
                "paper_title": "Rad23B Delays Ataxin-3 Liquid-to-solid Phase Transition Through Heterotypic Buffering",
                "journal": "Journal of Molecular Biology",
                "year": 2025,
                "relevant_quote": "Rad23B, the main constituent driving the formation of proteasomal condensates, is a known Ataxin-3 interactor. We found that heterotypic interactions with Rad23B inhibit Ataxin-3 droplet maturation but do not inhibit amyloid formation under dilute conditions, suggesting that Ataxin-3 aggregation via misfolding pathway is distinct from condensation pathway.",
                "pmid": "40684934"
              }
            ],
            "pathway": {
              "name": "Regulation of Protein Phase Separation",
              "canonical_name": "Regulation Of Protein Phase Separation",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "40684934"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' proteasomal degradation via RAD23B is a contextual error and mechanistic opposite. The primary literature shows this interaction *prevents* ATXN3's own degradation. Furthermore, RAD23B has a specific role in regulating the material state of ATXN3.",
        "mechanism": "Similar to its homolog RAD23A, ATXN3 directly interacts with the proteasome shuttle protein RAD23B through its Ubiquitin-binding site 2 (UbS2). This binding event protects ATXN3 from proteasomal turnover. ATXN3 is capable of undergoing liquid-liquid phase separation (LLPS), forming protein-rich droplets that can mature into solid, amyloid-like fibrillar aggregates, a hallmark of polyglutamine diseases. RAD23B, a key component of proteasomal condensates, directly interacts with ATXN3.",
        "effect": "The interaction with RAD23B shields ATXN3 from degradation, thus increasing its stability and cellular protein levels. This function is considered redundant with RAD23A.; Through heterotypic interactions, RAD23B inhibits the maturation or 'aging' of ATXN3 liquid droplets. This interaction delays the liquid-to-solid phase transition, thereby preventing the rapid formation of pathological, solid ATXN3 aggregates.",
        "summary": "ATXN3 inhibits RAD23B to regulate inhibition of atxn3 proteasomal degradation and regulation of protein phase separation, ultimately affecting steady-state levels of atxn3 protein are maintained.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-binding site 2 of ataxin-3 prevents its proteasomal degradation by interacting with Rad23",
            "journal": "Nature Communications",
            "year": 2014,
            "relevant_quote": "Ataxin-3 interacts with the proteasome-associated proteins Rad23A/B through UbS2. Knockdown of Rad23 in cultured cells and in Drosophila results in lower levels of ataxin-3 protein."
          },
          {
            "paper_title": "Rad23B Delays Ataxin-3 Liquid-to-solid Phase Transition Through Heterotypic Buffering",
            "journal": "Journal of Molecular Biology",
            "year": 2025,
            "relevant_quote": "Rad23B, the main constituent driving the formation of proteasomal condensates, is a known Ataxin-3 interactor. We found that heterotypic interactions with Rad23B inhibit Ataxin-3 droplet maturation but do not inhibit amyloid formation under dilute conditions, suggesting that Ataxin-3 aggregation via misfolding pathway is distinct from condensation pathway."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          },
          {
            "name": "Regulation of Protein Phase Separation",
            "canonical_name": "Regulation Of Protein Phase Separation",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 4
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- RAD23B:"
      },
      {
        "primary": "HDAC6",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Surface plasmon resonance (SPR) has provided evidence of a direct binding interaction between ATXN3 and HDAC6. This interaction is implicated in the transport of protein aggregates.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "HDAC6 is a microtubule-associated deacetylase that recognizes and binds polyubiquitinated misfolded proteins, linking them to the dynein motor complex for transport to the microtubule-organizing center (MTOC) to form an aggresome. ATXN3 is a critical component of this pathway.",
            "effect_description": "ATXN3 directly interacts with HDAC6. In one context, ATXN3, HDAC6, and the dynein motor protein form a complex to facilitate the transport of ubiquitinated cargo to the aggresome. ATXN3's deubiquitinase activity is essential for this process. In another context, ATXN3 acts as a deubiquitinase for HDAC6 itself, removing ubiquitin chains from HDAC6, which prevents its degradation and thereby stabilizes it, promoting its function.",
            "biological_consequence": [
              "ATXN3 binds HDAC6 and Dynein → Complex recognizes and binds polyubiquitinated misfolded proteins → Retrograde transport of cargo along microtubules to the MTOC → Aggresome formation → Sequestration and clearance of toxic protein aggregates → Promotion of cell survival under proteotoxic stress.",
              "ATXN3 deubiquitinates HDAC6 → HDAC6 protein is stabilized and degradation is prevented → Increased HDAC6 availability promotes aggresome formation and other cellular functions."
            ],
            "specific_effects": [
              "ATXN3 co-immunoprecipitates with HDAC6 and dynein.",
              "The deubiquitinating activity of ATXN3 is required for efficient aggresome formation.",
              "ATXN3 deubiquitinates HDAC6, leading to its stabilization and reduced degradation.",
              "Knockdown of ATXN3 impairs the formation of aggresomes, a phenotype that can be rescued by ATXN3 overexpression."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "AT3 localizes to aggresomes and preaggresome particles and interacts with dynein and HDAC6, and its DUB activity and UIMs are required for CFTRΔF508 aggresome formation.",
                "pmid": "15767577"
              },
              {
                "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
                "journal": "Pancreatology",
                "year": 2023,
                "relevant_quote": "ATXN3 was proved to interact with HDAC6 and regulate its degradation through deubiquitination. ... This study confirmed that ATXN3 facilitated malignant phenotypes of pancreatic cancer via reducing the ubiquitination of HDAC6.",
                "pmid": "37460341"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "15767577",
              "37460341"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "HDAC6 is a microtubule-associated deacetylase that recognizes and binds polyubiquitinated misfolded proteins, linking them to the dynein motor complex for transport to the microtubule-organizing center (MTOC) to form an aggresome. ATXN3 is a critical component of this pathway.",
        "effect": "ATXN3 directly interacts with HDAC6. In one context, ATXN3, HDAC6, and the dynein motor protein form a complex to facilitate the transport of ubiquitinated cargo to the aggresome. ATXN3's deubiquitinase activity is essential for this process. In another context, ATXN3 acts as a deubiquitinase for HDAC6 itself, removing ubiquitin chains from HDAC6, which prevents its degradation and thereby stabilizes it, promoting its function.",
        "summary": "ATXN3 activates HDAC6 to modulate aggresome formation, ultimately affecting promotion of cell survival under proteotoxic stress.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "AT3 localizes to aggresomes and preaggresome particles and interacts with dynein and HDAC6, and its DUB activity and UIMs are required for CFTRΔF508 aggresome formation."
          },
          {
            "paper_title": "Involvement of Ataxin-3 (ATXN3) in the malignant progression of pancreatic cancer via deubiquitinating HDAC6",
            "journal": "Pancreatology",
            "year": 2023,
            "relevant_quote": "ATXN3 was proved to interact with HDAC6 and regulate its degradation through deubiquitination. ... This study confirmed that ATXN3 facilitated malignant phenotypes of pancreatic cancer via reducing the ubiquitination of HDAC6."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> HDAC6:"
      },
      {
        "primary": "Tubulin",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly binds to tubulin, which is a component of microtubules. This interaction, demonstrated by surface plasmon resonance (SPR), is involved in the cellular machinery that sorts protein aggregates.",
        "functions": [
          {
            "function": "Microtubule-Based Transport",
            "arrow": "activates",
            "cellular_process": "Microtubules, polymers of α/β-tubulin heterodimers, are cytoskeletal filaments that serve as tracks for motor proteins like dynein to transport cellular cargo, including misfolded protein aggregates, to the aggresome.",
            "effect_description": "ATXN3 directly binds to the tubulin dimer with high affinity. This interaction is a key part of the aggresome formation pathway, where ATXN3, along with HDAC6 and dynein, forms a larger complex on the microtubule surface to facilitate the transport of ubiquitinated proteins. ATXN3's multiple binding domains allow it to act as an adaptor, linking components of the transport machinery together on the microtubule tracks.",
            "biological_consequence": [
              "ATXN3 directly binds tubulin dimers → ATXN3 oligomerizes and forms a complex with HDAC6 and dynein on the microtubule surface → The complex recruits polyubiquitinated misfolded proteins → Dynein motor transports the entire complex along microtubule tracks → Cargo is delivered to the MTOC → Aggresome formation and clearance of protein aggregates."
            ],
            "specific_effects": [
              "ATXN3 binds directly to tubulin dimers with a 50 nM affinity, as measured by Surface Plasmon Resonance (SPR).",
              "The interaction involves three distinct tubulin-binding regions (TBRs) on ATXN3: one in the Josephin domain and two in the C-terminal disordered domain.",
              "Small-Angle X-ray Scattering (SAXS) results show an ATXN3 oligomer (6-7 subunits) tightly binding to a tubulin hexameric oligomer in a 'parallel' fashion."
            ],
            "evidence": [
              {
                "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
                "journal": "The International Journal of Biochemistry & Cell Biology",
                "year": 2014,
                "relevant_quote": "By taking advantage of small angle X-ray scattering (SAXS) and surface plasmon resonance (SPR), we have investigated the interaction of AT3 with tubulin and HDAC6. Based on SAXS results, the AT3 oligomer, consisting of 6-7 subunits, tightly binds to the tubulin hexameric oligomer in a \"parallel\" fashion. By SPR analysis we have demonstrated that AT3 binds to tubulin dimer with a 50nM affinity.",
                "pmid": "24685680"
              }
            ],
            "pathway": {
              "name": "Microtubule-Based Transport",
              "canonical_name": "Microtubule-Based Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "24685680"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim of direct interaction is validated. The mechanism involves ATXN3 acting as a molecular bridge within the aggresome transport machinery, linking cargo to the microtubule network, rather than directly modifying tubulin dynamics.",
        "mechanism": "Microtubules, polymers of α/β-tubulin heterodimers, are cytoskeletal filaments that serve as tracks for motor proteins like dynein to transport cellular cargo, including misfolded protein aggregates, to the aggresome.",
        "effect": "ATXN3 directly binds to the tubulin dimer with high affinity. This interaction is a key part of the aggresome formation pathway, where ATXN3, along with HDAC6 and dynein, forms a larger complex on the microtubule surface to facilitate the transport of ubiquitinated proteins. ATXN3's multiple binding domains allow it to act as an adaptor, linking components of the transport machinery together on the microtubule tracks.",
        "summary": "ATXN3 interacts with Tubulin to modulate microtubule-based transport, ultimately affecting aggresome formation and clearance of protein aggregates.",
        "evidence": [
          {
            "paper_title": "Interactions of ataxin-3 with its molecular partners in the protein machinery that sorts protein aggregates to the aggresome",
            "journal": "The International Journal of Biochemistry & Cell Biology",
            "year": 2014,
            "relevant_quote": "By taking advantage of small angle X-ray scattering (SAXS) and surface plasmon resonance (SPR), we have investigated the interaction of AT3 with tubulin and HDAC6. Based on SAXS results, the AT3 oligomer, consisting of 6-7 subunits, tightly binds to the tubulin hexameric oligomer in a \"parallel\" fashion. By SPR analysis we have demonstrated that AT3 binds to tubulin dimer with a 50nM affinity."
          }
        ],
        "pathways": [
          {
            "name": "Microtubule-Based Transport",
            "canonical_name": "Microtubule-Based Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> Tubulin:"
      },
      {
        "primary": "Parkin",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the E3 ligase Parkin, counteracting its auto-ubiquitination and modulating its activity in autophagy.",
        "functions": [
          {
            "function": "E3 Ligase Activity and Mitophagy",
            "arrow": "inhibits",
            "cellular_process": "Parkin is an E3 ubiquitin ligase crucial for mitochondrial quality control via mitophagy. Upon mitochondrial damage, Parkin is recruited and activated, leading to the ubiquitination of mitochondrial outer membrane proteins, flagging the organelle for autophagic clearance. Parkin's activity is regulated by its own auto-ubiquitination.",
            "effect_description": "ATXN3 directly interacts with the E3 ligase Parkin and functions as its deubiquitinase, counteracting Parkin's auto-ubiquitination. By removing ubiquitin chains from Parkin, wild-type ATXN3 stabilizes the E3 ligase and inhibits its activity. Mechanistically, ATXN3 stabilizes the complex between Parkin and its E2 ubiquitin-conjugating enzyme, which impedes the efficient transfer of ubiquitin from the E2 to Parkin, thereby reducing Parkin's E3 ligase activity.",
            "biological_consequence": [
              "ATXN3 binds to Parkin → ATXN3 stabilizes the Parkin-E2 enzyme complex → Transfer of ubiquitin from E2 to Parkin is impeded → Parkin auto-ubiquitination is reduced → Parkin E3 ligase activity is inhibited → Downstream processes like mitophagy are modulated."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with Parkin via multiple domains: Parkin's N-terminal Ub-like (Ubl) domain binds to the UIMs of ATXN3.",
              "ATXN3 deubiquitinates Parkin both in vitro and in cells, counteracting its self-ubiquitination.",
              "ATXN3 does not hydrolyze pre-assembled ubiquitin chains on Parkin but interferes with the attachment of new ubiquitin molecules in real-time.",
              "Mutant (polyQ-expanded) ATXN3, while still able to deubiquitinate Parkin, paradoxically promotes the clearance and degradation of Parkin via the autophagy pathway, leading to reduced Parkin levels."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph disease-associated mutant form of ataxin-3 regulates parkin ubiquitination and stability",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "The interaction between ataxin-3 and parkin is direct, involves multiple domains and is greatly enhanced by parkin self-ubiquitination. Moreover, ataxin-3 deubiquitinates parkin directly in vitro and in cells. ... Remarkably, mutant but not wild-type ataxin-3 promotes the clearance of parkin via the autophagy pathway.",
                "pmid": "20940148"
              },
              {
                "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
                "journal": "The Journal of Biological Chemistry",
                "year": 2012,
                "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub.",
                "pmid": "22081612"
              }
            ],
            "pathway": {
              "name": "Mitophagy",
              "canonical_name": "Mitophagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "20940148",
              "22081612"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Parkin is an E3 ubiquitin ligase crucial for mitochondrial quality control via mitophagy. Upon mitochondrial damage, Parkin is recruited and activated, leading to the ubiquitination of mitochondrial outer membrane proteins, flagging the organelle for autophagic clearance. Parkin's activity is regulated by its own auto-ubiquitination.",
        "effect": "ATXN3 directly interacts with the E3 ligase Parkin and functions as its deubiquitinase, counteracting Parkin's auto-ubiquitination. By removing ubiquitin chains from Parkin, wild-type ATXN3 stabilizes the E3 ligase and inhibits its activity. Mechanistically, ATXN3 stabilizes the complex between Parkin and its E2 ubiquitin-conjugating enzyme, which impedes the efficient transfer of ubiquitin from the E2 to Parkin, thereby reducing Parkin's E3 ligase activity.",
        "summary": "ATXN3 inhibits Parkin to modulate regulation of e3 ligase activity and mitophagy, ultimately affecting downstream processes like mitophagy are modulated.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph disease-associated mutant form of ataxin-3 regulates parkin ubiquitination and stability",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "The interaction between ataxin-3 and parkin is direct, involves multiple domains and is greatly enhanced by parkin self-ubiquitination. Moreover, ataxin-3 deubiquitinates parkin directly in vitro and in cells. ... Remarkably, mutant but not wild-type ataxin-3 promotes the clearance of parkin via the autophagy pathway."
          },
          {
            "paper_title": "Ataxin-3 deubiquitination is coupled to Parkin ubiquitination via E2 ubiquitin-conjugating enzyme",
            "journal": "The Journal of Biological Chemistry",
            "year": 2012,
            "relevant_quote": "We report here that ataxin-3 interferes with the attachment of ubiquitin (Ub) onto parkin in real-time during conjugation but is unable to hydrolyze previously assembled parkin-Ub conjugates. The mechanism involves an ataxin-3-dependent stabilization of the complex between parkin and the E2 Ub-conjugating enzyme, which impedes the efficient charging of the E2 with Ub."
          }
        ],
        "pathways": [
          {
            "name": "Mitophagy",
            "canonical_name": "Mitophagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> Parkin:"
      },
      {
        "primary": "Beclin-1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with Beclin-1 (BECN1), removing its ubiquitin chains, which leads to its stabilization and the stimulation of autophagy.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "Beclin-1 is a core component of the Class III PI3K complex (PI3KC3-C1), which is essential for initiating autophagy. The process begins with the formation of a phagophore, a double-membraned structure that engulfs cellular components destined for degradation.",
            "effect_description": "ATXN3 directly interacts with Beclin-1 and functions as a deubiquitinase, removing ubiquitin chains that would otherwise target Beclin-1 for proteasomal degradation. This stabilization of Beclin-1 enhances its activity within the PI3KC3-C1 complex, thereby promoting the initiation of autophagy.",
            "biological_consequence": [
              "ATXN3 binds to Beclin-1 via its polyQ domain → ATXN3's deubiquitinase activity removes ubiquitin chains from Beclin-1 → Beclin-1 is protected from proteasome-mediated degradation → Stabilized Beclin-1 promotes PI3KC3-C1 complex activity → Autophagosome nucleation is stimulated → Autophagic flux is increased for cellular clearance."
            ],
            "specific_effects": [
              "ATXN3's polyQ domain is required for the interaction with Beclin-1.",
              "ATXN3 deubiquitinates and stabilizes Beclin-1, protecting it from proteasomal degradation.",
              "Depletion of ATXN3 leads to reduced Beclin-1 levels and impaired starvation-induced autophagy.",
              "In Machado-Joseph disease models, Beclin-1 levels are decreased.",
              "Overexpression of Beclin-1 can enhance the clearance of mutant, aggregated ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
                "journal": "Nature",
                "year": 2017,
                "relevant_quote": "Here we show that the polyQ domain enables wild-type ataxin 3 to interact with beclin 1, a key initiator of autophagy. This interaction allows the deubiquitinase activity of ataxin 3 to protect beclin 1 from proteasome-mediated degradation and thereby enables autophagy.",
                "pmid": "28445460"
              },
              {
                "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
                "journal": "Brain",
                "year": 2012,
                "relevant_quote": "Using tissue from patients with Machado-Joseph disease, transgenic mice and a lentiviral-based rat model, we found an abnormal expression of endogenous autophagic markers, accumulation of autophagosomes and decreased levels of beclin-1, a crucial protein in the early nucleation step of autophagy. Lentiviral vector-mediated overexpression of beclin-1 led to stimulation of autophagic flux, mutant ataxin-3 clearance and overall neuroprotective effects...",
                "pmid": "21478185"
              }
            ],
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28445460",
              "21478185"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Beclin-1 is a core component of the Class III PI3K complex (PI3KC3-C1), which is essential for initiating autophagy. The process begins with the formation of a phagophore, a double-membraned structure that engulfs cellular components destined for degradation.",
        "effect": "ATXN3 directly interacts with Beclin-1 and functions as a deubiquitinase, removing ubiquitin chains that would otherwise target Beclin-1 for proteasomal degradation. This stabilization of Beclin-1 enhances its activity within the PI3KC3-C1 complex, thereby promoting the initiation of autophagy.",
        "summary": "ATXN3 activates Beclin-1 to modulate autophagy activation, ultimately affecting autophagic flux is increased for cellular clearance.",
        "evidence": [
          {
            "paper_title": "Polyglutamine tracts regulate beclin 1-dependent autophagy",
            "journal": "Nature",
            "year": 2017,
            "relevant_quote": "Here we show that the polyQ domain enables wild-type ataxin 3 to interact with beclin 1, a key initiator of autophagy. This interaction allows the deubiquitinase activity of ataxin 3 to protect beclin 1 from proteasome-mediated degradation and thereby enables autophagy."
          },
          {
            "paper_title": "Overexpression of the autophagic beclin-1 protein clears mutant ataxin-3 and alleviates Machado-Joseph disease",
            "journal": "Brain",
            "year": 2012,
            "relevant_quote": "Using tissue from patients with Machado-Joseph disease, transgenic mice and a lentiviral-based rat model, we found an abnormal expression of endogenous autophagic markers, accumulation of autophagosomes and decreased levels of beclin-1, a crucial protein in the early nucleation step of autophagy. Lentiviral vector-mediated overexpression of beclin-1 led to stimulation of autophagic flux, mutant ataxin-3 clearance and overall neuroprotective effects..."
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> Beclin-1:"
      },
      {
        "primary": "p53",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with and stabilizes the tumor suppressor p53 by removing polyubiquitin chains, which has implications for DNA repair and apoptosis.",
        "functions": [
          {
            "function": "p53 Protein Stabilization and Apoptotic Function",
            "arrow": "activates",
            "cellular_process": "The tumor suppressor p53 is a transcription factor that responds to cellular stress, such as DNA damage. Its stability is tightly controlled by E3 ubiquitin ligases like Mdm2, which target p53 for degradation by the ubiquitin-proteasome system. Stabilized p53 activates genes involved in cell cycle arrest, DNA repair, and apoptosis.",
            "effect_description": "ATXN3 directly binds to p53 and removes polyubiquitin chains, functioning as a p53 deubiquitinase (DUB). This action prevents p53 from being degraded by the proteasome, leading to increased p53 protein levels, enhanced transcriptional activity, and promotion of p53-dependent apoptosis.",
            "biological_consequence": [
              "ATXN3 binds to native and polyubiquitinated p53 → ATXN3 removes polyubiquitin chains from p53 → p53 degradation via the ubiquitin-proteasome pathway is inhibited → p53 protein levels increase → p53-dependent transcription of target genes (e.g., for apoptosis) is enhanced → Cell cycle arrest or apoptosis is induced."
            ],
            "specific_effects": [
              "ATXN3 directly binds, deubiquitinates, and stabilizes p53.",
              "ATXN3 deletion leads to p53 destabilization and reduced p53 activity.",
              "ATXN3 promotes p53-dependent apoptosis in both cell and in vivo zebrafish models.",
              "PolyQ-expanded ATXN3 exhibits enhanced interaction and deubiquitination activity towards p53, causing more severe p53-dependent neurodegeneration."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Biology",
                "year": 2016,
                "relevant_quote": "ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis in both mammalian cells and the central nervous system of zebrafish.",
                "pmid": "27851749"
              },
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "On the other hand, ATXN3-PolyQ inhibits PNKP-dependent DNA repair and prolongs p53-signaling through enhanced p53-binding and stabilization. This leads to increased activation of pro-apoptotic pathways and cell vulnerability to DNA damage.",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Apoptosis",
              "canonical_name": "Apoptosis",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "27851749",
              "39320846"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "The tumor suppressor p53 is a transcription factor that responds to cellular stress, such as DNA damage. Its stability is tightly controlled by E3 ubiquitin ligases like Mdm2, which target p53 for degradation by the ubiquitin-proteasome system. Stabilized p53 activates genes involved in cell cycle arrest, DNA repair, and apoptosis.",
        "effect": "ATXN3 directly binds to p53 and removes polyubiquitin chains, functioning as a p53 deubiquitinase (DUB). This action prevents p53 from being degraded by the proteasome, leading to increased p53 protein levels, enhanced transcriptional activity, and promotion of p53-dependent apoptosis.",
        "summary": "ATXN3 activates p53 to modulate p53 protein stabilization and apoptotic function, ultimately affecting cell cycle arrest or apoptosis is induced.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Biology",
            "year": 2016,
            "relevant_quote": "ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway. ATX-3 deletion destabilizes p53, resulting in deficiency of p53 activity and functions, whereas ectopic expression of ATX-3 induces selective transcription/expression of p53 target genes and promotes p53-dependent apoptosis in both mammalian cells and the central nervous system of zebrafish."
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "On the other hand, ATXN3-PolyQ inhibits PNKP-dependent DNA repair and prolongs p53-signaling through enhanced p53-binding and stabilization. This leads to increased activation of pro-apoptotic pathways and cell vulnerability to DNA damage."
          }
        ],
        "pathways": [
          {
            "name": "Apoptosis",
            "canonical_name": "Apoptosis",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> p53:"
      },
      {
        "primary": "HDAC3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with HDAC3, recruiting it to chromatin to regulate chromatin structure, DNA replication, and transcription.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Histone deacetylase 3 (HDAC3) is an enzyme that removes acetyl groups from histone proteins. This deacetylation leads to chromatin condensation, making the DNA less accessible to transcription factors and resulting in the repression of gene expression.",
            "effect_description": "Normal ATXN3 binds to specific gene promoters (e.g., MMP-2) and recruits a corepressor complex containing HDAC3 and NCoR. This recruitment facilitates local histone deacetylation, chromatin condensation, and transcriptional repression of the target gene. The ubiquitin-interacting motifs (UIMs) of ATXN3 are required for this repressive function.",
            "biological_consequence": [
              "Normal ATXN3 binds to a target gene promoter → ATXN3 recruits HDAC3 and the NCoR corepressor → The complex increases local histone deacetylase activity → Histones at the promoter are deacetylated → Chromatin condenses → Transcription of the target gene is repressed."
            ],
            "specific_effects": [
              "Normal ATXN3 binds to the MMP-2 gene promoter and represses its transcription by recruiting HDAC3 and NCoR.",
              "The interaction requires ATXN3's ubiquitin-interacting motifs (UIMs) to form the repressive complex.",
              "ATXN3 controls the subcellular localization of HDAC3, and its absence decreases HDAC3 recruitment to chromatin.",
              "PolyQ-expanded ATXN3 loses the ability to form these deacetylating repressor complexes, leading to aberrant gene expression."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              },
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3.",
                "pmid": "36971114"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677",
              "36971114"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          },
          {
            "function": "HDAC3 Protein Stabilization",
            "arrow": "activates",
            "cellular_process": "Protein stability is often regulated by ubiquitination, which can target proteins for proteasomal degradation. Deubiquitinases (DUBs) can reverse this process, thereby increasing the half-life of a protein.",
            "effect_description": "In the context of the type I interferon (IFN-I) antiviral response, ATXN3 physically interacts with and deubiquitinates HDAC3. This action enhances the protein stability of HDAC3, leading to its accumulation and potentiation of the IFN-I-mediated signaling pathway.",
            "biological_consequence": [
              "Viral infection increases ATXN3-HDAC3 interaction → ATXN3 deubiquitinates HDAC3 → HDAC3 protein stability is enhanced → Increased HDAC3 levels promote IFN-I-induced signaling → The cellular antiviral response is potentiated."
            ],
            "specific_effects": [
              "ATXN3 physically interacts with HDAC3 and upregulates its protein level.",
              "ATXN3 deubiquitinates HDAC3, leading to enhanced protein stability.",
              "The ATXN3/HDAC3 axis positively regulates the type I IFN antiviral response."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
                "journal": "The Journal of Immunology",
                "year": 2018,
                "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability.",
                "pmid": "29802126"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "29802126"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim correctly identifies the interaction but uses a potentially confusing 'activates' arrow. The mechanism is clarified: ATXN3 *activates* the recruitment of HDAC3 to form a repressive complex, which in turn *inhibits* gene transcription. The interaction is multifaceted, as other studies show ATXN3 can also stabilize HDAC3 via deubiquitination in different contexts.",
        "mechanism": "Histone deacetylase 3 (HDAC3) is an enzyme that removes acetyl groups from histone proteins. This deacetylation leads to chromatin condensation, making the DNA less accessible to transcription factors and resulting in the repression of gene expression. Protein stability is often regulated by ubiquitination, which can target proteins for proteasomal degradation. Deubiquitinases (DUBs) can reverse this process, thereby increasing the half-life of a protein.",
        "effect": "Normal ATXN3 binds to specific gene promoters (e.g., MMP-2) and recruits a corepressor complex containing HDAC3 and NCoR. This recruitment facilitates local histone deacetylation, chromatin condensation, and transcriptional repression of the target gene. The ubiquitin-interacting motifs (UIMs) of ATXN3 are required for this repressive function.; In the context of the type I interferon (IFN-I) antiviral response, ATXN3 physically interacts with and deubiquitinates HDAC3. This action enhances the protein stability of HDAC3, leading to its accumulation and potentiation of the IFN-I-mediated signaling pathway.",
        "summary": "ATXN3 activates HDAC3 to regulate transcriptional repression and hdac3 protein stabilization, ultimately affecting transcription of the target gene is repressed.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          },
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The absence of ATXN3 decreases the recruitment of endogenous HDAC3 to the chromatin, as well as the HDAC3 nuclear/cytoplasm ratio after HDAC3 overexpression, suggesting that ATXN3 controls the subcellular localization of HDAC3."
          },
          {
            "paper_title": "ATXN3 Positively Regulates Type I IFN Antiviral Response by Deubiquitinating and Stabilizing HDAC3",
            "journal": "The Journal of Immunology",
            "year": 2018,
            "relevant_quote": "Furthermore, ATXN3 physically interacts with histone deacetylase 3 (HDAC3) and upregulates the level of HDAC3 protein. Moreover, ATXN3 deubiquitinates HDAC3, thereby enhancing HDAC3 protein stability."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          },
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> HDAC3:"
      },
      {
        "primary": "CBP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation experiments have shown that ATXN3 interacts with the transcriptional coactivator CBP (CREB-binding protein).",
        "functions": [
          {
            "function": "Transcriptional Co-activator",
            "arrow": "activates",
            "cellular_process": "CREB-binding protein (CBP) is a transcriptional co-activator possessing intrinsic histone acetyltransferase (HAT) activity. By acetylating histone tails, CBP relaxes chromatin structure, making DNA more accessible for transcription machinery and thereby activating gene expression.",
            "effect_description": "ATXN3 acts as a transcriptional co-repressor by directly interacting with and inhibiting the function of CBP. The C-terminal region of ATXN3 binds to CBP, while the N-terminal Josephin domain is responsible for inhibiting CBP's HAT activity, leading to a decrease in histone acetylation and subsequent repression of target gene transcription.",
            "biological_consequence": [
              "ATXN3 C-terminal domain binds to CBP → ATXN3 N-terminal domain sterically hinders CBP's access to histone substrates → Inhibition of CBP's histone acetyltransferase (HAT) activity → Decreased local histone acetylation → Chromatin remains in a condensed state → Repression of transcription of CBP target genes."
            ],
            "specific_effects": [
              "The C-terminal, polyglutamine-containing domain of ATXN3 is required for binding to CBP.",
              "The N-terminal domain of ATXN3 directly inhibits the histone acetyltransferase activity of CBP's paralog, p300, in vitro, suggesting a similar mechanism for CBP.",
              "Endogenous ATXN3 co-immunoprecipitates with CBP in non-transfected cells, confirming the interaction occurs under physiological conditions."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The initial claim that ATXN3 represses CBP's transcriptional activity is correct. However, the mechanism is more complex than simple binding. ATXN3 employs a two-pronged approach: the C-terminal domain of ATXN3 is responsible for binding to CBP, while the N-terminal domain independently inhibits histone acetylation by sterically blocking CBP's access to histone tails. This is a direct inhibition of CBP's enzymatic function, leading to transcriptional repression.",
        "mechanism": "CREB-binding protein (CBP) is a transcriptional co-activator possessing intrinsic histone acetyltransferase (HAT) activity. By acetylating histone tails, CBP relaxes chromatin structure, making DNA more accessible for transcription machinery and thereby activating gene expression.",
        "effect": "ATXN3 acts as a transcriptional co-repressor by directly interacting with and inhibiting the function of CBP. The C-terminal region of ATXN3 binds to CBP, while the N-terminal Josephin domain is responsible for inhibiting CBP's HAT activity, leading to a decrease in histone acetylation and subsequent repression of target gene transcription.",
        "summary": "ATXN3 inhibits CBP to modulate transcriptional co-activator inhibition, ultimately affecting repression of transcription of cbp target genes.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "In the present study we use cell transfections, in vitro binding, co-immunoprecipitations, and reporter assays to show that the polyglutamine disease protein, ataxin-3, interacts with the major histone acetyltransferases cAMP-response-element binding protein (CREB)-binding protein, p300, and p300/CREB-binding protein-associated factor and inhibits transcription by these coactivators."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> CBP:"
      },
      {
        "primary": "p300",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 has been shown to interact with the transcriptional coactivator p300, which has histone acetyltransferase (HAT) activity.",
        "functions": [
          {
            "function": "Transcriptional Co-activator",
            "arrow": "activates",
            "cellular_process": "p300 is a transcriptional co-activator and histone acetyltransferase (HAT) that plays a crucial role in activating gene expression by acetylating histones, which decondenses chromatin and facilitates transcription factor binding.",
            "effect_description": "ATXN3 represses p300-mediated transcription through two distinct activities. Its C-terminal domain binds to p300, and its N-terminal domain directly inhibits the HAT activity of p300. This inhibition appears to be caused by ATXN3 binding to histones and sterically preventing p300 from accessing its acetylation sites.",
            "biological_consequence": [
              "ATXN3 C-terminus binds to the p300 co-activator → ATXN3 N-terminus binds to histones → Steric hindrance prevents p300 from accessing acetylation sites on histone tails → Direct inhibition of p300 HAT activity → Reduced histone acetylation at target promoters → Transcriptional repression."
            ],
            "specific_effects": [
              "The C-terminal domain of ATXN3, which contains the polyglutamine tract, is required for binding to p300 and inhibiting coactivator-dependent transcription.",
              "The N-terminal domain of ATXN3 is sufficient to inhibit histone acetylation by p300 in vitro.",
              "The mechanism of HAT inhibition involves blocking the access of coactivators to their acetylation sites on histones."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
                "journal": "The Journal of Biological Chemistry",
                "year": 2002,
                "relevant_quote": "The N-terminal domain of ataxin-3 inhibits histone acetylation by p300 in vitro and inhibits transcription in vivo. Histone binding and blocking access of coactivators to acetylation sites on histones appears to be the mechanism of inhibition.",
                "pmid": "12297501"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "12297501"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is validated. ATXN3 functions as a direct transcriptional repressor of p300 through a bimodal mechanism. The C-terminus of ATXN3 mediates the physical interaction with p300, while the N-terminal domain is responsible for directly inhibiting p300's histone acetyltransferase (HAT) activity by blocking its access to histone substrates.",
        "mechanism": "p300 is a transcriptional co-activator and histone acetyltransferase (HAT) that plays a crucial role in activating gene expression by acetylating histones, which decondenses chromatin and facilitates transcription factor binding.",
        "effect": "ATXN3 represses p300-mediated transcription through two distinct activities. Its C-terminal domain binds to p300, and its N-terminal domain directly inhibits the HAT activity of p300. This inhibition appears to be caused by ATXN3 binding to histones and sterically preventing p300 from accessing its acetylation sites.",
        "summary": "ATXN3 inhibits p300 to modulate transcriptional co-activator inhibition, ultimately affecting transcriptional repression.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 is a histone-binding protein with two independent transcriptional corepressor activities",
            "journal": "The Journal of Biological Chemistry",
            "year": 2002,
            "relevant_quote": "The N-terminal domain of ataxin-3 inhibits histone acetylation by p300 in vitro and inhibits transcription in vivo. Histone binding and blocking access of coactivators to acetylation sites on histones appears to be the mechanism of inhibition."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> p300:"
      },
      {
        "primary": "YAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Co-immunoprecipitation and in vitro pulldown assays confirm a direct interaction between ATXN3 and YAP, where ATXN3 deubiquitinates and stabilizes YAP.",
        "functions": [
          {
            "function": "YAP Protein Stabilization",
            "arrow": "activates",
            "cellular_process": "Yes-associated protein (YAP) is a transcriptional co-activator and the primary downstream effector of the Hippo signaling pathway. Its activity is tightly controlled by its stability, which is negatively regulated by the ubiquitin-proteasome system. Polyubiquitination, particularly with K48-linked chains, targets YAP for degradation, thus suppressing its pro-proliferative and anti-apoptotic functions.",
            "effect_description": "ATXN3 functions as a bona fide deubiquitinase (DUB) for YAP. It directly interacts with YAP and removes K48-linked polyubiquitin chains, thereby protecting YAP from proteasomal degradation. This stabilization increases YAP protein abundance, leading to its accumulation and enhanced transcriptional co-activator function in the nucleus.",
            "biological_consequence": [
              "ATXN3 directly binds to the WW domains of YAP → ATXN3's deubiquitinase activity removes K48-linked polyubiquitin chains from YAP → Prevention of YAP recognition by the proteasome → Increased YAP protein half-life and stability → Enhanced nuclear localization and accumulation of YAP → Increased formation of YAP/TEAD transcriptional complexes → Upregulation of target genes (e.g., CTGF, CYR61) → Promotion of cell proliferation, migration, and tumor growth."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with, deubiquitinates, and stabilizes YAP in a manner dependent on its deubiquitinase activity.",
              "ATXN3 specifically removes K48-linked polyubiquitin chains from YAP, protecting it from degradation.",
              "Depletion of ATXN3 leads to decreased YAP protein levels and reduced expression of YAP target genes, such as CTGF and CYR61.",
              "The interaction is mediated by ATXN3 binding to the WW domains of YAP."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
                "journal": "Cell Communication and Signaling",
                "year": 2023,
                "relevant_quote": "Our results suggested that ATXN3 promotes prostate cancer progression by regulating YAP. As shown in Fig. 6A-G, reconstitution of YAP efficiently rescued the suppressive effects induced by ATXN3 depletion.",
                "pmid": "37349820"
              }
            ],
            "pathway": {
              "name": "Hippo Signaling Pathway",
              "canonical_name": "Hippo Signaling",
              "ontology_id": "hsa04390",
              "ontology_source": "KEGG",
              "confidence": 0.8
            },
            "pmids": [
              "37349820"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Yes-associated protein (YAP) is a transcriptional co-activator and the primary downstream effector of the Hippo signaling pathway. Its activity is tightly controlled by its stability, which is negatively regulated by the ubiquitin-proteasome system. Polyubiquitination, particularly with K48-linked chains, targets YAP for degradation, thus suppressing its pro-proliferative and anti-apoptotic functions.",
        "effect": "ATXN3 functions as a bona fide deubiquitinase (DUB) for YAP. It directly interacts with YAP and removes K48-linked polyubiquitin chains, thereby protecting YAP from proteasomal degradation. This stabilization increases YAP protein abundance, leading to its accumulation and enhanced transcriptional co-activator function in the nucleus.",
        "summary": "ATXN3 activates YAP to modulate yap protein stabilization, ultimately affecting promotion of cell proliferation, migration, and tumor growth.",
        "evidence": [
          {
            "paper_title": "ATXN3 deubiquitinates YAP1 to promote tumor growth and metastasis in breast cancer",
            "journal": "American Journal of Cancer Research",
            "year": 2023,
            "relevant_quote": "At the molecular level, ATNX3 interacts with the WW domains of YAP1 to protect YAP1 from ubiquitination-mediated degradation. Immunohistology analysis revealed a strong positive correlation between ATXN3 and YAP1 protein expression in human breast and pancreatic cancers. Collectively, our study defines ATXN3 as a previously unknown YAP1 deubiquitinase in tumorigenesis..."
          },
          {
            "paper_title": "ATXN3 promotes prostate cancer progression by stabilizing YAP",
            "journal": "Cell Communication and Signaling",
            "year": 2023,
            "relevant_quote": "Our results suggested that ATXN3 promotes prostate cancer progression by regulating YAP. As shown in Fig. 6A-G, reconstitution of YAP efficiently rescued the suppressive effects induced by ATXN3 depletion."
          }
        ],
        "pathways": [
          {
            "name": "Hippo Signaling Pathway",
            "canonical_name": "Hippo Signaling",
            "ontology_id": "hsa04390",
            "ontology_source": "KEGG",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> YAP:"
      },
      {
        "primary": "NCoR",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the nuclear corepressor NCoR, and this interaction is implicated in transcriptional regulation.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "Nuclear receptor corepressor (NCoR) is a key component of transcriptional corepressor complexes that include histone deacetylases (HDACs). These complexes are recruited to specific gene promoters by DNA-binding transcription factors to mediate gene silencing.",
            "effect_description": "ATXN3 forms a repressor complex with NCoR and HDAC3. ATXN3 recruits this complex to target gene promoters, such as the MMP-2 promoter, leading to histone deacetylation and transcriptional repression.",
            "biological_consequence": [
              "Recruitment of NCoR/HDAC3 complex to promoters → Histone deacetylation → Chromatin condensation → Repression of target gene transcription"
            ],
            "specific_effects": [
              "Normal ATXN3 interacts with both NCoR and HDAC3 in cell models and human brain tissue.",
              "ATXN3 binds to the MMP-2 gene promoter and represses its transcription by recruiting NCoR and HDAC3.",
              "The ATXN3-containing repressor complex exhibits histone deacetylase activity.",
              "Expanded ATXN3 loses the ability to form these deacetylating repressor complexes, leading to aberrant gene expression."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "year": 2006,
                "pmid": "17079677"
              },
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "year": 2018,
                "pmid": "30231063"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677",
              "30231063"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "Nuclear receptor corepressor (NCoR) is a key component of transcriptional corepressor complexes that include histone deacetylases (HDACs). These complexes are recruited to specific gene promoters by DNA-binding transcription factors to mediate gene silencing.",
        "effect": "ATXN3 forms a repressor complex with NCoR and HDAC3. ATXN3 recruits this complex to target gene promoters, such as the MMP-2 promoter, leading to histone deacetylation and transcriptional repression.",
        "summary": "ATXN3 activates NCoR to modulate transcriptional repression, ultimately affecting repression of target gene transcription.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "year": 2006
          },
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "year": 2018
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binds",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> NCoR:"
      },
      {
        "primary": "LC3C",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with LC3C in the early stages of autophagy, promoting this cellular degradation process.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "LC3C (MAP1LC3C) is a member of the ATG8 family of proteins, which are central to autophagy. Upon autophagy induction, LC3 is lipidated and incorporated into the membranes of forming autophagosomes, where it functions in cargo recognition and vesicle closure.",
            "effect_description": "ATXN3 interacts with ATG8 family members, including LC3C, during the early stages of autophagy. This interaction is thought to facilitate the initiation and progression of autophagosome formation, thereby promoting the clearance of cellular waste.",
            "biological_consequence": [
              "Interaction with LC3C → Promotion of autophagosome formation → Sequestration of cytoplasmic cargo → Cellular clearance and homeostasis"
            ],
            "specific_effects": [
              "ATXN3 interacts with members of the ATG8 family (LC3/GABARAP) to promote the early steps of autophagy."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "LC3C (MAP1LC3C) is a member of the ATG8 family of proteins, which are central to autophagy. Upon autophagy induction, LC3 is lipidated and incorporated into the membranes of forming autophagosomes, where it functions in cargo recognition and vesicle closure.",
        "effect": "ATXN3 interacts with ATG8 family members, including LC3C, during the early stages of autophagy. This interaction is thought to facilitate the initiation and progression of autophagosome formation, thereby promoting the clearance of cellular waste.",
        "summary": "ATXN3 activates LC3C to modulate autophagy, ultimately affecting cellular clearance and homeostasis.",
        "evidence": [
          {
            "paper_title": "The deubiquitinase ataxin-3 mediates the VCP-dependent degradation of misfolded proteins of the endoplasmic reticulum",
            "year": 2012
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> LC3C:"
      },
      {
        "primary": "GABARAP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with GABARAP, a key protein in the autophagy pathway, to promote the early stages of autophagy.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "GABARAP is a member of the ATG8 family of ubiquitin-like proteins that are conjugated to phosphatidylethanolamine (PE) and incorporated into the autophagosomal membrane. It plays a crucial role in autophagosome maturation and closure.",
            "effect_description": "ATXN3 interacts with GABARAP, an ATG8 family protein, to facilitate the early steps of autophagy. This interaction likely helps in the recruitment of components to the phagophore or in the expansion and closure of the autophagosome.",
            "biological_consequence": [
              "Interaction with GABARAP → Promotion of autophagosome maturation → Cellular degradation of substrates → Maintenance of proteostasis"
            ],
            "specific_effects": [
              "ATXN3 interacts with ATG8 family members (LC3/GABARAP) to promote the early steps of autophagy."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "GABARAP is a member of the ATG8 family of ubiquitin-like proteins that are conjugated to phosphatidylethanolamine (PE) and incorporated into the autophagosomal membrane. It plays a crucial role in autophagosome maturation and closure.",
        "effect": "ATXN3 interacts with GABARAP, an ATG8 family protein, to facilitate the early steps of autophagy. This interaction likely helps in the recruitment of components to the phagophore or in the expansion and closure of the autophagosome.",
        "summary": "ATXN3 activates GABARAP to modulate autophagy, ultimately affecting maintenance of proteostasis.",
        "evidence": [
          {
            "paper_title": "The deubiquitinase ataxin-3 mediates the VCP-dependent degradation of misfolded proteins of the endoplasmic reticulum",
            "year": 2012
          },
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> GABARAP:"
      },
      {
        "primary": "PNKP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The association between ATXN3 and PNKP promotes the 3' phosphatase activity of PNKP, which is involved in single-strand break repair.",
        "functions": [
          {
            "function": "DNA Single-Strand Break Repair",
            "arrow": "regulates",
            "cellular_process": "Polynucleotide kinase 3'-phosphatase (PNKP) is a dual-function enzyme critical for repairing DNA single-strand breaks (SSBs) and double-strand breaks (DSBs). It possesses 5'-kinase and 3'-phosphatase activities that process damaged DNA termini, making them suitable for ligation.",
            "effect_description": "Wild-type ATXN3 directly interacts with PNKP and stimulates its 3'-phosphatase activity, which is essential for efficient DNA strand break repair. This interaction helps maintain genomic stability. Conversely, mutant ATXN3, which causes Spinocerebellar Ataxia Type 3 (SCA3), also binds to PNKP but inhibits its enzymatic activity. This leads to the accumulation of DNA damage and triggers pro-apoptotic signaling.",
            "biological_consequence": [
              "Wild-Type ATXN3 binds to PNKP → Stimulation of PNKP's 3'-phosphatase activity → Efficient processing and repair of DNA strand breaks → Maintenance of genomic integrity and neuronal survival.",
              "Mutant (polyQ-expanded) ATXN3 binds to PNKP → Inhibition of PNKP's 3'-phosphatase activity → Accumulation of unrepaired DNA strand breaks → Chronic activation of the ATM kinase-dependent DNA damage response → p53-dependent apoptosis → Neurodegeneration in SCA3."
            ],
            "specific_effects": [
              "Wild-type ATXN3 interacts with and stimulates the 3'-phosphatase activity of PNKP.",
              "Cells deficient in ATXN3 show decreased PNKP activity and an associated increase in DNA strand breaks.",
              "Mutant ATXN3 (containing a polyglutamine expansion) physically interacts with and inactivates PNKP.",
              "The inactivation of PNKP by mutant ATXN3 leads to persistent DNA damage, chronic activation of the ATM signaling pathway, and ultimately apoptosis."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "Collectively, these data, together with the data presented in the accompanying manuscript by Chatterjee et al, suggest that the wild-type ATXN3 interacts with and stimulates PNKP’s 3’-phosphatase activity, and this interaction possibly modulates the efficacy of DNA repair, and helps maintain genomic integrity and neuronal survival. In contrast, mutant ATXN3 interacts with PNKP and abrogates its 3’-phosphatase activity, resulting in increased accumulation of DNA damage that chronically activates ATM→p53 and ATM→c-Abl→PKCδ pro-apoptotic signaling to trigger neuronal dysfunction and apoptosis in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Polynucleotide kinase 3'-phosphatase (PNKP) is a dual-function enzyme critical for repairing DNA single-strand breaks (SSBs) and double-strand breaks (DSBs). It possesses 5'-kinase and 3'-phosphatase activities that process damaged DNA termini, making them suitable for ligation.",
        "effect": "Wild-type ATXN3 directly interacts with PNKP and stimulates its 3'-phosphatase activity, which is essential for efficient DNA strand break repair. This interaction helps maintain genomic stability. Conversely, mutant ATXN3, which causes Spinocerebellar Ataxia Type 3 (SCA3), also binds to PNKP but inhibits its enzymatic activity. This leads to the accumulation of DNA damage and triggers pro-apoptotic signaling.",
        "summary": "ATXN3 activates PNKP to modulate dna single-strand break repair, ultimately affecting maintenance of genomic integrity and neuronal survival.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "Collectively, these data, together with the data presented in the accompanying manuscript by Chatterjee et al, suggest that the wild-type ATXN3 interacts with and stimulates PNKP’s 3’-phosphatase activity, and this interaction possibly modulates the efficacy of DNA repair, and helps maintain genomic integrity and neuronal survival. In contrast, mutant ATXN3 interacts with PNKP and abrogates its 3’-phosphatase activity, resulting in increased accumulation of DNA damage that chronically activates ATM→p53 and ATM→c-Abl→PKCδ pro-apoptotic signaling to trigger neuronal dysfunction and apoptosis in SCA3."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> PNKP:"
      },
      {
        "primary": "Chk1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with Chk1 and antagonizes its polyubiquitination and degradation, thereby facilitating DNA damage checkpoints and repair.",
        "functions": [
          {
            "function": "Chk1 Protein Stability and DNA Damage Checkpoint",
            "arrow": "activates",
            "cellular_process": "Checkpoint kinase 1 (Chk1) is a key serine/threonine kinase in the DNA damage response (DDR). Its stability is regulated by polyubiquitination and proteasomal degradation, which is crucial for activating and terminating DNA damage checkpoints.",
            "effect_description": "ATXN3 functions as a deubiquitinase (DUB) for Chk1. By binding to Chk1, ATXN3 removes polyubiquitin chains that are added by E3 ligase complexes, such as DDB1/CUL4A and FBXO6/CUL1. This action protects Chk1 from degradation by the proteasome, thereby maintaining its steady-state levels and ensuring a robust DNA damage checkpoint response.",
            "biological_consequence": [
              "ATXN3 binds to Chk1 → Removes polyubiquitin chains from Chk1 → Prevents proteasomal degradation of Chk1 → Increased Chk1 protein stability and half-life → Robust G2/M checkpoint signaling upon DNA damage → Facilitation of DNA repair and maintenance of genome integrity."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with and deubiquitinates Chk1, thereby prolonging its protein half-life.",
              "ATXN3 protects Chk1 from polyubiquitination mediated by DDB1/CUL4A and FBXO6/CUL1 E3 ligase complexes under both normal conditions and in response to DNA damage.",
              "Depletion of ATXN3 leads to a significant reduction in Chk1 protein levels, a compromised G2/M DNA damage checkpoint, and increased sensitivity to replication stress."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
                "journal": "Nucleic Acids Research",
                "year": 2017,
                "relevant_quote": "Here, we report a dynamic signaling pathway that tightly regulates Chk1 stability. Under unperturbed conditions and upon DNA damage, ataxin-3 (ATX3) interacts with Chk1 and protects it from DDB1/CUL4A- and FBXO6/CUL1-mediated polyubiquitination and subsequent degradation, thereby promoting DNA repair and checkpoint signaling.",
                "pmid": "28180282"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28180282"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Checkpoint kinase 1 (Chk1) is a key serine/threonine kinase in the DNA damage response (DDR). Its stability is regulated by polyubiquitination and proteasomal degradation, which is crucial for activating and terminating DNA damage checkpoints.",
        "effect": "ATXN3 functions as a deubiquitinase (DUB) for Chk1. By binding to Chk1, ATXN3 removes polyubiquitin chains that are added by E3 ligase complexes, such as DDB1/CUL4A and FBXO6/CUL1. This action protects Chk1 from degradation by the proteasome, thereby maintaining its steady-state levels and ensuring a robust DNA damage checkpoint response.",
        "summary": "ATXN3 activates Chk1 to modulate chk1 protein stability and dna damage checkpoint, ultimately affecting facilitation of dna repair and maintenance of genome integrity.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 promotes genome integrity by stabilizing Chk1",
            "journal": "Nucleic Acids Research",
            "year": 2017,
            "relevant_quote": "Here, we report a dynamic signaling pathway that tightly regulates Chk1 stability. Under unperturbed conditions and upon DNA damage, ataxin-3 (ATX3) interacts with Chk1 and protects it from DDB1/CUL4A- and FBXO6/CUL1-mediated polyubiquitination and subsequent degradation, thereby promoting DNA repair and checkpoint signaling."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> Chk1:"
      },
      {
        "primary": "MDC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "During the early phase of the double-strand break response, ATXN3 antagonizes RNF4-induced polyubiquitination and subsequent chromatin-release of MDC1.",
        "functions": [
          {
            "function": "DNA Double-Strand Break Response",
            "arrow": "activates",
            "cellular_process": "Mediator of DNA damage checkpoint 1 (MDC1) is a scaffold protein that accumulates at DNA double-strand breaks (DSBs) and is essential for recruiting downstream repair factors. Its retention on chromatin is dynamically regulated by ubiquitination, particularly by the SUMO-targeted ubiquitin ligase (STUbL) RNF4, which promotes its removal.",
            "effect_description": "ATXN3 is recruited to DSB sites in a SUMO-dependent manner where it functions as a deubiquitinase to counteract the activity of the E3 ligase RNF4. By removing ubiquitin chains from MDC1, ATXN3 prevents the premature release of MDC1 from chromatin. This action stabilizes MDC1 at the site of damage, prolonging its residence time and thereby consolidating the DNA damage response by ensuring the efficient recruitment of downstream effectors like RNF8, RNF168, and 53BP1.",
            "biological_consequence": [
              "DNA double-strand break occurs → ATXN3 is recruited to the damage site via SUMOylation signals → ATXN3 deubiquitinates MDC1, counteracting RNF4-mediated ubiquitination → MDC1 chromatin dwell time is increased → Enhanced recruitment of downstream factors (RNF8, RNF168, 53BP1, BRCA1) → Robust DSB signaling and efficient repair via NHEJ and HR pathways."
            ],
            "specific_effects": [
              "ATXN3 directly counteracts RNF4-mediated polyubiquitination of MDC1 at sites of DNA damage.",
              "Loss of ATXN3 significantly decreases the residence time of MDC1 on chromatin at DSBs, an effect that is reversed by the co-depletion of RNF4.",
              "The stabilization of MDC1 by ATXN3 is necessary for the efficient recruitment of downstream DNA damage response proteins, including RNF8, RNF168, 53BP1, and BRCA1.",
              "ATXN3 promotes efficient MDC1-dependent repair of DSBs through both non-homologous end-joining (NHEJ) and homologous recombination (HR)."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4.",
                "pmid": "28275011"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Mediator of DNA damage checkpoint 1 (MDC1) is a scaffold protein that accumulates at DNA double-strand breaks (DSBs) and is essential for recruiting downstream repair factors. Its retention on chromatin is dynamically regulated by ubiquitination, particularly by the SUMO-targeted ubiquitin ligase (STUbL) RNF4, which promotes its removal.",
        "effect": "ATXN3 is recruited to DSB sites in a SUMO-dependent manner where it functions as a deubiquitinase to counteract the activity of the E3 ligase RNF4. By removing ubiquitin chains from MDC1, ATXN3 prevents the premature release of MDC1 from chromatin. This action stabilizes MDC1 at the site of damage, prolonging its residence time and thereby consolidating the DNA damage response by ensuring the efficient recruitment of downstream effectors like RNF8, RNF168, and 53BP1.",
        "summary": "ATXN3 activates MDC1 to modulate dna double-strand break response, ultimately affecting robust dsb signaling and efficient repair via nhej and hr pathways.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Here, we report that the deubiquitylation enzyme (DUB) ataxin-3 counteracts RNF4 activity during the DNA double-strand break (DSB) response. We find that ataxin-3 negatively regulates ubiquitylation of the checkpoint mediator MDC1, a known RNF4 substrate. Loss of ataxin-3 markedly decreases the chromatin dwell time of MDC1 at DSBs, which can be fully reversed by co-depletion of RNF4."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> MDC1:"
      },
      {
        "primary": "Bcl-2",
        "interaction_type": "indirect",
        "upstream_interactor": "Parkin",
        "mediator_chain": [
          "Parkin"
        ],
        "depth": 2,
        "support_summary": "ATXN3 regulates the activity of the E3 ligase Parkin, which in turn monoubiquitinates the autophagy inhibitor Bcl-2.",
        "functions": [
          {
            "function": "Autophagy",
            "arrow": "activates",
            "cellular_process": "ATXN3 regulates the E3 ligase activity of Parkin. Parkin can monoubiquitinate the anti-autophagic protein Bcl-2. By modulating Parkin, ATXN3 indirectly influences the inhibition of autophagy by Bcl-2.",
            "effect_description": "By counteracting Parkin's auto-ubiquitination, ATXN3 keeps Parkin active, allowing it to ubiquitinate Bcl-2, which in turn promotes the initiation of autophagy.",
            "biological_consequence": [
              "Regulation of Parkin activity → Ubiquitination of Bcl-2 → Dissociation of Beclin-1 from Bcl-2 → Autophagy initiation"
            ],
            "specific_effects": [
              "ATXN3 counteracts Parkin auto-ubiquitination.",
              "ATXN3 regulates the activity of Parkin, which ubiquitinates the autophagy inhibitor Bcl-2."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "year": 2024,
                "pmid": "39320846"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Autophagy",
              "canonical_name": "Autophagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "direct_arrow": "inhibits",
            "consequences": [
              "ATXN3 inhibits Parkin's E3 ligase activity → Reduced mono-ubiquitination and stabilization of Bcl-2 by Parkin → Weakened Bcl-2/Beclin-1 interaction → Autophagy initiation"
            ],
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "Parkin",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "Parkin"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "ATXN3 regulates the E3 ligase activity of Parkin. Parkin can monoubiquitinate the anti-autophagic protein Bcl-2. By modulating Parkin, ATXN3 indirectly influences the inhibition of autophagy by Bcl-2.",
        "effect": "By counteracting Parkin's auto-ubiquitination, ATXN3 keeps Parkin active, allowing it to ubiquitinate Bcl-2, which in turn promotes the initiation of autophagy.",
        "summary": "ATXN3 activates Bcl-2 to modulate autophagy, ultimately affecting autophagy initiation.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "year": 2024
          }
        ],
        "pathways": [
          {
            "name": "Autophagy",
            "canonical_name": "Autophagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibits",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "Parkin --inhibits--> Bcl-2:"
      },
      {
        "primary": "KLF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is the deubiquitinating enzyme of KLF4 in breast cancer, and their expression levels are significantly correlated.",
        "functions": [
          {
            "function": "KLF4 Protein Stability",
            "arrow": "activates",
            "cellular_process": "Krüppel-like factor 4 (KLF4) is a transcription factor involved in diverse cellular processes, including proliferation, differentiation, and tumorigenesis. Its protein levels are tightly controlled by the ubiquitin-proteasome system.",
            "effect_description": "ATXN3 functions as a deubiquitinating enzyme for KLF4. It directly binds to KLF4, removes ubiquitin chains, and thereby stabilizes the KLF4 protein, leading to increased protein levels and enhanced transcriptional activity.",
            "biological_consequence": [
              "Deubiquitination of KLF4 → Increased KLF4 protein stability → Enhanced KLF4-mediated transcription → Promotion of breast cancer cell metastasis"
            ],
            "specific_effects": [
              "ATXN3 was identified as a novel deubiquitinating enzyme of KLF4.",
              "ATXN3 binds to KLF4, mediating its deubiquitination and stabilization.",
              "ATXN3 promotes breast cancer cell metastasis via its effect on KLF4.",
              "High expression of both ATXN3 and KLF4 is associated with a poor prognosis in breast cancer patients."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
                "year": 2019,
                "pmid": "31563563"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31563563"
            ]
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "Krüppel-like factor 4 (KLF4) is a transcription factor involved in diverse cellular processes, including proliferation, differentiation, and tumorigenesis. Its protein levels are tightly controlled by the ubiquitin-proteasome system.",
        "effect": "ATXN3 functions as a deubiquitinating enzyme for KLF4. It directly binds to KLF4, removes ubiquitin chains, and thereby stabilizes the KLF4 protein, leading to increased protein levels and enhanced transcriptional activity.",
        "summary": "ATXN3 activates KLF4 to modulate klf4 protein stability, ultimately affecting promotion of breast cancer cell metastasis.",
        "evidence": [
          {
            "paper_title": "ATXN3 promotes breast cancer metastasis by deubiquitinating KLF4",
            "year": 2019
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "arrow_notation": "ATXN3 --activates--> KLF4:"
      },
      {
        "primary": "RNF8",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 forms a complex with p97/VCP to regulate the homeostasis of the E3 ubiquitin ligase RNF8, which is a key mediator of the DNA damage response.",
        "functions": [
          {
            "function": "RNF8 Chromatin Extraction",
            "arrow": "activates",
            "cellular_process": "The E3 ubiquitin ligase RNF8 is a key factor in the DNA double-strand break (DSB) response, responsible for ubiquitinating histones to create a scaffold for repair protein recruitment. After its initial function, RNF8 must be removed from chromatin to allow the repair process to proceed and to prevent its hyper-accumulation, which can be toxic.",
            "effect_description": "ATXN3, in a complex with the ATPase p97/VCP, regulates RNF8 homeostasis. Following the initial DNA damage response, the p97-ATXN3 complex stimulates the extraction of RNF8 from chromatin. This action helps to balance the DNA repair pathway choice and is crucial for cell survival after DNA damage.",
            "biological_consequence": [
              "Extraction of RNF8 from chromatin → Regulation of DSB repair pathway choice (e.g., NHEJ) → Prevention of RNF8 hyper-accumulation → Promotion of cell survival after genotoxic stress"
            ],
            "specific_effects": [
              "ATXN3 forms a physical and functional complex with p97/VCP and RNF8.",
              "The p97-ATXN3 complex regulates the proteasome-dependent homeostasis of RNF8 under normal conditions.",
              "Under genotoxic stress, the p97-ATXN3 machinery extracts RNF8 from chromatin at DNA damage sites.",
              "Inactivation of the p97-ATXN3 complex impairs non-homologous end joining (NHEJ) and sensitizes cancer cells to ionizing radiation."
            ],
            "evidence": [
              {
                "paper_title": "The p97–Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
                "year": 2019,
                "pmid": "31613024"
              }
            ],
            "_context": {
              "type": "direct",
              "query_protein": null,
              "chain": null
            },
            "interaction_effect": "activates",
            "direction": "main_to_primary",
            "interaction_direction": "main_to_primary",
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31613024"
            ],
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "mechanism": "The E3 ubiquitin ligase RNF8 is a key factor in the DNA double-strand break (DSB) response, responsible for ubiquitinating histones to create a scaffold for repair protein recruitment. After its initial function, RNF8 must be removed from chromatin to allow the repair process to proceed and to prevent its hyper-accumulation, which can be toxic.",
        "effect": "ATXN3, in a complex with the ATPase p97/VCP, regulates RNF8 homeostasis. Following the initial DNA damage response, the p97-ATXN3 complex stimulates the extraction of RNF8 from chromatin. This action helps to balance the DNA repair pathway choice and is crucial for cell survival after DNA damage.",
        "summary": "ATXN3 activates RNF8 to modulate rnf8 chromatin extraction, ultimately affecting promotion of cell survival after genotoxic stress.",
        "evidence": [
          {
            "paper_title": "The p97–Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
            "year": 2019
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> RNF8:"
      },
      {
        "primary": "HSPA8",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with HSPA8 (also known as Hsc70) through its ubiquitin-interacting motifs (UIMs). This interaction has been shown to enhance ataxin-3 aggregation and toxicity.",
        "functions": [
          {
            "function": "Promotion of ATXN3 Aggregation",
            "arrow": "activates",
            "cellular_process": "HSPA8 (also known as Hsc70) is a molecular chaperone involved in protein quality control. Under normal conditions, chaperones are expected to refold or degrade misfolded proteins like polyglutamine (polyQ)-expanded ATXN3.",
            "effect_description": "Counterintuitively, the interaction between HSPA8 and polyQ-expanded ATXN3, mediated by ATXN3's ubiquitin-interacting motifs (UIMs), enhances the aggregation of pathogenic ATXN3 and increases its cellular toxicity. Instead of alleviating toxicity, HSPA8 appears to adopt a dominant-negative role, exacerbating the pathogenic phenotype.",
            "biological_consequence": [
              "PolyQ-expanded ATXN3 binds to HSPA8 via its UIMs → HSPA8 fails to properly refold or clear the pathogenic ATXN3 → The chaperone-ATXN3 complex facilitates the formation of toxic oligomers → Enhanced ATXN3 aggregation → Increased cellular toxicity and neurodegeneration."
            ],
            "specific_effects": [
              "The interaction is dependent on the ubiquitin-interacting motifs (UIMs) of ATXN3.",
              "Hsc70-4 (the Drosophila homolog of HSPA8) enhances the aggregation and toxicity of pathogenic ataxin-3.",
              "This interaction represents a pathogenic gain-of-function where a chaperone protein exacerbates the toxicity of a polyQ protein."
            ],
            "evidence": [
              {
                "paper_title": "Ubiquitin-interacting motifs of ataxin-3 regulate its polyglutamine toxicity through Hsc70-4-dependent aggregation",
                "journal": "eLife",
                "year": 2020,
                "relevant_quote": "UIMs interact with heat shock protein cognate 4 (Hsc70-4), which enhances ataxin-3 aggregation and toxicity in a manner dependent on these ubiquitin-binding domains.",
                "pmid": "32955441"
              }
            ],
            "pathway": {
              "name": "Protein Aggregation Pathway",
              "canonical_name": "Protein Aggregation Pathway",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "32955441"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "HSPA8 (also known as Hsc70) is a molecular chaperone involved in protein quality control. Under normal conditions, chaperones are expected to refold or degrade misfolded proteins like polyglutamine (polyQ)-expanded ATXN3.",
        "effect": "Counterintuitively, the interaction between HSPA8 and polyQ-expanded ATXN3, mediated by ATXN3's ubiquitin-interacting motifs (UIMs), enhances the aggregation of pathogenic ATXN3 and increases its cellular toxicity. Instead of alleviating toxicity, HSPA8 appears to adopt a dominant-negative role, exacerbating the pathogenic phenotype.",
        "summary": "ATXN3 activates HSPA8 to modulate promotion of atxn3 aggregation, ultimately affecting increased cellular toxicity and neurodegeneration.",
        "evidence": [
          {
            "paper_title": "Ubiquitin-interacting motifs of ataxin-3 regulate its polyglutamine toxicity through Hsc70-4-dependent aggregation",
            "journal": "eLife",
            "year": 2020,
            "relevant_quote": "UIMs interact with heat shock protein cognate 4 (Hsc70-4), which enhances ataxin-3 aggregation and toxicity in a manner dependent on these ubiquitin-binding domains."
          }
        ],
        "pathways": [
          {
            "name": "Protein Aggregation Pathway",
            "canonical_name": "Protein Aggregation Pathway",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --regulates--> HSPA8:"
      },
      {
        "primary": "PCAF",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 is known to cooperate with several transcriptional regulators, including the histone acetyltransferase PCAF (p300/CBP-associated factor), to control the transcription of target genes.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "PCAF (p300/CBP-associated factor) is a transcriptional coactivator with histone acetyltransferase (HAT) activity. By acetylating histones, PCAF promotes a relaxed chromatin state (euchromatin), which facilitates gene transcription.",
            "effect_description": "ATXN3 directly interacts with PCAF and inhibits its intrinsic HAT activity. This prevents the acetylation of histones at target gene promoters, leading to a more condensed chromatin structure and the repression of gene expression.",
            "biological_consequence": [
              "The C-terminal domain of ATXN3 binds to the PCAF coactivator → ATXN3 inhibits the histone acetyltransferase (HAT) activity of PCAF → Reduced acetylation of histones (e.g., H3) at target gene promoters → Chromatin remains in a condensed, transcriptionally repressed state → Decreased expression of PCAF target genes."
            ],
            "specific_effects": [
              "ATXN3 functions as a direct repressor of the HAT activity of PCAF.",
              "The interaction is mediated by the C-terminal domain of ATXN3.",
              "This mechanism is distinct from ATXN3's deubiquitinase activity and represents a separate function in transcriptional regulation."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity.",
                "pmid": "39320846"
              },
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS One",
                "year": 2018,
                "relevant_quote": "An additional role for ATXN3 in transcriptional regulation is suggested by the ability of ATXN3 to bind DNA and cooperate with transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR.",
                "pmid": "30231063"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "39320846",
              "30231063"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "PCAF (p300/CBP-associated factor) is a transcriptional coactivator with histone acetyltransferase (HAT) activity. By acetylating histones, PCAF promotes a relaxed chromatin state (euchromatin), which facilitates gene transcription.",
        "effect": "ATXN3 directly interacts with PCAF and inhibits its intrinsic HAT activity. This prevents the acetylation of histones at target gene promoters, leading to a more condensed chromatin structure and the repression of gene expression.",
        "summary": "ATXN3 inhibits PCAF to modulate transcriptional repression, ultimately affecting decreased expression of pcaf target genes.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "The C-terminal domain of ATXN3 binds CBP, p300 and PCAF coactivators and represses their transcriptional activity."
          },
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS One",
            "year": 2018,
            "relevant_quote": "An additional role for ATXN3 in transcriptional regulation is suggested by the ability of ATXN3 to bind DNA and cooperate with transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --inhibits--> PCAF:"
      },
      {
        "primary": "TBP",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "As part of its role in transcriptional regulation, ATXN3 interacts with the general transcription factor TATA-binding protein (TBP).",
        "functions": [
          {
            "function": "Transcriptional",
            "arrow": "regulates",
            "cellular_process": "TATA-binding protein (TBP) is a general transcription factor essential for the formation of the RNA polymerase II preinitiation complex (PIC) at the core promoter of most eukaryotic genes.",
            "effect_description": "ATXN3 interacts with TBP, indicating a role in modulating the assembly and function of the basal transcription machinery. However, this interaction does not equate to simple activation. Given ATXN3's established role as a transcriptional repressor that cooperates with histone deacetylases, its interaction with TBP is likely part of a broader mechanism to control gene expression, potentially by influencing the recruitment or stability of the PIC on specific gene promoters.",
            "biological_consequence": [
              "ATXN3 localizes to the nucleus → ATXN3 interacts with TBP and other regulators (e.g., PCAF, HDAC3) → ATXN3 modulates the assembly or activity of the preinitiation complex at specific gene promoters → Context-dependent regulation of gene transcription."
            ],
            "specific_effects": [
              "ATXN3 has been shown to cooperate with the general transcription factor TBP.",
              "The functional outcome of the ATXN3-TBP interaction is not well defined but occurs in the context of ATXN3's broader role in transcriptional control, which is often repressive."
            ],
            "evidence": [
              {
                "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
                "journal": "PLoS One",
                "year": 2018,
                "relevant_quote": "First, ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes.",
                "pmid": "30231063"
              },
              {
                "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
                "journal": "Cells",
                "year": 2021,
                "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)...",
                "pmid": "24293103"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "30231063",
              "24293103"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "regulates",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "regulates",
            "direct_arrow": "regulates",
            "net_effect": "regulation",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ATXN3 'activates' transcription via TBP is unsubstantiated and likely a 'Contextual Error'. The literature confirms an interaction but does not support a simple activating role. ATXN3's primary documented effect on transcription is repressive, often through recruitment of HDACs. The interaction with the general transcription factor TBP is better described as 'regulatory' or 'modulatory' within the context of larger transcriptional complexes.",
        "mechanism": "TATA-binding protein (TBP) is a general transcription factor essential for the formation of the RNA polymerase II preinitiation complex (PIC) at the core promoter of most eukaryotic genes.",
        "effect": "ATXN3 interacts with TBP, indicating a role in modulating the assembly and function of the basal transcription machinery. However, this interaction does not equate to simple activation. Given ATXN3's established role as a transcriptional repressor that cooperates with histone deacetylases, its interaction with TBP is likely part of a broader mechanism to control gene expression, potentially by influencing the recruitment or stability of the PIC on specific gene promoters.",
        "summary": "ATXN3 interacts with TBP to modulate transcriptional regulation, ultimately affecting context-dependent regulation of gene transcription.",
        "evidence": [
          {
            "paper_title": "Loss of the Spinocerebellar Ataxia type 3 disease protein ATXN3 alters transcription of multiple signal transduction pathways",
            "journal": "PLoS One",
            "year": 2018,
            "relevant_quote": "First, ATXN3 is transported into the nucleus, particularly in the disease state, where it binds histone proteins and cooperates with numerous transcriptional regulators including CBP, P300, PCAF, TBP, HDAC3, HDAC6 and NCoR to control transcription of target genes."
          },
          {
            "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
            "journal": "Cells",
            "year": 2021,
            "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)..."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TBP:"
      },
      {
        "primary": "Camk2a",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic analysis following ataxin-3 pull-down from brain lysates identified Calcium/Calmodulin Dependent Protein Kinase II alpha (Camk2a) as an interaction partner.",
        "functions": [
          {
            "function": "Mitochondrial Axonal Transport",
            "arrow": "activates",
            "cellular_process": "Calcium/Calmodulin Dependent Protein Kinase II alpha (Camk2a) is a crucial kinase for neuronal function. ATXN3 is part of a protein complex with Camk2a that is involved in the regulation of mitochondrial transport along axons, a process vital for distributing mitochondria to sites of high energy demand and maintaining neuronal health.",
            "effect_description": "Wild-type ATXN3's interaction with Camk2a is necessary for normal mitochondrial motility. The polyglutamine (polyQ) expansion in mutant ATXN3 leads to an abnormal interaction with Camk2a. This impaired association is directly linked to altered and defective motility of mitochondria within the neurites of a SCA3 mouse model, suggesting a loss-of-function mechanism where the mutant protein fails to properly support the transport machinery.",
            "biological_consequence": [
              "Wild-type ATXN3 forms a functional complex with Camk2a → The complex correctly regulates mitochondrial transport machinery → Promotes proper motility of mitochondria along axons → Ensures neuronal energy supply and homeostasis"
            ],
            "specific_effects": [
              "Mutant ataxin-3 exhibits an abnormal interaction with Camk2a.",
              "The impaired interaction between mutant ATXN3 and Camk2a is associated with altered motility of mitochondria in the neurites of a SCA3 Ki150 mouse model."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b. ... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Axonal Transport",
              "canonical_name": "Axonal Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "37033372"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "bidirectional",
            "function_effect": "activation"
          }
        ],
        "arrow": "complex",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Calcium/Calmodulin Dependent Protein Kinase II alpha (Camk2a) is a crucial kinase for neuronal function. ATXN3 is part of a protein complex with Camk2a that is involved in the regulation of mitochondrial transport along axons, a process vital for distributing mitochondria to sites of high energy demand and maintaining neuronal health.",
        "effect": "Wild-type ATXN3's interaction with Camk2a is necessary for normal mitochondrial motility. The polyglutamine (polyQ) expansion in mutant ATXN3 leads to an abnormal interaction with Camk2a. This impaired association is directly linked to altered and defective motility of mitochondria within the neurites of a SCA3 mouse model, suggesting a loss-of-function mechanism where the mutant protein fails to properly support the transport machinery.",
        "summary": "ATXN3 activates Camk2a to modulate mitochondrial axonal transport, ultimately affecting ensures neuronal energy supply and homeostasis.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "Among others, mutant ataxin-3 abnormally interacted with subunits of large complexes such as Cct5 and 6, Tcp1, and Camk2a and Camk2b. ... The protein complexes were involved in transport of mitochondria in axons which was confirmed by altered motility of mitochondria along SCA3 Ki150 neurites."
          }
        ],
        "pathways": [
          {
            "name": "Axonal Transport",
            "canonical_name": "Axonal Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "complex formation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--complex--> Camk2a:"
      },
      {
        "primary": "ITCH",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The E3 ubiquitin ligase ITCH has been shown to interact with the polyQ-expanded form of ATXN3.",
        "functions": [
          {
            "function": "Mitigation of Mutant ATXN3 Cytotoxicity",
            "arrow": "activates",
            "cellular_process": "ITCH is a HECT-type E3 ubiquitin ligase. It has been shown to interact with the polyglutamine-expanded form of ATXN3 (ATXN3-PolyQ). While the precise downstream consequence of this interaction is not fully elucidated, ITCH plays a protective role against the toxicity induced by mutant ATXN3.",
            "effect_description": "The interaction between ITCH and ATXN3-PolyQ is beneficial. Transient overexpression of ITCH in cellular models leads to an alleviation of the cytotoxicity caused by the aggregation of misfolded proteins like mutant ATXN3. This suggests ITCH is involved in a quality control pathway that counteracts the harmful effects of the mutant protein, though not necessarily by directly promoting its degradation.",
            "biological_consequence": [
              "ITCH binds to polyQ-expanded ATXN3 → The interaction modulates the cellular environment or the mutant protein itself → Reduces the formation or impact of toxic protein aggregates → Alleviates cytotoxicity and promotes cell survival"
            ],
            "specific_effects": [
              "The E3 ubiquitin ligase ITCH interacts with polyQ-expanded ATXN3.",
              "Transient overexpression of ITCH alleviates cytotoxicity induced by the aggregation of misfolded proteins."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "The FEBS Journal",
                "year": 2024,
                "relevant_quote": "Also, transient overexpression of the E3 ubiquitin ligase ITCH, which interacts with ATXN3-PolyQ, alleviates cytotoxicity induced by aggregation of misfolded proteins, supporting the importance of ubiquitination in SCA3.",
                "pmid": "39320846"
              }
            ],
            "pathway": {
              "name": "Cell Survival Signaling",
              "canonical_name": "Cell Survival Signaling",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "39320846"
            ],
            "interaction_effect": "activator",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim that ITCH directly ubiquitinates and degrades mutant ATXN3 is an inference not explicitly stated in the cited literature. The primary evidence confirms an interaction between ITCH and polyQ-expanded ATXN3, and that ITCH overexpression alleviates cytotoxicity. However, the direct ubiquitination of ATXN3 by ITCH leading to its degradation is not explicitly demonstrated. The validated mechanism is one of interaction and mitigation of toxicity, not necessarily direct degradation of ATXN3 itself.",
        "mechanism": "ITCH is a HECT-type E3 ubiquitin ligase. It has been shown to interact with the polyglutamine-expanded form of ATXN3 (ATXN3-PolyQ). While the precise downstream consequence of this interaction is not fully elucidated, ITCH plays a protective role against the toxicity induced by mutant ATXN3.",
        "effect": "The interaction between ITCH and ATXN3-PolyQ is beneficial. Transient overexpression of ITCH in cellular models leads to an alleviation of the cytotoxicity caused by the aggregation of misfolded proteins like mutant ATXN3. This suggests ITCH is involved in a quality control pathway that counteracts the harmful effects of the mutant protein, though not necessarily by directly promoting its degradation.",
        "summary": "ATXN3 interacts with ITCH to modulate mitigation of mutant atxn3 cytotoxicity, ultimately affecting alleviates cytotoxicity and promotes cell survival.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "The FEBS Journal",
            "year": 2024,
            "relevant_quote": "Also, transient overexpression of the E3 ubiquitin ligase ITCH, which interacts with ATXN3-PolyQ, alleviates cytotoxicity induced by aggregation of misfolded proteins, supporting the importance of ubiquitination in SCA3."
          }
        ],
        "pathways": [
          {
            "name": "Cell Survival Signaling",
            "canonical_name": "Cell Survival Signaling",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- ITCH:"
      },
      {
        "primary": "Dynein",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 interacts with the motor protein dynein, which is essential for retrograde axonal transport, as part of its role in regulating cytoskeleton function.",
        "functions": [
          {
            "function": "Retrograde Transport and Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "Dynein is a microtubule-based motor protein responsible for retrograde transport, moving cellular cargo from the cell periphery towards the nucleus. This process is essential for clearing misfolded protein aggregates by transporting them to a central, perinuclear location called the aggresome for subsequent degradation by autophagy.",
            "effect_description": "ATXN3 functions as a critical adaptor protein that links polyubiquitinated, misfolded protein substrates to the dynein motor complex. Both the deubiquitinating activity of ATXN3 and its ubiquitin-interacting motifs (UIMs) are essential for this function. By facilitating this link, ATXN3 promotes the transport of toxic protein aggregates to the aggresome, playing a key role in cellular protein quality control.",
            "biological_consequence": [
              "ATXN3 binds polyubiquitinated misfolded protein cargo via its UIMs → ATXN3 acts as an adaptor to link the cargo to the Dynein motor complex → Dynein transports the cargo retrogradely along microtubules → Misfolded proteins are sequestered into a perinuclear aggresome → Facilitates clearance via autophagy"
            ],
            "specific_effects": [
              "ATXN3 directly associates with the dynein motor protein complex.",
              "Knockdown of ATXN3 using small interfering RNA (siRNA) significantly reduces the formation of aggresomes.",
              "Both the catalytic deubiquitinase activity and the ubiquitin-interacting motifs of ATXN3 are required for its role in aggresome formation and its association with dynein."
            ],
            "evidence": [
              {
                "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
                "journal": "Proceedings of the National Academy of Sciences of the United States of America",
                "year": 2005,
                "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process.",
                "pmid": "15767577"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "15767577"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Dynein is a microtubule-based motor protein responsible for retrograde transport, moving cellular cargo from the cell periphery towards the nucleus. This process is essential for clearing misfolded protein aggregates by transporting them to a central, perinuclear location called the aggresome for subsequent degradation by autophagy.",
        "effect": "ATXN3 functions as a critical adaptor protein that links polyubiquitinated, misfolded protein substrates to the dynein motor complex. Both the deubiquitinating activity of ATXN3 and its ubiquitin-interacting motifs (UIMs) are essential for this function. By facilitating this link, ATXN3 promotes the transport of toxic protein aggregates to the aggresome, playing a key role in cellular protein quality control.",
        "summary": "ATXN3 activates Dynein to modulate retrograde transport and aggresome formation, ultimately affecting facilitates clearance via autophagy.",
        "evidence": [
          {
            "paper_title": "The polyglutamine neurodegenerative protein ataxin 3 regulates aggresome formation",
            "journal": "Proceedings of the National Academy of Sciences of the United States of America",
            "year": 2005,
            "relevant_quote": "Cellular studies show that endogenous AT3 colocalizes with aggresomes and preaggresome particles of the misfolded cystic fibrosis transmembrane regulator (CFTR) mutant CFTRΔF508 and associates with histone deacetylase 6 and dynein, proteins required for aggresome formation and transport of misfolded protein. Small interfering RNA knockdown of AT3 greatly reduces aggresomes formed by CFTRΔF508, demonstrating a critical role of AT3 in this process."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> Dynein:"
      },
      {
        "primary": "p62",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with p62 (SQSTM1), an autophagic protein involved in the formation of aggresomes.",
        "functions": [
          {
            "function": "Aggresome Formation",
            "arrow": "activates",
            "cellular_process": "p62 (SQSTM1) is a multifunctional protein that serves as a selective autophagy receptor, linking ubiquitinated cargo to the autophagic machinery. It plays a crucial role in the formation of aggresomes, which are cellular inclusion bodies that sequester misfolded proteins.",
            "effect_description": "p62 directly interacts with polyglutamine (polyQ)-expanded ATXN3, but not normal ATXN3, and promotes its assembly into aggresomes. This process is dependent on the microtubule network, as p62 facilitates the transport of ATXN3 aggregates to the microtubule-organizing center (MTOC).",
            "biological_consequence": [
              "p62 directly binds to polyQ-expanded ATXN3 → p62 facilitates the sequestration of ubiquitinated ATXN3 aggregates → Aggregates are transported along microtubules to the MTOC → Formation of a single large aggresome → Cellular protection against polyQ-expanded ATXN3-induced cell death"
            ],
            "specific_effects": [
              "p62 physically and directly interacts with pathogenic, polyQ-expanded ataxin-3.",
              "p62 acts as a master regulator of ataxin-3 aggresome formation.",
              "The formation of aggresomes mediated by p62 protects cells against the toxicity induced by polyQ-expanded ataxin-3."
            ],
            "evidence": [
              {
                "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
                "journal": "International Journal of Molecular Sciences",
                "year": 2014,
                "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death.",
                "pmid": "25158237"
              }
            ],
            "pathway": {
              "name": "Aggrephagy",
              "canonical_name": "Aggrephagy",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25158237"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "p62 (SQSTM1) is a multifunctional protein that serves as a selective autophagy receptor, linking ubiquitinated cargo to the autophagic machinery. It plays a crucial role in the formation of aggresomes, which are cellular inclusion bodies that sequester misfolded proteins.",
        "effect": "p62 directly interacts with polyglutamine (polyQ)-expanded ATXN3, but not normal ATXN3, and promotes its assembly into aggresomes. This process is dependent on the microtubule network, as p62 facilitates the transport of ATXN3 aggregates to the microtubule-organizing center (MTOC).",
        "summary": "ATXN3 activates p62 to modulate aggresome formation, ultimately affecting cellular protection against polyq-expanded atxn3-induced cell death.",
        "evidence": [
          {
            "paper_title": "p62/Sequestosome 1 Regulates Aggresome Formation of Pathogenic Ataxin-3 with Expanded Polyglutamine",
            "journal": "International Journal of Molecular Sciences",
            "year": 2014,
            "relevant_quote": "In this study we demonstrate that p62 directly interacts with pathogenic Machado Joseph Disease (MJD)-associated protein ataxin-3 with polyglutamine (polyQ) expansion. Moreover, p62 could regulate the aggresome formation of pathogenic ataxin-3 and protect cells against pathogenic ataxin-3-induced cell death."
          }
        ],
        "pathways": [
          {
            "name": "Aggrephagy",
            "canonical_name": "Aggrephagy",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--binds-- p62:"
      },
      {
        "primary": "CHIP",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "The E3 ligase CHIP (also known as STUB1) is a direct interactor of ATXN3, involved in protein quality control and aggresome formation.",
        "functions": [
          {
            "function": "Ubiquitin Chain Length",
            "arrow": "regulates",
            "cellular_process": "The E3 ubiquitin ligase CHIP (STUB1) works with chaperones to recognize misfolded proteins and attach polyubiquitin chains to them, targeting them for proteasomal degradation. This process is a key component of cellular protein quality control.",
            "effect_description": "ATXN3 forms a complex with CHIP and its substrates. Within this complex, ATXN3 acts as a specialized deubiquitinase that edits the ubiquitin chains synthesized by CHIP. It preferentially trims longer ubiquitin chains, thereby controlling the extent of substrate ubiquitination. Furthermore, upon completion of substrate polyubiquitination, ATXN3 deubiquitinates CHIP itself, which terminates the ubiquitination cycle.",
            "biological_consequence": [
              "CHIP, with an E2 enzyme (e.g., Ube2w), monoubiquitinates a misfolded substrate and itself → Monoubiquitination of CHIP stabilizes its interaction with ATXN3 → A chain-elongating E2 (e.g., UbcH5) extends the ubiquitin chain on the substrate → ATXN3 binds the growing polyubiquitin chain via its UIMs and trims it, limiting its length → Once the substrate is properly ubiquitinated, ATXN3 deubiquitinates CHIP, terminating the reaction → Regulated degradation of the substrate by the proteasome"
            ],
            "specific_effects": [
              "ATXN3 limits the length of ubiquitin chains attached to CHIP substrates.",
              "ATXN3 deubiquitinates monoubiquitinated CHIP, but only in the presence of a polyubiquitinated substrate, effectively terminating the ubiquitination reaction.",
              "Monoubiquitination of CHIP by the E2 enzyme Ube2w stabilizes the interaction between CHIP and ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
                "journal": "Molecular Cell",
                "year": 2011,
                "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction.",
                "pmid": "21855799"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "21855799"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "bidirectional",
            "function_effect": "regulation"
          }
        ],
        "arrow": "regulates",
        "direction": "bidirectional",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input correctly identifies that ATXN3 inhibits CHIP's ubiquitin chain elongation activity. However, the mechanism is more nuanced. ATXN3 is part of a coordinated cycle that regulates CHIP's function, not just a simple inhibitor. It trims ubiquitin chains on the substrate and also deubiquitinates CHIP itself to terminate the reaction.",
        "mechanism": "The E3 ubiquitin ligase CHIP (STUB1) works with chaperones to recognize misfolded proteins and attach polyubiquitin chains to them, targeting them for proteasomal degradation. This process is a key component of cellular protein quality control.",
        "effect": "ATXN3 forms a complex with CHIP and its substrates. Within this complex, ATXN3 acts as a specialized deubiquitinase that edits the ubiquitin chains synthesized by CHIP. It preferentially trims longer ubiquitin chains, thereby controlling the extent of substrate ubiquitination. Furthermore, upon completion of substrate polyubiquitination, ATXN3 deubiquitinates CHIP itself, which terminates the ubiquitination cycle.",
        "summary": "ATXN3 interacts with CHIP to modulate regulation of ubiquitin chain length, ultimately affecting regulated degradation of the substrate by the proteasome.",
        "evidence": [
          {
            "paper_title": "Ube2w and ataxin-3 coordinately regulate the ubiquitin ligase CHIP",
            "journal": "Molecular Cell",
            "year": 2011,
            "relevant_quote": "Through their opposing activities, the initiator E2, Ube2w, and the specialized deubiquitinating enzyme (DUB), ataxin-3, participate in initiating, regulating and terminating the CHIP ubiquitination cycle. Monoubiquitination of CHIP by Ube2w stabilizes the interaction between CHIP and ataxin-3, which through its DUB activity limits the length of chains attached to CHIP substrates. Upon completion of substrate ubiquitination ataxin-3 deubiquitinates CHIP, effectively terminating the reaction."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates--> CHIP:"
      },
      {
        "primary": "RNF168",
        "interaction_type": "indirect",
        "upstream_interactor": "RNF8",
        "mediator_chain": [
          "RNF8"
        ],
        "depth": 2,
        "support_summary": "ATXN3, via its regulation of RNF8 extraction from chromatin, promotes the timely recruitment of the downstream E3 ligase RNF168 to DNA damage sites.",
        "functions": [
          {
            "function": "Recruitment to DNA Damage Sites",
            "arrow": "activates",
            "cellular_process": "In the cellular response to DNA double-strand breaks (DSBs), a signaling cascade is initiated to recruit repair factors. The E3 ubiquitin ligase RNF8 is an early responder, recruited by phosphorylated MDC1. RNF8 then ubiquitinates histones, creating a binding site for the downstream E3 ligase RNF168, which amplifies the ubiquitin signal to recruit factors like 53BP1 and BRCA1.",
            "effect_description": "ATXN3 indirectly promotes the recruitment of RNF168 to DSBs through two interconnected mechanisms involving the upstream factor RNF8. First, ATXN3 counteracts the SUMO-targeted ubiquitin ligase RNF4, thereby stabilizing MDC1 on the chromatin at DSB sites. This sustained presence of MDC1 is crucial for the efficient initial recruitment of RNF8. Second, the p97-ATXN3 complex stimulates the extraction of RNF8 from chromatin after its initial wave of activity. This turnover of RNF8 is necessary to prevent its hyper-accumulation and to allow for the timely recruitment of RNF168 to amplify the DNA damage signal.",
            "biological_consequence": [
              "DNA double-strand break (DSB) occurs → ATXN3 counteracts RNF4-mediated ubiquitination of MDC1 → MDC1 is stabilized on chromatin at the DSB → Stabilized MDC1 promotes efficient recruitment of RNF8 → The p97-ATXN3 complex extracts chromatin-bound RNF8, ensuring proper turnover → Timely recruitment of RNF168 is facilitated → RNF168 amplifies ubiquitin signaling on histones → Downstream repair factors (e.g., 53BP1) are recruited → DSB repair is promoted"
            ],
            "specific_effects": [
              "Loss of ATXN3 impairs the MDC1-dependent recruitment of RNF8 and RNF168 to sites of DNA damage.",
              "ATXN3 stabilizes the checkpoint mediator MDC1 at DSBs by counteracting the activity of the SUMO-targeted ubiquitin ligase RNF4.",
              "The p97-ATXN3 complex stimulates the extraction of RNF8 from chromatin under genotoxic stress, which is required for balancing DNA repair pathways."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Loss of ataxin-3 results in reduced DNA damage-induced ubiquitylation due to impaired MDC1-dependent recruitment of the ubiquitin ligases RNF8 and RNF168, and reduced recruitment of 53BP1 and BRCA1.",
                "pmid": "28275011"
              },
              {
                "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
                "journal": "The EMBO Journal",
                "year": 2019,
                "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97-ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR).",
                "pmid": "31613024"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011",
              "31613024"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "RNF8",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "RNF8"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "In the cellular response to DNA double-strand breaks (DSBs), a signaling cascade is initiated to recruit repair factors. The E3 ubiquitin ligase RNF8 is an early responder, recruited by phosphorylated MDC1. RNF8 then ubiquitinates histones, creating a binding site for the downstream E3 ligase RNF168, which amplifies the ubiquitin signal to recruit factors like 53BP1 and BRCA1.",
        "effect": "ATXN3 indirectly promotes the recruitment of RNF168 to DSBs through two interconnected mechanisms involving the upstream factor RNF8. First, ATXN3 counteracts the SUMO-targeted ubiquitin ligase RNF4, thereby stabilizing MDC1 on the chromatin at DSB sites. This sustained presence of MDC1 is crucial for the efficient initial recruitment of RNF8. Second, the p97-ATXN3 complex stimulates the extraction of RNF8 from chromatin after its initial wave of activity. This turnover of RNF8 is necessary to prevent its hyper-accumulation and to allow for the timely recruitment of RNF168 to amplify the DNA damage signal.",
        "summary": "ATXN3 activates RNF168 to modulate recruitment to dna damage sites, ultimately affecting dsb repair is promoted.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Loss of ataxin-3 results in reduced DNA damage-induced ubiquitylation due to impaired MDC1-dependent recruitment of the ubiquitin ligases RNF8 and RNF168, and reduced recruitment of 53BP1 and BRCA1."
          },
          {
            "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
            "journal": "The EMBO Journal",
            "year": 2019,
            "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97-ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR)."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "RNF8 --activates--> RNF168:"
      },
      {
        "primary": "53BP1",
        "interaction_type": "indirect",
        "upstream_interactor": "RNF168",
        "mediator_chain": [
          "RNF8",
          "RNF168"
        ],
        "depth": 3,
        "support_summary": "ATXN3's regulation of the RNF8/RNF168 axis is crucial for the proper recruitment of the DNA damage response factor 53BP1.",
        "functions": [
          {
            "function": "Recruitment to DNA Damage Sites",
            "arrow": "activates",
            "cellular_process": "53BP1 is a crucial DNA damage response (DDR) factor that facilitates the repair of DNA double-strand breaks (DSBs) through non-homologous end joining (NHEJ). Its recruitment to DSBs is contingent upon a ubiquitin-based signaling cascade initiated by the E3 ligases RNF8 and RNF168, which deposit ubiquitin marks on histones surrounding the break site, creating a binding platform for 53BP1.",
            "effect_description": "ATXN3 acts upstream in the DNA damage response by counteracting the SUMO-targeted ubiquitin ligase RNF4. This action stabilizes the checkpoint mediator protein MDC1 at DSB sites. A stable MDC1 platform is essential for the subsequent recruitment and activation of the RNF8-RNF168 E3 ligase cascade. By ensuring the proper function of this cascade, ATXN3 promotes the extensive histone ubiquitination required for the robust accumulation of 53BP1 at sites of DNA damage, thereby activating its function in DNA repair.",
            "biological_consequence": [
              "ATXN3 counteracts RNF4 activity at DSBs → MDC1 chromatin dwell time is increased → Efficient recruitment of RNF8 and RNF168 E3 ligases is ensured → Histones (e.g., H2A) are ubiquitinated → A binding scaffold for 53BP1 is created → Robust 53BP1 recruitment to DSBs promotes NHEJ repair → Genomic stability is maintained."
            ],
            "specific_effects": [
              "Loss of ATXN3 leads to a marked reduction in the recruitment of 53BP1 to sites of DNA double-strand breaks.",
              "ATXN3 depletion impairs the MDC1-dependent recruitment of the ubiquitin ligases RNF8 and RNF168.",
              "Expression of polyQ-expanded ATXN3 can lead to an accumulation of 53BP1 nuclear foci, which in the context of the mutant protein, indicates an increase in persistent, unrepaired DNA damage due to downstream pathway inhibition (e.g., PNKP inactivation)."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
                "journal": "The EMBO Journal",
                "year": 2017,
                "relevant_quote": "Loss of ataxin-3 results in reduced DNA damage-induced ubiquitylation due to impaired MDC1-dependent recruitment of the ubiquitin ligases RNF8 and RNF168, and reduced recruitment of 53BP1 and BRCA1.",
                "pmid": "28275011"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28275011"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "RNF168",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "RNF8",
                "RNF168"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "53BP1 is a crucial DNA damage response (DDR) factor that facilitates the repair of DNA double-strand breaks (DSBs) through non-homologous end joining (NHEJ). Its recruitment to DSBs is contingent upon a ubiquitin-based signaling cascade initiated by the E3 ligases RNF8 and RNF168, which deposit ubiquitin marks on histones surrounding the break site, creating a binding platform for 53BP1.",
        "effect": "ATXN3 acts upstream in the DNA damage response by counteracting the SUMO-targeted ubiquitin ligase RNF4. This action stabilizes the checkpoint mediator protein MDC1 at DSB sites. A stable MDC1 platform is essential for the subsequent recruitment and activation of the RNF8-RNF168 E3 ligase cascade. By ensuring the proper function of this cascade, ATXN3 promotes the extensive histone ubiquitination required for the robust accumulation of 53BP1 at sites of DNA damage, thereby activating its function in DNA repair.",
        "summary": "ATXN3 activates 53BP1 to modulate recruitment to dna damage sites, ultimately affecting genomic stability is maintained.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 consolidates the MDC1-dependent DNA double-strand break response by counteracting the SUMO-targeted ubiquitin ligase RNF4",
            "journal": "The EMBO Journal",
            "year": 2017,
            "relevant_quote": "Loss of ataxin-3 results in reduced DNA damage-induced ubiquitylation due to impaired MDC1-dependent recruitment of the ubiquitin ligases RNF8 and RNF168, and reduced recruitment of 53BP1 and BRCA1."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "RNF168 --activates--> 53BP1:"
      },
      {
        "primary": "ATM",
        "interaction_type": "indirect",
        "upstream_interactor": "PNKP",
        "mediator_chain": [
          "PNKP"
        ],
        "depth": 2,
        "support_summary": "The interaction of ATXN3 with and modulation of PNKP affects DNA repair efficiency; impairment of this function leads to accumulation of DNA damage and subsequent activation of the ATM signaling pathway.",
        "functions": [
          {
            "function": "DNA Damage Signaling Activation (Pathological)",
            "arrow": "activates",
            "cellular_process": "ATM (Ataxia-Telangiectasia Mutated) is a primary sensor and signal transducer for DNA double-strand breaks (DSBs). Upon sensing DNA damage, it autophosphorylates and initiates a broad signaling cascade that arrests the cell cycle and promotes DNA repair or apoptosis.",
            "effect_description": "Mutant ATXN3 (containing a polyglutamine expansion) interacts with and inactivates the DNA strand break repair enzyme PNKP. This abrogation of PNKP's function leads to the failure of DNA repair and the persistent accumulation of DNA strand breaks. This accumulation of genomic damage serves as a potent trigger for the chronic activation of the ATM kinase signaling pathway.",
            "biological_consequence": [
              "Mutant ATXN3 binds to and inactivates PNKP → DNA single- and double-strand break repair is impaired → DNA damage accumulates persistently → The MRN complex (MRE11-RAD50-NBS1) senses the DNA breaks and recruits ATM → ATM is activated via autophosphorylation at Ser1981 → Activated ATM phosphorylates downstream targets including p53 (at Ser15) and H2AX (at Ser139) → Pro-apoptotic pathways are initiated, leading to neuronal dysfunction and cell death."
            ],
            "specific_effects": [
              "The interaction between mutant ATXN3 and PNKP abrogates PNKP's 3'-phosphatase activity, leading to inefficient DNA repair.",
              "Inactivation of PNKP by mutant ATXN3 results in the chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway.",
              "Pharmacological inhibition of ATM can block cell death mediated by mutant ATXN3."
            ],
            "evidence": [
              {
                "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
                "journal": "PLoS Genetics",
                "year": 2015,
                "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3.",
                "pmid": "25590633"
              }
            ],
            "pathway": {
              "name": "DNA Damage Response",
              "canonical_name": "DNA Damage Response",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "25590633"
            ],
            "direct_arrow": "inhibits",
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "PNKP",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "PNKP"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The activation of ATM is not a direct physiological function of ATXN3. Rather, it is a pathological consequence of the loss-of-function of the DNA repair enzyme PNKP, which is caused by its interaction with mutant, polyQ-expanded ATXN3.",
        "mechanism": "ATM (Ataxia-Telangiectasia Mutated) is a primary sensor and signal transducer for DNA double-strand breaks (DSBs). Upon sensing DNA damage, it autophosphorylates and initiates a broad signaling cascade that arrests the cell cycle and promotes DNA repair or apoptosis.",
        "effect": "Mutant ATXN3 (containing a polyglutamine expansion) interacts with and inactivates the DNA strand break repair enzyme PNKP. This abrogation of PNKP's function leads to the failure of DNA repair and the persistent accumulation of DNA strand breaks. This accumulation of genomic damage serves as a potent trigger for the chronic activation of the ATM kinase signaling pathway.",
        "summary": "ATXN3 activates ATM to modulate dna damage signaling activation (pathological), ultimately affecting pro-apoptotic pathways are initiated, leading to neuronal dysfunction and cell death.",
        "evidence": [
          {
            "paper_title": "Inactivation of PNKP by Mutant ATXN3 Triggers Apoptosis by Activating the DNA Damage-Response Pathway in SCA3",
            "journal": "PLoS Genetics",
            "year": 2015,
            "relevant_quote": "In the present study, we show that the essential DNA strand break repair enzyme PNKP (polynucleotide kinase 3'-phosphatase) interacts with, and is inactivated by, the mutant ATXN3, resulting in inefficient DNA repair, persistent accumulation of DNA damage/strand breaks, and subsequent chronic activation of the DNA damage-response ataxia telangiectasia-mutated (ATM) signaling pathway in SCA3."
          }
        ],
        "pathways": [
          {
            "name": "DNA Damage Response",
            "canonical_name": "DNA Damage Response",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "PNKP --activates--> ATM:"
      },
      {
        "primary": "Mdm2",
        "interaction_type": "indirect",
        "upstream_interactor": "p53",
        "mediator_chain": [
          "p53"
        ],
        "depth": 2,
        "support_summary": "ATXN3 stabilizes p53 by removing polyubiquitin chains, thereby counteracting the activity of Mdm2, the primary E3 ligase responsible for p53's ubiquitination and degradation.",
        "functions": [
          {
            "function": "Inhibition of p53 Degradation",
            "arrow": "activates",
            "cellular_process": "Mdm2 is the principal E3 ubiquitin ligase for the tumor suppressor p53. It targets p53 for polyubiquitination, primarily with K48-linked chains, which signals for its degradation by the 26S proteasome, thereby maintaining low p53 levels in healthy, unstressed cells.",
            "effect_description": "ATXN3 directly counteracts the function of Mdm2 by acting as a deubiquitinase (DUB) for p53. ATXN3 binds to polyubiquitinated p53 and removes the ubiquitin chains that Mdm2 has attached. This deubiquitination protects p53 from proteasomal degradation, leading to its stabilization and accumulation. Therefore, ATXN3 inhibits the ultimate outcome of Mdm2's E3 ligase activity towards p53.",
            "biological_consequence": [
              "Mdm2 binds to p53 and catalyzes its polyubiquitination → ATXN3 recognizes and binds to polyubiquitinated p53 → ATXN3's Josephin domain cleaves the ubiquitin chains from p53 → p53 is stabilized and protected from proteasomal degradation → Cellular levels of p53 protein increase → p53-mediated transcriptional programs (e.g., apoptosis, cell cycle arrest) are activated."
            ],
            "specific_effects": [
              "ATXN3 directly binds to both native and polyubiquitinated p53.",
              "ATXN3 deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin-proteasome pathway.",
              "Depletion of ATXN3 results in the destabilization of p53 protein."
            ],
            "evidence": [
              {
                "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
                "journal": "PLoS Biology",
                "year": 2016,
                "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway.",
                "pmid": "27851749"
              }
            ],
            "pathway": {
              "name": "p53 Signaling Pathway",
              "canonical_name": "P53 Signaling Pathway",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "27851749"
            ],
            "direct_arrow": "inhibits",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "p53",
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "p53"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "inhibition"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Mdm2 is the principal E3 ubiquitin ligase for the tumor suppressor p53. It targets p53 for polyubiquitination, primarily with K48-linked chains, which signals for its degradation by the 26S proteasome, thereby maintaining low p53 levels in healthy, unstressed cells.",
        "effect": "ATXN3 directly counteracts the function of Mdm2 by acting as a deubiquitinase (DUB) for p53. ATXN3 binds to polyubiquitinated p53 and removes the ubiquitin chains that Mdm2 has attached. This deubiquitination protects p53 from proteasomal degradation, leading to its stabilization and accumulation. Therefore, ATXN3 inhibits the ultimate outcome of Mdm2's E3 ligase activity towards p53.",
        "summary": "ATXN3 inhibits Mdm2 to modulate inhibition of p53 degradation, ultimately affecting p53-mediated transcriptional programs (e.g., apoptosis, cell cycle arrest) are activated.",
        "evidence": [
          {
            "paper_title": "The Machado-Joseph Disease Deubiquitinase Ataxin-3 Regulates the Stability and Apoptotic Function of p53",
            "journal": "PLoS Biology",
            "year": 2016,
            "relevant_quote": "Here, we identify p53 to be a novel substrate of ATX-3. ATX-3 binds to native and polyubiquitinated p53 and deubiquitinates and stabilizes p53 by repressing its degradation through the ubiquitin (Ub)-proteasome pathway."
          }
        ],
        "pathways": [
          {
            "name": "p53 Signaling Pathway",
            "canonical_name": "P53 Signaling Pathway",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "p53 --activates--> Mdm2:"
      },
      {
        "primary": "GATA-2",
        "interaction_type": "indirect",
        "upstream_interactor": "HDAC3",
        "mediator_chain": [
          "HDAC3"
        ],
        "depth": 2,
        "support_summary": "ATXN3 is part of a repressor complex with HDAC3 that binds to the promoter of the MMP-2 gene, a GATA-2-dependent target, to repress its transcription.",
        "functions": [
          {
            "function": "Transcriptional Repression",
            "arrow": "activates",
            "cellular_process": "GATA-2 is a transcription factor that regulates the expression of various genes, including matrix metalloproteinase-2 (MMP-2). ATXN3 is a component of a transcriptional repressor complex that modulates histone acetylation at GATA-2 target promoters.",
            "effect_description": "Normal ATXN3 forms a complex with HDAC3 and NCoR, which is recruited to the promoter of the GATA-2 target gene, MMP-2. This recruitment leads to the deacetylation of histones at the promoter, resulting in a condensed chromatin state and the repression of MMP-2 transcription.",
            "biological_consequence": [
              "Normal ATXN3 interacts with HDAC3 and NCoR → Complex binds to the MMP-2 gene promoter → Histone deacetylase 3 (HDAC3) deacetylates histones at the promoter region → Chromatin condensation → Repression of GATA-2-dependent MMP-2 gene transcription."
            ],
            "specific_effects": [
              "Normal ATXN3 represses transcription of the MMP-2 gene.",
              "ATXN3 forms a repressor complex with HDAC3 and the nuclear receptor corepressor (NCoR).",
              "The ATXN3-containing complex increases histone deacetylase activity at the target promoter.",
              "Expanded (mutant) ATXN3 loses this repressor function, leading to aberrant MMP-2 transcription."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The Journal of Neuroscience",
                "year": 2006,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "17079677"
            ],
            "direct_arrow": "activates",
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "HDAC3",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "HDAC3"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "regulates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The initial claim correctly identifies that ATXN3 is involved in the transcriptional repression of a GATA-2 target gene, MMP-2. However, the input incorrectly labels this inhibitory action with an 'activates' arrow. The correct mechanism is that wild-type ATXN3 is part of a repressor complex with HDAC3 and NCoR. This complex binds to the MMP-2 promoter, leading to histone deacetylation and subsequent repression of transcription. This is an indirect regulatory relationship where ATXN3 modulates the activity of GATA-2-dependent promoters.",
        "mechanism": "GATA-2 is a transcription factor that regulates the expression of various genes, including matrix metalloproteinase-2 (MMP-2). ATXN3 is a component of a transcriptional repressor complex that modulates histone acetylation at GATA-2 target promoters.",
        "effect": "Normal ATXN3 forms a complex with HDAC3 and NCoR, which is recruited to the promoter of the GATA-2 target gene, MMP-2. This recruitment leads to the deacetylation of histones at the promoter, resulting in a condensed chromatin state and the repression of MMP-2 transcription.",
        "summary": "ATXN3 inhibits GATA-2 to modulate transcriptional repression, ultimately affecting repression of gata-2-dependent mmp-2 gene transcription.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The Journal of Neuroscience",
            "year": 2006,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulates",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "HDAC3 --regulates--> GATA-2:"
      },
      {
        "primary": "FOXO4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly interacts with the transcription factor FOXO4. Co-immunoprecipitation (Affinity Capture-Western) has confirmed that endogenous ATXN3 and FOXO4 form a complex. This interaction is involved in the transcriptional activation of the SOD2 gene in response to oxidative stress.",
        "functions": [
          {
            "function": "Transcriptional",
            "arrow": "activates",
            "cellular_process": "FOXO4 is a transcription factor that plays a crucial role in the cellular response to oxidative stress by upregulating antioxidant enzymes such as superoxide dismutase 2 (SOD2).",
            "effect_description": "In response to oxidative stress, ATXN3 and FOXO4 form a complex and translocate to the nucleus. This complex then binds to the promoter of the SOD2 gene, activating its transcription. This leads to increased production of the SOD2 enzyme, which enhances the cell's antioxidant capacity and provides protection against oxidative damage.",
            "biological_consequence": [
              "Oxidative stress signal → ATXN3 and FOXO4 translocate to the nucleus → ATXN3-FOXO4 complex formation → Concomitant binding of the complex to the SOD2 gene promoter → Increased transcription of SOD2 mRNA → Elevated synthesis of SOD2 protein → Enhanced cellular capacity to neutralize reactive oxygen species."
            ],
            "specific_effects": [
              "ATXN3 directly interacts with FOXO4 to activate FOXO4-dependent transcription of the SOD2 gene.",
              "Under oxidative stress, both ATXN3 and FOXO4 are recruited to the same region of the SOD2 gene promoter.",
              "Knockdown of endogenous ATXN3 represses the expression of SOD2.",
              "Mutant (polyQ-expanded) ATXN3 has a reduced capability to activate FOXO4-mediated SOD2 expression."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2.",
                "pmid": "21536589"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21536589"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "FOXO4 is a transcription factor that plays a crucial role in the cellular response to oxidative stress by upregulating antioxidant enzymes such as superoxide dismutase 2 (SOD2).",
        "effect": "In response to oxidative stress, ATXN3 and FOXO4 form a complex and translocate to the nucleus. This complex then binds to the promoter of the SOD2 gene, activating its transcription. This leads to increased production of the SOD2 enzyme, which enhances the cell's antioxidant capacity and provides protection against oxidative damage.",
        "summary": "ATXN3 activates FOXO4 to modulate transcriptional activation, ultimately affecting enhanced cellular capacity to neutralize reactive oxygen species.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --activates--> FOXO4:"
      },
      {
        "primary": "VDAC1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "ATXN3 directly deubiquitinates the mitochondrial protein VDAC1, as demonstrated by in vitro deubiquitination assays. This interaction links ATXN3 to the regulation of mitochondrial function and quality control.",
        "functions": [
          {
            "function": "VDAC1 Deubiquitination",
            "arrow": "activates",
            "cellular_process": "VDAC1, a protein in the outer mitochondrial membrane, is a key substrate for the E3 ligase Parkin. Parkin-mediated ubiquitination of VDAC1 on damaged mitochondria serves as a signal for their removal via mitophagy.",
            "effect_description": "Wild-type ATXN3 functions as a deubiquitinating enzyme (DUB) for VDAC1, removing ubiquitin chains that are added by Parkin. This activity modulates the overall ubiquitination status of VDAC1, thereby regulating the threshold for initiating mitophagy and maintaining mitochondrial homeostasis.",
            "biological_consequence": [
              "Mitochondrial damage → Parkin recruitment to mitochondria → Parkin ubiquitinates VDAC1 → ATXN3 removes ubiquitin chains from VDAC1 → Regulation of VDAC1 ubiquitination state → Modulation of mitophagy initiation → Maintenance of mitochondrial quality control."
            ],
            "specific_effects": [
              "Wild-type ataxin-3 deubiquitinates VDAC1 in vitro.",
              "ATXN3 removes both monoubiquitinated and polyubiquitinated forms of VDAC1.",
              "This deubiquitination activity links ATXN3 to the canonical Parkin-VDAC1-mediated mitophagy pathway.",
              "In SCA3 patient-derived fibroblasts, VDAC1 deubiquitination is altered, which is associated with dysregulation of mitophagy."
            ],
            "evidence": [
              {
                "paper_title": "Mitochondrial Dysfunction in Spinocerebellar Ataxia Type 3 Is Linked to VDAC1 Deubiquitination",
                "journal": "International Journal of Molecular Sciences",
                "year": 2022,
                "relevant_quote": "We show that wildtype ataxin-3 deubiquitinates VDAC1 (voltage-dependent anion channel 1), a member of the mitochondrial permeability transition pore and a parkin substrate.",
                "pmid": "35682609"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Quality Control",
              "canonical_name": "Mitochondrial Quality Control",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "35682609"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is largely correct but can be refined. While ATXN3 deubiquitinates VDAC1, the term 'activates' is ambiguous. The functional consequence is the modulation of mitophagy. Specifically, by removing ubiquitin chains from VDAC1, wild-type ATXN3 counteracts the Parkin-mediated signal for mitophagy, thereby regulating mitochondrial quality control. Mutant ATXN3's activity on VDAC1 impairs this process, hindering the clearance of damaged mitochondria.",
        "mechanism": "VDAC1, a protein in the outer mitochondrial membrane, is a key substrate for the E3 ligase Parkin. Parkin-mediated ubiquitination of VDAC1 on damaged mitochondria serves as a signal for their removal via mitophagy.",
        "effect": "Wild-type ATXN3 functions as a deubiquitinating enzyme (DUB) for VDAC1, removing ubiquitin chains that are added by Parkin. This activity modulates the overall ubiquitination status of VDAC1, thereby regulating the threshold for initiating mitophagy and maintaining mitochondrial homeostasis.",
        "summary": "ATXN3 interacts with VDAC1 to modulate vdac1 deubiquitination, ultimately affecting maintenance of mitochondrial quality control.",
        "evidence": [
          {
            "paper_title": "Mitochondrial Dysfunction in Spinocerebellar Ataxia Type 3 Is Linked to VDAC1 Deubiquitination",
            "journal": "International Journal of Molecular Sciences",
            "year": 2022,
            "relevant_quote": "We show that wildtype ataxin-3 deubiquitinates VDAC1 (voltage-dependent anion channel 1), a member of the mitochondrial permeability transition pore and a parkin substrate."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Quality Control",
            "canonical_name": "Mitochondrial Quality Control",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> VDAC1:"
      },
      {
        "primary": "GSK3B",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Glycogen synthase kinase 3 beta (GSK3B) directly interacts with and phosphorylates ATXN3 at Serine 256. This interaction, confirmed by affinity capture-western and in vitro reconstituted complex assays, regulates the aggregation of ATXN3.",
        "functions": [
          {
            "function": "ATXN3 Aggregation",
            "arrow": "inhibits",
            "cellular_process": "Glycogen synthase kinase 3 beta (GSK3B) is a serine/threonine kinase that directly phosphorylates ATXN3 at the Serine 256 (S256) residue.",
            "effect_description": "The phosphorylation of ATXN3 at S256 by GSK3B is a key regulatory step that prevents the formation of toxic protein aggregates, which are characteristic of Machado-Joseph disease. By maintaining ATXN3 in a monomeric state, this phosphorylation reduces its cytotoxicity.",
            "biological_consequence": [
              "GSK3B directly binds to ATXN3 → GSK3B phosphorylates ATXN3 at Serine 256 → Phosphorylated ATXN3 remains in a monomeric state → Formation of high molecular weight aggregates is prevented → Reduced cytotoxicity associated with polyQ-expanded ATXN3."
            ],
            "specific_effects": [
              "GSK3B-mediated phosphorylation at S256 inhibits the aggregation of polyQ-expanded ATXN3.",
              "An S256A mutant of ATXN3, which cannot be phosphorylated, readily forms high molecular weight aggregates.",
              "A phosphomimetic S256D mutant of ATXN3 remains monomeric, mimicking the effect of phosphorylation.",
              "The molecular chaperone Hsp70 can suppress the aggregation of the non-phosphorylatable S256A mutant."
            ],
            "evidence": [
              {
                "paper_title": "Phosphorylation of ataxin-3 by glycogen synthase kinase 3beta at serine 256 regulates the aggregation of ataxin-3",
                "journal": "Biochemical and Biophysical Research Communications",
                "year": 2007,
                "relevant_quote": "Here we show that S256 site in ataxin-3 is phosphorylated by GSK 3beta. Moreover, S256A mutant of expanded ataxin-3 forms high molecular weight protein aggregation, whereas S256D mutant and expanded ataxin-3 without mutation on this site are monomeric... Our results imply that phosphorylation of serine 256 in ataxin-3 by GSK 3beta regulates ataxin-3 aggregation.",
                "pmid": "17434145"
              }
            ],
            "pathway": {
              "name": "Protein Aggregation Pathway",
              "canonical_name": "Protein Aggregation Pathway",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "17434145"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "primary_to_main",
            "function_effect": "inhibition"
          }
        ],
        "arrow": "regulates",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates",
            "inhibits"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Glycogen synthase kinase 3 beta (GSK3B) is a serine/threonine kinase that directly phosphorylates ATXN3 at the Serine 256 (S256) residue.",
        "effect": "The phosphorylation of ATXN3 at S256 by GSK3B is a key regulatory step that prevents the formation of toxic protein aggregates, which are characteristic of Machado-Joseph disease. By maintaining ATXN3 in a monomeric state, this phosphorylation reduces its cytotoxicity.",
        "summary": "ATXN3 inhibits GSK3B to modulate atxn3 aggregation, ultimately affecting reduced cytotoxicity associated with polyq-expanded atxn3.",
        "evidence": [
          {
            "paper_title": "Phosphorylation of ataxin-3 by glycogen synthase kinase 3beta at serine 256 regulates the aggregation of ataxin-3",
            "journal": "Biochemical and Biophysical Research Communications",
            "year": 2007,
            "relevant_quote": "Here we show that S256 site in ataxin-3 is phosphorylated by GSK 3beta. Moreover, S256A mutant of expanded ataxin-3 forms high molecular weight protein aggregation, whereas S256D mutant and expanded ataxin-3 without mutation on this site are monomeric... Our results imply that phosphorylation of serine 256 in ataxin-3 by GSK 3beta regulates ataxin-3 aggregation."
          }
        ],
        "pathways": [
          {
            "name": "Protein Aggregation Pathway",
            "canonical_name": "Protein Aggregation Pathway",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "regulation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--regulates-- GSK3B:"
      },
      {
        "primary": "TAF4",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "As part of its role in transcriptional regulation, ATXN3 is known to interact with TATA box-binding protein (TBP)-associated factor 4 (TAF4), a component of the TFIID general transcription factor complex.",
        "functions": [
          {
            "function": "Transcriptional",
            "arrow": "regulates",
            "cellular_process": "TAF4 is a component of the general transcription factor TFIID, which is essential for the initiation of transcription by RNA polymerase II. ATXN3's interaction with TAF4 suggests its involvement in modulating the assembly or activity of the preinitiation complex at gene promoters.",
            "effect_description": "ATXN3 interacts with TAF4, a subunit of the TFIID complex. This interaction places ATXN3 in proximity to the core transcriptional machinery, indicating a role in regulating gene expression. However, whether this interaction leads to transcriptional activation or repression is likely context-dependent and promoter-specific.",
            "biological_consequence": [
              "ATXN3 binds to TAF4 → ATXN3 is recruited to the TFIID complex at gene promoters → Modulation of preinitiation complex assembly or function → Regulation of transcription initiation for specific target genes."
            ],
            "specific_effects": [
              "ATXN3 physically interacts with TATA box-binding protein (TBP)-associated factor 4 (TAF4)."
            ],
            "evidence": [
              {
                "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
                "journal": "International Journal of Molecular Sciences",
                "year": 2021,
                "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)...",
                "pmid": "24293103"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "24293103"
            ],
            "interaction_effect": "regulates",
            "interaction_direction": "main_to_primary",
            "function_effect": "regulation"
          }
        ],
        "arrow": "binds",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The provided information is superficial. The interaction is mentioned in a review, but the primary literature detailing the direct binding and its precise functional consequence (activation vs. repression, and on which specific gene targets) is not cited. The claim of 'activates' is an oversimplification without further context.",
        "mechanism": "TAF4 is a component of the general transcription factor TFIID, which is essential for the initiation of transcription by RNA polymerase II. ATXN3's interaction with TAF4 suggests its involvement in modulating the assembly or activity of the preinitiation complex at gene promoters.",
        "effect": "ATXN3 interacts with TAF4, a subunit of the TFIID complex. This interaction places ATXN3 in proximity to the core transcriptional machinery, indicating a role in regulating gene expression. However, whether this interaction leads to transcriptional activation or repression is likely context-dependent and promoter-specific.",
        "summary": "ATXN3 interacts with TAF4 to modulate transcriptional regulation, ultimately affecting regulation of transcription initiation for specific target genes.",
        "evidence": [
          {
            "paper_title": "Ataxin-3 Protein and RNA Toxicity in Spinocerebellar Ataxia Type 3: Current Insights and Emerging Therapeutic Strategies",
            "journal": "International Journal of Molecular Sciences",
            "year": 2021,
            "relevant_quote": "Transcriptional regulation by ataxin-3 might arise through different mechanisms, since ataxin-3 is known to interact with numerous transcriptional regulators such as TATA box-binding protein (TBP)-associated factor 4 (TAF4)..."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> TAF4:"
      },
      {
        "primary": "FBXL3",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "FBXL3, a component of the SKP1-Cullin-F-box (SCF) ubiquitin ligase complex, was identified in a druggable genome screen as a modulator of ATXN3 levels, suggesting it is involved in the ubiquitin-dependent degradation of ATXN3.",
        "functions": [
          {
            "function": "ATXN3 Degradation",
            "arrow": "activates",
            "cellular_process": "FBXL3 is an F-box protein that serves as a substrate recognition component of the SKP1-Cullin1-F-box (SCF) E3 ubiquitin ligase complex. This complex targets specific proteins for ubiquitination, marking them for subsequent degradation by the proteasome.",
            "effect_description": "FBXL3 mediates the ubiquitination and subsequent proteasomal degradation of ATXN3. Overexpression of FBXL3 leads to a reduction in both wild-type and pathogenic ATXN3 protein levels, and this effect is dependent on the SCF complex component CUL1. This indicates that FBXL3 is a key regulator of ATXN3 protein turnover.",
            "biological_consequence": [
              "FBXL3, as part of the SCF complex, recognizes and binds to ATXN3 → The SCF-FBXL3 complex polyubiquitinates ATXN3 → Ubiquitinated ATXN3 is targeted to the proteasome for degradation → Cellular levels of ATXN3 protein are reduced."
            ],
            "specific_effects": [
              "Overexpression of FBXL3 reduces the levels of both wild-type and mutant ATXN3 proteins.",
              "The FBXL3-mediated reduction of ATXN3 levels occurs at the protein level, not the transcriptional level.",
              "The degradation of ATXN3 by FBXL3 is dependent on the presence of CUL1, a core component of the SCF ubiquitin ligase complex."
            ],
            "evidence": [
              {
                "paper_title": "Druggable genome screen identifies new regulators of the abundance and toxicity of ATXN3, the Spinocerebellar Ataxia Type 3 disease protein",
                "journal": "PLoS Genetics",
                "year": 2021,
                "relevant_quote": "If FBXL3 knockdown increases ATXN3 abundance, then its overexpression would be expected to decrease ATXN3 protein levels. Indeed, exogenous FBXL3 in SCA3 NPCs reduced the levels of both wild-type and pathogenic ATXN3 in a SCF- and CUL1-dependent manner, confirming that ATXN3 is a bona fide substrate of the SCFFBXL3 ubiquitin ligase complex.",
                "pmid": "31783119"
              }
            ],
            "pathway": {
              "name": "Ubiquitin-Proteasome System",
              "canonical_name": "Ubiquitin-Proteasome System",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "31783119"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "primary_to_main",
            "function_effect": "activation"
          }
        ],
        "arrow": "inhibits",
        "direction": "primary_to_main",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "FBXL3 is an F-box protein that serves as a substrate recognition component of the SKP1-Cullin1-F-box (SCF) E3 ubiquitin ligase complex. This complex targets specific proteins for ubiquitination, marking them for subsequent degradation by the proteasome.",
        "effect": "FBXL3 mediates the ubiquitination and subsequent proteasomal degradation of ATXN3. Overexpression of FBXL3 leads to a reduction in both wild-type and pathogenic ATXN3 protein levels, and this effect is dependent on the SCF complex component CUL1. This indicates that FBXL3 is a key regulator of ATXN3 protein turnover.",
        "summary": "ATXN3 activates FBXL3 to modulate atxn3 degradation, ultimately affecting cellular levels of atxn3 protein are reduced.",
        "evidence": [
          {
            "paper_title": "Druggable genome screen identifies new regulators of the abundance and toxicity of ATXN3, the Spinocerebellar Ataxia Type 3 disease protein",
            "journal": "PLoS Genetics",
            "year": 2021,
            "relevant_quote": "If FBXL3 knockdown increases ATXN3 abundance, then its overexpression would be expected to decrease ATXN3 protein levels. Indeed, exogenous FBXL3 in SCA3 NPCs reduced the levels of both wild-type and pathogenic ATXN3 in a SCF- and CUL1-dependent manner, confirming that ATXN3 is a bona fide substrate of the SCFFBXL3 ubiquitin ligase complex."
          }
        ],
        "pathways": [
          {
            "name": "Ubiquitin-Proteasome System",
            "canonical_name": "Ubiquitin-Proteasome System",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 3
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 <--inhibits-- FBXL3:"
      },
      {
        "primary": "PAFAH1B1",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Proteomic analysis using Affinity Capture-Mass Spectrometry identified Platelet-activating factor acetylhydrolase IB subunit alpha (PAFAH1B1) as a direct interactor of ATXN3.",
        "functions": [
          {
            "function": "Dynein-Mediated Transport",
            "arrow": "activates",
            "cellular_process": "PAFAH1B1, also known as LIS1, is a crucial regulator of the cytoplasmic dynein motor complex, which is responsible for retrograde transport along microtubules. ATXN3 has been identified as an adaptor protein that links polyubiquitinated cargo to the dynein motor for transport to perinuclear aggresomes for degradation. The physical interaction between ATXN3 and PAFAH1B1 suggests a cooperative mechanism in the regulation of cellular transport machinery.",
            "effect_description": "The interaction between ATXN3 and PAFAH1B1 likely serves to coordinate cargo binding with the regulation of the dynein motor's activity. This could ensure that the motor is appropriately engaged and processive when transporting specific cargo, such as misfolded proteins, thereby maintaining proteostasis.",
            "biological_consequence": [
              "ATXN3 binds polyubiquitinated cargo → ATXN3 acts as an adaptor to the dynein motor complex → ATXN3 interacts with the dynein regulator PAFAH1B1/LIS1 → Coordinated regulation of dynein motor activity for retrograde transport → Cargo is transported to the aggresome for degradation → Clearance of misfolded proteins"
            ],
            "specific_effects": [
              "PAFAH1B1 (LIS1) is a key regulator of the dynein motor protein, stabilizing it in a high microtubule-binding state.",
              "ATXN3 functions as an adaptor protein, linking substrates to the dynein motor to facilitate their retrograde transport to the aggresome.",
              "The direct interaction, identified by affinity capture mass spectrometry, implies a functional collaboration in the regulation of cytoskeletal transport, although the precise molecular outcome of the interaction is not yet defined."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
                "journal": "Expert Reviews in Molecular Medicine",
                "year": 2024,
                "relevant_quote": "ATXN3 was furthermore proposed to act as an adaptor to link polyubiquitinated substrates to the dynein motor protein, thus facilitating the retrograde transportation of the substrates to the aggresomes, cellular perinuclear structures formed by the aggregation of misfolded proteins due to overwhelming protein degradation in the cell.",
                "pmid": "39320846"
              },
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "Furthermore, ataxin-3 regulates cytoskeleton function by interacting with dynein, an essential protein in retrograde axonal transport.",
                "pmid": "37033372"
              }
            ],
            "pathway": {
              "name": "Microtubule-Based Transport",
              "canonical_name": "Microtubule-Based Transport",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "39320846",
              "37033372"
            ],
            "interaction_effect": "activates",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "arrow": "binds",
        "direction": "main_to_primary",
        "is_valid": true,
        "mechanism_correction": "The direct interaction is supported by proteomic evidence. However, the functional consequence of this specific interaction is not yet elucidated in primary literature. The input claim that ATXN3 'activates' dynein-mediated transport *via* PAFAH1B1 is a hypothesis based on the known functions of both proteins, not a demonstrated mechanism. Both proteins are independently involved in regulating the dynein motor complex. ATXN3 acts as an adaptor for cargo, while PAFAH1B1 (LIS1) is a core regulator of dynein's motor activity. Their interaction suggests a functional link, potentially coordinating cargo loading with motor regulation, but this requires experimental validation.",
        "intent": "ubiquitination",
        "mechanism": "PAFAH1B1, also known as LIS1, is a crucial regulator of the cytoplasmic dynein motor complex, which is responsible for retrograde transport along microtubules. ATXN3 has been identified as an adaptor protein that links polyubiquitinated cargo to the dynein motor for transport to perinuclear aggresomes for degradation. The physical interaction between ATXN3 and PAFAH1B1 suggests a cooperative mechanism in the regulation of cellular transport machinery.",
        "effect": "The interaction between ATXN3 and PAFAH1B1 likely serves to coordinate cargo binding with the regulation of the dynein motor's activity. This could ensure that the motor is appropriately engaged and processive when transporting specific cargo, such as misfolded proteins, thereby maintaining proteostasis.",
        "summary": "ATXN3 interacts with PAFAH1B1 to modulate regulation of dynein-mediated transport, ultimately affecting clearance of misfolded proteins.",
        "evidence": [
          {
            "paper_title": "ATXN3: a multifunctional protein involved in the polyglutamine disease spinocerebellar ataxia type 3",
            "journal": "Expert Reviews in Molecular Medicine",
            "year": 2024,
            "relevant_quote": "ATXN3 was furthermore proposed to act as an adaptor to link polyubiquitinated substrates to the dynein motor protein, thus facilitating the retrograde transportation of the substrates to the aggresomes, cellular perinuclear structures formed by the aggregation of misfolded proteins due to overwhelming protein degradation in the cell."
          },
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "Furthermore, ataxin-3 regulates cytoskeleton function by interacting with dynein, an essential protein in retrograde axonal transport."
          }
        ],
        "pathways": [
          {
            "name": "Microtubule-Based Transport",
            "canonical_name": "Microtubule-Based Transport",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> PAFAH1B1:"
      },
      {
        "primary": "NDUFA8",
        "interaction_type": "direct",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Affinity Capture-Mass Spectrometry analysis identified NDUFA8, a subunit of the mitochondrial respiratory chain complex I, as a novel interaction partner of ATXN3, linking it to mitochondrial function.",
        "functions": [
          {
            "function": "Mitochondrial Respiration",
            "arrow": "activates",
            "cellular_process": "NDUFA8 is a subunit of Complex I (NADH:ubiquitone oxidoreductase), the first and largest enzyme complex of the mitochondrial electron transport chain. Wild-type ATXN3 interacts with NDUFA8 and other mitochondrial proteins, suggesting a role in maintaining the assembly, stability, or function of Complex I.",
            "effect_description": "The interaction between wild-type ATXN3 and NDUFA8 supports the integrity of mitochondrial Complex I, which is essential for efficient cellular respiration and ATP production. In SCA3, the polyglutamine expansion in mutant ATXN3 significantly weakens this interaction, leading to impaired Complex I function, reduced energy production, and contributing to the overall mitochondrial dysfunction observed in the disease.",
            "biological_consequence": [
              "Wild-type ATXN3 binds to NDUFA8 → Interaction supports the stability and assembly of Mitochondrial Complex I → Efficient electron transport and ATP production → Maintenance of neuronal energy homeostasis → PolyQ expansion in mutant ATXN3 weakens the interaction → Impaired Complex I function → Mitochondrial dysfunction in SCA3"
            ],
            "specific_effects": [
              "NDUFA8 is a core subunit of the mitochondrial respiratory chain Complex I.",
              "Proteomic analysis of a knock-in mouse model of SCA3 (Ki150) revealed that mutant ataxin-3 has a significantly weakened interaction with a cluster of mitochondrial proteins, including Complex I subunits.",
              "This impaired interaction is a key molecular feature of SCA3 pathology, linking the mutant protein directly to neuronal energy deficits."
            ],
            "evidence": [
              {
                "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2023,
                "relevant_quote": "The mutant ataxin-3 demonstrated very weak interactions with mitochondrial proteins (second cluster) in the Ki150 cerebellum and Ki150 cerebral cortex.",
                "pmid": "37033372"
              },
              {
                "paper_title": "Mass spectrometry analyses of normal and polyglutamine expanded ataxin-3 reveal novel interaction partners involved in mitochondrial function",
                "journal": "Neurochemistry International",
                "year": 2018,
                "relevant_quote": "Hence, we analyzed the repertoire of proteins interacting with normal and polyQ expanded ataxin-3 by mass spectrometry. This showed that both normal and polyQ expanded ataxin-3 interacted with components of the protein quality control system and mitochondria... The analyses underline the role of ataxin-3 in ubiquitin biology and point towards a role in mitochondrial biology.",
                "pmid": "29111377"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Electron Transport Chain",
              "canonical_name": "Mitochondrial Electron Transport Chain",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "37033372",
              "29111377"
            ],
            "interaction_effect": "activation",
            "interaction_direction": "main_to_primary",
            "function_effect": "activation"
          }
        ],
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "arrow": "binds",
        "direction": "main_to_primary",
        "is_valid": true,
        "mechanism_correction": null,
        "intent": "regulation",
        "mechanism": "NDUFA8 is a subunit of Complex I (NADH:ubiquitone oxidoreductase), the first and largest enzyme complex of the mitochondrial electron transport chain. Wild-type ATXN3 interacts with NDUFA8 and other mitochondrial proteins, suggesting a role in maintaining the assembly, stability, or function of Complex I.",
        "effect": "The interaction between wild-type ATXN3 and NDUFA8 supports the integrity of mitochondrial Complex I, which is essential for efficient cellular respiration and ATP production. In SCA3, the polyglutamine expansion in mutant ATXN3 significantly weakens this interaction, leading to impaired Complex I function, reduced energy production, and contributing to the overall mitochondrial dysfunction observed in the disease.",
        "summary": "ATXN3 interacts with NDUFA8 to modulate mitochondrial respiration, ultimately affecting mitochondrial dysfunction in sca3.",
        "evidence": [
          {
            "paper_title": "Impaired interactions of ataxin-3 with protein complexes reveals their specific structure and functions in SCA3 Ki150 model",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2023,
            "relevant_quote": "The mutant ataxin-3 demonstrated very weak interactions with mitochondrial proteins (second cluster) in the Ki150 cerebellum and Ki150 cerebral cortex."
          },
          {
            "paper_title": "Mass spectrometry analyses of normal and polyglutamine expanded ataxin-3 reveal novel interaction partners involved in mitochondrial function",
            "journal": "Neurochemistry International",
            "year": 2018,
            "relevant_quote": "Hence, we analyzed the repertoire of proteins interacting with normal and polyQ expanded ataxin-3 by mass spectrometry. This showed that both normal and polyQ expanded ataxin-3 interacted with components of the protein quality control system and mitochondria... The analyses underline the role of ataxin-3 in ubiquitin biology and point towards a role in mitochondrial biology."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Electron Transport Chain",
            "canonical_name": "Mitochondrial Electron Transport Chain",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> NDUFA8:"
      },
      {
        "primary": "RSF1",
        "interaction_type": "indirect",
        "upstream_interactor": null,
        "mediator_chain": [],
        "depth": 1,
        "support_summary": "Remodeling and spacing factor 1 (RSF1), a chromatin remodeling protein, was identified as a direct interactor of ATXN3 through Affinity Capture-Mass Spectrometry.",
        "functions": [
          {
            "function": "Chromatin Remodeling and Transcriptional",
            "arrow": "inhibits",
            "cellular_process": "RSF1 (Remodeling and spacing factor 1) is the core subunit of the RSF complex, an ATP-dependent chromatin remodeler that positions nucleosomes to regulate gene expression and DNA repair. ATXN3 is also a nuclear protein that modulates transcription, in part by binding chromatin and recruiting co-repressors like HDAC3 to promote a more compact chromatin state.",
            "effect_description": "The physical interaction between ATXN3 and RSF1 suggests a functional link between two different modes of chromatin regulation: histone modification (via ATXN3-recruited HDACs) and nucleosome remodeling (via RSF1). This cooperation could provide a mechanism for more precise control over chromatin accessibility and gene expression. However, the specific targets and functional outcome of this collaboration are currently unknown.",
            "biological_consequence": [
              "ATXN3 binds to specific chromatin regions → ATXN3 recruits HDAC3, leading to histone deacetylation → ATXN3 interacts with the chromatin remodeler RSF1 → Coordinated histone modification and nucleosome repositioning → Altered chromatin accessibility → Transcriptional repression of target genes"
            ],
            "specific_effects": [
              "RSF1 is an ATP-dependent chromatin remodeling factor that alters nucleosome positioning.",
              "ATXN3 recruits the histone deacetylase HDAC3 to chromatin, promoting a condensed, transcriptionally repressive state.",
              "The interaction between ATXN3 and RSF1 was identified by affinity capture mass spectrometry, but the functional consequence of this direct interaction has not been characterized."
            ],
            "evidence": [
              {
                "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
                "journal": "Nucleic Acids Research",
                "year": 2023,
                "relevant_quote": "The lack of ATXN3 leads to abnormalities in nuclear and nucleolar morphology, alters DNA replication timing and increases transcription. Additionally, indicators of more open chromatin... were detected in the absence of ATXN3. Interestingly, the effects observed in cells lacking ATXN3 are epistatic to the inhibition or lack of the histone deacetylase 3 (HDAC3), an interaction partner of ATXN3.",
                "pmid": "36971114"
              },
              {
                "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
                "journal": "The EMBO Journal",
                "year": 2009,
                "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter.",
                "pmid": "17079677"
              }
            ],
            "pathway": {
              "name": "Chromatin Remodeling",
              "canonical_name": "Chromatin Remodeling",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "36971114",
              "17079677"
            ],
            "interaction_effect": "inhibits",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": null,
              "direct_arrow": "inhibits",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "direct_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "inhibition"
          }
        ],
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "arrow": "binds",
        "direction": "main_to_primary",
        "is_valid": true,
        "mechanism_correction": "The direct interaction is supported by proteomic data. However, the functional description is hypothetical. The input claim that ATXN3 'activates' this process is incorrect and unsupported. Both proteins are known to function in chromatin dynamics—RSF1 as a nucleosome remodeler and ATXN3 as a transcriptional repressor that recruits HDAC3. Their interaction suggests they may cooperate in regulating gene expression, but the precise mechanism and the outcome of their interaction on specific gene targets have not been experimentally demonstrated.",
        "intent": "regulation",
        "mechanism": "RSF1 (Remodeling and spacing factor 1) is the core subunit of the RSF complex, an ATP-dependent chromatin remodeler that positions nucleosomes to regulate gene expression and DNA repair. ATXN3 is also a nuclear protein that modulates transcription, in part by binding chromatin and recruiting co-repressors like HDAC3 to promote a more compact chromatin state.",
        "effect": "The physical interaction between ATXN3 and RSF1 suggests a functional link between two different modes of chromatin regulation: histone modification (via ATXN3-recruited HDACs) and nucleosome remodeling (via RSF1). This cooperation could provide a mechanism for more precise control over chromatin accessibility and gene expression. However, the specific targets and functional outcome of this collaboration are currently unknown.",
        "summary": "ATXN3 interacts with RSF1 to modulate chromatin remodeling and transcriptional regulation, ultimately affecting transcriptional repression of target genes.",
        "evidence": [
          {
            "paper_title": "ATXN3 controls DNA replication and transcription by regulating chromatin structure",
            "journal": "Nucleic Acids Research",
            "year": 2023,
            "relevant_quote": "The lack of ATXN3 leads to abnormalities in nuclear and nucleolar morphology, alters DNA replication timing and increases transcription. Additionally, indicators of more open chromatin... were detected in the absence of ATXN3. Interestingly, the effects observed in cells lacking ATXN3 are epistatic to the inhibition or lack of the histone deacetylase 3 (HDAC3), an interaction partner of ATXN3."
          },
          {
            "paper_title": "Ataxin-3 represses transcription via chromatin binding, interaction with histone deacetylase 3, and histone deacetylation",
            "journal": "The EMBO Journal",
            "year": 2009,
            "relevant_quote": "Here we report that normal AT3 binds to target DNA sequences in specific chromatin regions of the matrix metalloproteinase-2 (MMP-2) gene promoter and represses transcription by recruitment of the histone deacetylase 3 (HDAC3), the nuclear receptor corepressor (NCoR), and deacetylation of histones bound to the promoter."
          }
        ],
        "pathways": [
          {
            "name": "Chromatin Remodeling",
            "canonical_name": "Chromatin Remodeling",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "binding",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 2
        },
        "_arrow_validated": true,
        "arrow_notation": "ATXN3 --binds--> RSF1:"
      },
      {
        "primary": "SOD2",
        "interaction_type": "indirect",
        "upstream_interactor": "FOXO4",
        "mediator_chain": [
          "FOXO4"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly regulates the expression of Superoxide Dismutase 2 (SOD2). ATXN3 and FOXO4 form a complex that binds to the SOD2 gene promoter, enhancing its transcription as part of the oxidative stress response.",
        "functions": [
          {
            "function": "Transcriptional Co-activation",
            "arrow": "activates",
            "cellular_process": "Superoxide Dismutase 2 (SOD2) is a mitochondrial antioxidant enzyme crucial for detoxifying superoxide radicals. Its expression is a key component of the cellular response to oxidative stress.",
            "effect_description": "Under conditions of oxidative stress, wild-type ATXN3 interacts with the transcription factor FOXO4. This complex translocates to the nucleus and binds to the promoter of the SOD2 gene, enhancing its transcription and increasing the synthesis of the SOD2 enzyme to protect the cell from damage.",
            "biological_consequence": [
              "Oxidative stress → ATXN3 and FOXO4 translocate to the nucleus → ATXN3-FOXO4 complex forms → Complex binds to the SOD2 gene promoter → FOXO4-dependent transcription of SOD2 is activated → SOD2 protein levels increase → Enhanced detoxification of mitochondrial superoxide radicals → Cellular protection against oxidative damage"
            ],
            "specific_effects": [
              "ATXN3 acts as a transcriptional co-activator for FOXO4-mediated SOD2 expression.",
              "The ATXN3-FOXO4 complex concomitantly binds to the SOD2 promoter.",
              "Mutant ATXN3 exhibits a reduced capability to activate FOXO4-mediated SOD2 expression and interferes with the binding of FOXO4 to the SOD2 promoter."
            ],
            "evidence": [
              {
                "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
                "journal": "Human Molecular Genetics",
                "year": 2011,
                "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2.",
                "pmid": "21536589"
              }
            ],
            "pathway": {
              "name": "Transcriptional Regulation",
              "canonical_name": "Transcription",
              "ontology_id": "GO:0006351",
              "ontology_source": "GO",
              "confidence": 0.8
            },
            "pmids": [
              "21536589"
            ],
            "direct_arrow": "activates",
            "function_effect": "activation",
            "arrow_context": {
              "direct_from": "FOXO4",
              "direct_arrow": "activates",
              "net_from": "ATXN3",
              "net_arrow": "activates",
              "mediator_chain": [
                "FOXO4"
              ],
              "is_indirect": true
            },
            "net_arrow": "activates",
            "net_effect": "activation",
            "direct_effect": "activation"
          }
        ],
        "arrow": "activates",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": null,
        "mechanism": "Superoxide Dismutase 2 (SOD2) is a mitochondrial antioxidant enzyme crucial for detoxifying superoxide radicals. Its expression is a key component of the cellular response to oxidative stress.",
        "effect": "Under conditions of oxidative stress, wild-type ATXN3 interacts with the transcription factor FOXO4. This complex translocates to the nucleus and binds to the promoter of the SOD2 gene, enhancing its transcription and increasing the synthesis of the SOD2 enzyme to protect the cell from damage.",
        "summary": "ATXN3 activates SOD2 to modulate transcriptional co-activation, ultimately affecting cellular protection against oxidative damage.",
        "evidence": [
          {
            "paper_title": "FOXO4-dependent upregulation of superoxide dismutase-2 in response to oxidative stress is impaired in spinocerebellar ataxia type 3",
            "journal": "Human Molecular Genetics",
            "year": 2011,
            "relevant_quote": "Here, we show that ATXN3 interacts with the forkhead box O (FOXO) transcription factor FOXO4 and activates the FOXO4-dependent transcription of the manganese superoxide dismutase (SOD2) gene. Upon oxidative stress, ATXN3 and FOXO4 translocate to the nucleus, concomitantly bind to the SOD2 gene promoter and increase the expression of the antioxidant enzyme SOD2."
          }
        ],
        "pathways": [
          {
            "name": "Transcriptional Regulation",
            "canonical_name": "Transcription",
            "ontology_id": "GO:0006351",
            "ontology_source": "GO",
            "confidence": 0.8
          }
        ],
        "interaction_effect": "activation",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "FOXO4 --activates--> SOD2:"
      },
      {
        "primary": "Mfn1",
        "interaction_type": "indirect",
        "upstream_interactor": "VDAC1",
        "mediator_chain": [
          "VDAC1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly affects the levels of Mitofusin-1 (Mfn1). Expression of a toxic, truncated fragment of mutant ATXN3 leads to decreased expression of Mfn1, disrupting mitochondrial fusion dynamics.",
        "functions": [
          {
            "function": "Mitochondrial Fusion",
            "arrow": "inhibits",
            "cellular_process": "Mitofusin-1 (Mfn1) is a GTPase on the outer mitochondrial membrane that is essential for mitochondrial fusion. This process is vital for maintaining a healthy, interconnected mitochondrial network, which supports cellular energy production and quality control.",
            "effect_description": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), proteolytic cleavage of mutant ATXN3 produces a toxic C-terminal fragment. The expression of this truncated fragment leads to a decrease in the expression of Mfn1, which disrupts the mitochondrial fusion process and promotes mitochondrial fission, ultimately contributing to mitochondrial dysfunction and neurodegeneration.",
            "biological_consequence": [
              "Expression of truncated mutant ATXN3 fragment → Decreased expression of Mfn1 protein → Impaired outer mitochondrial membrane fusion → Increased mitochondrial fission and fragmentation → Disrupted mitochondrial network dynamics → Mitochondrial dysfunction → Increased reactive oxygen species and cell death"
            ],
            "specific_effects": [
              "Expression of a truncated C-terminal fragment of mutant ATXN3 causes a significant decrease in the protein levels of Mfn1.",
              "This reduction in Mfn1 contributes to a shift from mitochondrial fusion to fission, resulting in fragmented mitochondria."
            ],
            "evidence": [
              {
                "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2017,
                "relevant_quote": "In addition, truncated mutant ATXN3 caused more mitochondrial fission, and decreased the expression of mitochondrial fusion markers, including Mfn-1 and Mfn-2.",
                "pmid": "28676741"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Dynamics",
              "canonical_name": "Mitochondrial Dynamics",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28676741"
            ],
            "direct_arrow": "regulates",
            "interaction_effect": "inhibition",
            "interaction_direction": "main_to_primary",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": "VDAC1",
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [
                "VDAC1"
              ],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim is contextually erroneous. The effect described is specific to a toxic, truncated fragment of MUTANT ATXN3, not the normal protein. The effect is a DECREASE in Mfn1 expression, making the 'activates' arrow incorrect for the pathogenic context. The mediator is not VDAC1; the effect is a downstream consequence of the toxic fragment's presence. The primary evidence has been corrected to a more relevant publication.",
        "mechanism": "Mitofusin-1 (Mfn1) is a GTPase on the outer mitochondrial membrane that is essential for mitochondrial fusion. This process is vital for maintaining a healthy, interconnected mitochondrial network, which supports cellular energy production and quality control.",
        "effect": "In the context of Spinocerebellar Ataxia Type 3 (SCA3), proteolytic cleavage of mutant ATXN3 produces a toxic C-terminal fragment. The expression of this truncated fragment leads to a decrease in the expression of Mfn1, which disrupts the mitochondrial fusion process and promotes mitochondrial fission, ultimately contributing to mitochondrial dysfunction and neurodegeneration.",
        "summary": "ATXN3 inhibits Mfn1 to modulate mitochondrial fusion, ultimately affecting increased reactive oxygen species and cell death.",
        "evidence": [
          {
            "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2017,
            "relevant_quote": "In addition, truncated mutant ATXN3 caused more mitochondrial fission, and decreased the expression of mitochondrial fusion markers, including Mfn-1 and Mfn-2."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Dynamics",
            "canonical_name": "Mitochondrial Dynamics",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "VDAC1 --inhibits--> Mfn1:"
      },
      {
        "primary": "Mfn2",
        "interaction_type": "indirect",
        "upstream_interactor": "VDAC1",
        "mediator_chain": [
          "VDAC1"
        ],
        "depth": 2,
        "support_summary": "ATXN3 indirectly influences the levels of Mitofusin-2 (Mfn2). The presence of a toxic, truncated fragment of mutant ATXN3 causes a reduction in Mfn2 expression, impairing mitochondrial fusion.",
        "functions": [
          {
            "function": "Mitochondrial Fusion",
            "arrow": "inhibits",
            "cellular_process": "Mitofusin-2 (Mfn2) is a key protein on the outer mitochondrial membrane that, along with Mfn1, mediates mitochondrial fusion. Mfn2 is also involved in maintaining the contact sites between mitochondria and the endoplasmic reticulum (ER).",
            "effect_description": "In Spinocerebellar Ataxia Type 3 (SCA3), a truncated C-terminal fragment of mutant ATXN3 is produced. This toxic fragment causes a reduction in the expression of Mfn2. The loss of Mfn2 impairs mitochondrial fusion, leading to a fragmented mitochondrial network, mitochondrial dysfunction, and contributes to neuronal cell death.",
            "biological_consequence": [
              "Expression of truncated mutant ATXN3 fragment → Reduced expression of Mfn2 protein → Impaired mitochondrial fusion → Increased mitochondrial fragmentation → Mitochondrial dysfunction and potential disruption of ER-mitochondria contacts → Neuronal death"
            ],
            "specific_effects": [
              "The presence of a truncated mutant ATXN3 fragment leads to decreased protein levels of Mfn2.",
              "Reduced Mfn2 levels disrupt mitochondrial dynamics, favoring fission over fusion."
            ],
            "evidence": [
              {
                "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
                "journal": "Frontiers in Molecular Neuroscience",
                "year": 2017,
                "relevant_quote": "In this study, truncated ATXN3 led to more mitochondrial fission (Figure 3), and decreased levels of Mfn-1 and Mfn-2, not OPA1 and Drp-1, were observed (Figure 4).",
                "pmid": "28676741"
              }
            ],
            "pathway": {
              "name": "Mitochondrial Dynamics",
              "canonical_name": "Mitochondrial Dynamics",
              "ontology_id": null,
              "ontology_source": null,
              "confidence": 0.8
            },
            "pmids": [
              "28676741"
            ],
            "direct_arrow": "regulates",
            "function_effect": "inhibition",
            "arrow_context": {
              "direct_from": "VDAC1",
              "direct_arrow": "regulates",
              "net_from": "ATXN3",
              "net_arrow": "inhibits",
              "mediator_chain": [
                "VDAC1"
              ],
              "is_indirect": true
            },
            "net_arrow": "inhibits",
            "net_effect": "inhibition",
            "direct_effect": "regulation"
          }
        ],
        "arrow": "inhibits",
        "direction": "main_to_primary",
        "intent": "regulation",
        "arrows": {
          "main_to_primary": [
            "activates"
          ]
        },
        "is_valid": true,
        "mechanism_correction": "The input claim contains a contextual error. The described effect is specific to a toxic fragment of MUTANT ATXN3 and results in a DECREASE in Mfn2 levels, making the 'activates' arrow incorrect in the disease context. The link to VDAC1 as a mediator for this specific effect is not supported by primary literature; the effect is a downstream consequence of the toxic fragment. The primary evidence has been corrected.",
        "mechanism": "Mitofusin-2 (Mfn2) is a key protein on the outer mitochondrial membrane that, along with Mfn1, mediates mitochondrial fusion. Mfn2 is also involved in maintaining the contact sites between mitochondria and the endoplasmic reticulum (ER).",
        "effect": "In Spinocerebellar Ataxia Type 3 (SCA3), a truncated C-terminal fragment of mutant ATXN3 is produced. This toxic fragment causes a reduction in the expression of Mfn2. The loss of Mfn2 impairs mitochondrial fusion, leading to a fragmented mitochondrial network, mitochondrial dysfunction, and contributes to neuronal cell death.",
        "summary": "ATXN3 inhibits Mfn2 to modulate mitochondrial fusion, ultimately affecting neuronal death.",
        "evidence": [
          {
            "paper_title": "The Truncated C-terminal Fragment of Mutant ATXN3 Disrupts Mitochondria Dynamics in Spinocerebellar Ataxia Type 3 Models",
            "journal": "Frontiers in Molecular Neuroscience",
            "year": 2017,
            "relevant_quote": "In this study, truncated ATXN3 led to more mitochondrial fission (Figure 3), and decreased levels of Mfn-1 and Mfn-2, not OPA1 and Drp-1, were observed (Figure 4)."
          }
        ],
        "pathways": [
          {
            "name": "Mitochondrial Dynamics",
            "canonical_name": "Mitochondrial Dynamics",
            "ontology_id": null,
            "ontology_source": null,
            "confidence": 0.8
          }
        ],
        "interaction_effect": "inhibition",
        "_validation_metadata": {
          "validated": true,
          "validator": "arrow_effect_validator",
          "corrections_applied": 1
        },
        "_arrow_validated": true,
        "arrow_notation": "VDAC1 --inhibits--> Mfn2:"
      }
    ]
  }
}