{
  "primary": "VCP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "ATXN3 contains a VCP binding motif and their interaction is confirmed by pulldown assays, playing a role in ER-associated degradation (ERAD).",
  "functions": [
    {
      "function": "ER-Associated Degradation (ERAD)",
      "arrow": "inhibits",
      "cellular_process": "ATXN3 directly binds to the N-terminal domain of VCP/p97, an AAA+ ATPase essential for extracting misfolded proteins from the endoplasmic reticulum. This interaction is competitive with the VCP cofactor Ufd1. By binding to VCP, ATXN3 displaces Ufd1, which in turn reduces VCP's association with ubiquitinated ERAD substrates and impairs their retrotranslocation from the ER to the cytosol for subsequent degradation by the proteasome.",
      "effect_description": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating VCP's substrate processing capacity, it controls the flow of misfolded proteins targeted for degradation, and its over-activity or enhanced binding due to polyQ expansion can lead to the accumulation of these substrates, inducing ER stress.",
      "biological_consequence": [
        "ATXN3 binds to VCP/p97 → ATXN3 competitively displaces the cofactor Ufd1 from VCP → VCP's interaction with ubiquitinated ERAD substrates is decreased → Retrotranslocation of misfolded proteins from the ER to the cytosol is inhibited → Accumulation of ERAD substrates in the ER → Induction of ER stress"
      ],
      "specific_effects": [
        "ATXN3 and the VCP cofactor Ufd1 bind to VCP in a mutually exclusive manner.",
        "ATXN3 binding to VCP reduces VCP's interaction with ubiquitylated proteins.",
        "Pathological polyglutamine (polyQ) expansion in ATXN3 enhances its binding affinity for VCP, leading to a more pronounced impairment of ERAD."
      ],
      "evidence": [
        {
          "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
          "journal": "Human Molecular Genetics",
          "year": 2006,
          "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER.",
          "pmid": "16822850"
        }
      ],
      "pathway": {
        "name": "ER-Associated Degradation",
        "canonical_name": "ER-Associated Degradation",
        "ontology_id": "GO:0036503",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "16822850"
      ],
      "interaction_effect": "inhibition",
      "interaction_direction": "main_to_primary",
      "function_effect": "inhibition"
    },
    {
      "function": "RNF8 Homeostasis & DNA Damage Response",
      "arrow": "activates",
      "cellular_process": "Under physiological conditions, the ATXN3-VCP complex constitutively interacts with the E3 ubiquitin ligase RNF8 to regulate its proteasome-dependent homeostasis. Following genotoxic stress (e.g., ionizing radiation), RNF8 is rapidly recruited to DNA double-strand breaks. The ATXN3-VCP machinery then stimulates the extraction of RNF8 from chromatin, preventing its hyper-accumulation at damage sites.",
      "effect_description": "This regulatory extraction of RNF8 is a crucial step that ensures a balanced DNA damage response. By controlling RNF8 levels on chromatin, the ATXN3-VCP complex facilitates the timely recruitment of downstream repair factors and promotes the appropriate choice of DNA repair pathway, specifically favoring non-homologous end joining (NHEJ) and enhancing overall cell survival.",
      "biological_consequence": [
        "ATXN3 and VCP form a complex with RNF8 → Upon DNA damage, the ATXN3-VCP complex extracts RNF8 from chromatin → Prevents RNF8 hyper-accumulation at DNA lesions → Allows balanced recruitment of downstream factors like RNF168 and 53BP1 → Promotes timely utilization of Non-Homologous End Joining (NHEJ) repair → Enhances cell survival post-irradiation"
      ],
      "specific_effects": [
        "The p97-ATX3 machinery regulates proteasome-dependent homeostasis of RNF8 under both physiological and genotoxic conditions.",
        "Inactivation of the p97-ATX3 complex leads to RNF8 hyper-accumulation on chromatin and hypersensitizes cells to ionizing radiation.",
        "The complex's activity promotes the timely choice of the Non-Homologous End Joining (NHEJ) DNA repair pathway over Homologous Recombination (HR)."
      ],
      "evidence": [
        {
          "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
          "journal": "The EMBO Journal",
          "year": 2019,
          "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR).",
          "pmid": "31613024"
        }
      ],
      "pathway": {
        "name": "DNA Damage Response",
        "canonical_name": "DNA Damage Response",
        "ontology_id": null,
        "ontology_source": null,
        "confidence": 0.8
      },
      "pmids": [
        "31613024"
      ],
      "interaction_effect": "activation",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    }
  ],
  "arrow": "regulates",
  "direction": "main_to_primary",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": null,
  "mechanism": "ATXN3 directly binds to the N-terminal domain of VCP/p97, an AAA+ ATPase essential for extracting mi; Under physiological conditions, the ATXN3-VCP complex constitutively interacts with the E3 ubiquitin",
  "effect": "ATXN3 acts as a negative regulator of the ERAD pathway. By modulating VCP's substrate processing capacity, it controls the flow of misfolded proteins targeted for degradation, and its over-activity or enhanced binding due to polyQ expansion can lead to the accumulation of these substrates, inducing ER stress.; This regulatory extraction of RNF8 is a crucial step that ensures a balanced DNA damage response. By controlling RNF8 levels on chromatin, the ATXN3-VCP complex facilitates the timely recruitment of downstream repair factors and promotes the appropriate choice of DNA repair pathway, specifically favoring non-homologous end joining (NHEJ) and enhancing overall cell survival.",
  "summary": "ATXN3 regulates VCP to regulate er-associated degradation (erad) and rnf8 homeostasis & dna damage response, ultimately affecting induction of er stress.",
  "evidence": [
    {
      "paper_title": "Ataxin-3 binds VCP/p97 and regulates retrotranslocation of ERAD substrates",
      "journal": "Human Molecular Genetics",
      "year": 2006,
      "relevant_quote": "AT3 and Ufd1 bind VCP in a mutually exclusive manner; AT3 decreases the interaction of VCP with Ufd1 as well as with ubiquitylated proteins. Using a reconstituted system, AT3 inhibits retrotranslocation of an ERAD substrate from the ER. These data suggest that a normal function of AT3 is to regulate flow through the ERAD pathway by modulating VCP-dependent extraction of proteins from the ER."
    },
    {
      "paper_title": "The p97-Ataxin 3 complex regulates homeostasis of the DNA damage response E3 ubiquitin ligase RNF8",
      "journal": "The EMBO Journal",
      "year": 2019,
      "relevant_quote": "Under genotoxic stress, when RNF8 is rapidly recruited to sites of DNA lesions, the p97–ATX3 machinery stimulates the extraction of RNF8 from chromatin to balance DNA repair pathway choice and promote cell survival after ionising radiation (IR)."
    }
  ],
  "pathways": [
    {
      "name": "ER-Associated Degradation",
      "canonical_name": "ER-Associated Degradation",
      "ontology_id": "GO:0036503",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "DNA Damage Response",
      "canonical_name": "DNA Damage Response",
      "ontology_id": null,
      "ontology_source": null,
      "confidence": 0.8
    }
  ],
  "interaction_effect": "regulation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 2
  },
  "_arrow_validated": true,
  "arrow_notation": "ATXN3 --regulates--> VCP:",
  "protein_a": "ATXN3",
  "protein_b": "VCP",
  "discovered_in_query": "ATXN3",
  "first_discovered": "2025-12-07T22:39:21.476183Z",
  "last_updated": "2025-12-07T22:39:21.476183Z"
}