{
  "primary": "HSPB1",
  "interaction_type": "indirect",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "functions": [
    {
      "function": "Misfolded Protein Chaperoning",
      "arrow": "activates",
      "cellular_process": "HSPB1 (also known as HSP27) is a small heat shock protein that functions as an ATP-independent molecular chaperone. Under conditions of cellular stress (e.g., heat shock, oxidative stress), HSPB1 binds to denatured or misfolded proteins, preventing their irreversible aggregation and maintaining them in a state competent for refolding or degradation by the ubiquitin-proteasome system.",
      "effect_description": "HSPB1 acts as a crucial holdase, sequestering aggregation-prone proteins to prevent proteotoxicity. Knockdown of HSPB1 can lead to increased aggregation and degradation of its client proteins via the proteasome.",
      "biological_consequence": [
        "Cellular stress → Protein misfolding/denaturation → HSPB1 binds to exposed hydrophobic regions of misfolded proteins → Irreversible aggregation is prevented → Substrates are maintained in a folding-competent state for subsequent refolding or are targeted for degradation by the ubiquitin-proteasome system."
      ],
      "specific_effects": [
        "Overexpression of HSPB1 can increase the solubility and prevent the aggregation of certain mutant proteins, facilitating their clearance.",
        "Knockdown of HSPB1 decreases the solubility and increases the aggregation of its client proteins."
      ],
      "evidence": [
        {
          "paper_title": "Selective degradation of aggregate-prone CryAB mutants by HSPB1 is mediated by ubiquitin-proteasome pathways",
          "journal": "Experimental Cell Research",
          "year": 2011,
          "relevant_quote": "We found that either over-expression or knockdown of HSPB1, a related sHSP, affects the solubility, stability, and degradation of aggregation-prone CryAB mutants... HSPB1 knockdown decreased solubility and increased protein aggregates of all CryAB mutants, indicating a key role for HSPB1 in clearance of CryAB mutants under basal conditions.",
          "pmid": "20863832"
        },
        {
          "paper_title": "Knock down of heat shock protein 27 (HspB1) induces degradation of several putative client proteins",
          "journal": "PLoS One",
          "year": 2012,
          "relevant_quote": "Hsp27 belongs to the heat shock protein family and displays chaperone properties in stress conditions by holding unfolded polypeptides, hence avoiding their inclination to aggregate.",
          "pmid": "22238643"
        }
      ],
      "pathway": {
        "name": "Proteostasis and Chaperone-Mediated Protein Folding",
        "canonical_name": "Protein Folding",
        "ontology_id": "GO:0006457",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "20863832",
        "22238643"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "bidirectional",
      "function_effect": "activation",
      "arrow_context": {
        "direct_from": null,
        "direct_arrow": "activates",
        "net_from": "VCP",
        "net_arrow": "activates",
        "mediator_chain": [],
        "is_indirect": true
      },
      "net_arrow": "activates",
      "direct_arrow": "activates",
      "net_effect": "activation",
      "direct_effect": "activation"
    },
    {
      "function": "TDP-43 Phase Separation",
      "arrow": "activates",
      "cellular_process": "HSPB1 is a key regulator of the RNA-binding protein TDP-43 in the cytoplasm. It directly binds to TDP-43, partitions into TDP-43 liquid droplets, and prevents their pathological transition into irreversible gel-like or solid aggregates, which are hallmarks of neurodegenerative diseases like ALS.",
      "effect_description": "HSPB1 acts as a chaperone for liquid-phase TDP-43, maintaining its fluidity and promoting the disassembly of stress-induced TDP-43 droplets, thereby preventing its aggregation and associated cytotoxicity.",
      "biological_consequence": [
        "Cellular stress → Cytoplasmic TDP-43 undergoes liquid-liquid phase separation, forming droplets → HSPB1 directly binds to TDP-43 within the droplets → The transition of liquid droplets to solid aggregates is inhibited → HSPB1 facilitates the disassembly of the droplets upon stress removal → TDP-43 aggregation and neurotoxicity are prevented."
      ],
      "specific_effects": [
        "HSPB1 directly inhibits the assembly of TDP-43 into fibrils.",
        "Depletion of HSPB1 promotes the mislocalization and aggregation of cytoplasmic TDP-43."
      ],
      "evidence": [
        {
          "paper_title": "Heat-shock chaperone HSPB1 regulates cytoplasmic TDP-43 phase separation and liquid-to-gel transition",
          "journal": "Nature Communications",
          "year": 2021,
          "relevant_quote": "HSPB1 partitions into TDP-43 droplets, inhibits TDP-43 assembly into fibrils, and is essential for disassembly of stress-induced, TDP-43 droplets. Decrease of HSPB1 promotes cytoplasmic TDP-43 de-mixing and mislocalization.",
          "pmid": "36075972"
        }
      ],
      "pathway": {
        "name": "Proteostasis and Chaperone-Mediated Protein Folding",
        "canonical_name": "Protein Folding",
        "ontology_id": "GO:0006457",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "36075972"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "bidirectional",
      "function_effect": "activation",
      "arrow_context": {
        "direct_from": null,
        "direct_arrow": "activates",
        "net_from": "VCP",
        "net_arrow": "activates",
        "mediator_chain": [],
        "is_indirect": true
      },
      "net_arrow": "activates",
      "direct_arrow": "activates",
      "net_effect": "activation",
      "direct_effect": "activation"
    }
  ],
  "support_summary": "HSPB1 (HSP27) is a small heat shock protein that acts as a molecular chaperone, preventing protein aggregation and assisting in the refolding of denatured proteins, a process functionally related to VCP's role in proteostasis.",
  "arrow": "regulates",
  "direction": "bidirectional",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": "The provided input implies a direct, sequential pathway where HSPB1 chaperones misfolded proteins for subsequent processing by VCP. While both proteins are central to cellular proteostasis, the primary literature reviewed does not substantiate a direct interaction or a defined sequential cascade involving VCP acting on HSPB1-chaperoned substrates. HSPB1 functions as an ATP-independent chaperone that binds misfolded proteins to prevent aggregation. VCP is an AAA-ATPase that typically recognizes ubiquitinated substrates and extracts them from complexes or membranes for proteasomal degradation. While they act in parallel pathways to maintain protein quality control, a direct mechanistic link for the claimed functions is not explicitly detailed in the literature found. The functions of HSPB1 are validated independently.",
  "mechanism": "HSPB1 (also known as HSP27) is a small heat shock protein that functions as an ATP-independent molec; HSPB1 is a key regulator of the RNA-binding protein TDP-43 in the cytoplasm",
  "effect": "HSPB1 acts as a crucial holdase, sequestering aggregation-prone proteins to prevent proteotoxicity. Knockdown of HSPB1 can lead to increased aggregation and degradation of its client proteins via the proteasome.; HSPB1 acts as a chaperone for liquid-phase TDP-43, maintaining its fluidity and promoting the disassembly of stress-induced TDP-43 droplets, thereby preventing its aggregation and associated cytotoxicity.",
  "summary": "VCP inhibits HSPB1 to regulate misfolded protein chaperoning and tdp-43 phase separation regulation, ultimately affecting substrates are maintained in a folding-competent state for subsequent refolding or are targeted for degradation by the ubiquitin-proteasome system.",
  "evidence": [
    {
      "paper_title": "Selective degradation of aggregate-prone CryAB mutants by HSPB1 is mediated by ubiquitin-proteasome pathways",
      "journal": "Experimental Cell Research",
      "year": 2011,
      "relevant_quote": "We found that either over-expression or knockdown of HSPB1, a related sHSP, affects the solubility, stability, and degradation of aggregation-prone CryAB mutants... HSPB1 knockdown decreased solubility and increased protein aggregates of all CryAB mutants, indicating a key role for HSPB1 in clearance of CryAB mutants under basal conditions."
    },
    {
      "paper_title": "Knock down of heat shock protein 27 (HspB1) induces degradation of several putative client proteins",
      "journal": "PLoS One",
      "year": 2012,
      "relevant_quote": "Hsp27 belongs to the heat shock protein family and displays chaperone properties in stress conditions by holding unfolded polypeptides, hence avoiding their inclination to aggregate."
    },
    {
      "paper_title": "Heat-shock chaperone HSPB1 regulates cytoplasmic TDP-43 phase separation and liquid-to-gel transition",
      "journal": "Nature Communications",
      "year": 2021,
      "relevant_quote": "HSPB1 partitions into TDP-43 droplets, inhibits TDP-43 assembly into fibrils, and is essential for disassembly of stress-induced, TDP-43 droplets. Decrease of HSPB1 promotes cytoplasmic TDP-43 de-mixing and mislocalization."
    }
  ],
  "pathways": [
    {
      "name": "Proteostasis and Chaperone-Mediated Protein Folding",
      "canonical_name": "Protein Folding",
      "ontology_id": "GO:0006457",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "regulation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 5
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP <--regulates--> HSPB1:",
  "protein_a": "VCP",
  "protein_b": "HSPB1",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-06T04:46:06.435177Z",
  "last_updated": "2025-12-06T04:46:06.435177Z"
}