{
  "primary": "OPTN",
  "interaction_type": "indirect",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "Optineurin (OPTN) is an autophagy receptor that directly interacts with VCP to mediate the clearance of damaged mitochondria (mitophagy) and protein aggregates.",
  "functions": [
    {
      "function": "TBK1",
      "arrow": "activates",
      "cellular_process": "During mitophagy, OPTN acts as a scaffold for the recruitment and activation of the kinase TBK1 at the mitochondrial surface. OPTN recruits TBK1, which then phosphorylates OPTN at Ser177, enhancing its binding affinity for LC3. TBK1 also phosphorylates OPTN within its ubiquitin-binding domain (UBAN), which enhances its affinity for ubiquitin chains, creating a positive feedback loop that promotes efficient recognition and engulfment of the damaged mitochondria.",
      "effect_description": "OPTN serves as a platform to concentrate and activate TBK1 at the site of mitochondrial damage. This localized kinase activity enhances the function of OPTN as an autophagy receptor, amplifying the mitophagy signal.",
      "biological_consequence": [
        "OPTN recruitment to ubiquitinated mitochondria → TBK1 is recruited by OPTN → TBK1 autophosphorylates and becomes active → TBK1 phosphorylates OPTN at Ser177 and in the UBAN domain → Enhanced LC3 and ubiquitin binding by OPTN → Efficient autophagosome formation and cargo clearance."
      ],
      "specific_effects": [
        "TBK1 phosphorylation of OPTN on Ser473 enhances its binding to ubiquitin chains.",
        "TBK1 phosphorylation of OPTN on Ser177 increases its affinity for LC3."
      ],
      "evidence": [
        {
          "paper_title": "Phosphorylation of OPTN by TBK1 enhances its binding to Ub chains and promotes selective autophagy of damaged mitochondria",
          "journal": "Proceedings of the National Academy of Sciences",
          "year": 2016,
          "relevant_quote": "Here, we provide evidence that TBK1 integrates upstream Ub-dependent signaling events by phosphorylating the autophagy receptor OPTN in the Ub-binding domain (UBD) in ABIN proteins and NEMO (UBAN), thus controlling its binding to Ub chains and regulating autophagy of damaged mitochondria.",
          "pmid": "27035970"
        },
        {
          "paper_title": "Optineurin provides a mitophagy contact site for TBK1 activation",
          "journal": "The EMBO Journal",
          "year": 2020,
          "relevant_quote": "Both the OPTN–ubiquitin and the OPTN–pre‐autophagosomal structure (PAS) interaction axes facilitate assembly of the OPTN–TBK1 complex at a contact sites between damaged mitochondria and the autophagosome formation sites. At this assembly point, a positive feedback loop for TBK1 activation is initiated that accelerates hetero‐autophosphorylation of the protein.",
          "pmid": "38287189"
        }
      ],
      "pathway": {
        "name": "Mitophagy",
        "canonical_name": "Mitophagy",
        "ontology_id": "GO:0000423",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "27035970",
        "38287189"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "consequences": "VCP extracts ubiquitinated proteins from damaged mitochondria → This remodeling allows for the efficient recruitment of OPTN → OPTN recruits TBK1 → TBK1 is activated via autophosphorylation → Active TBK1 phosphorylates OPTN, enhancing its ubiquitin-binding affinity → Efficient mitophagy and clearance of damaged mitochondria.",
      "function_effect": "activation",
      "arrow_context": {
        "direct_from": null,
        "direct_arrow": "activates",
        "net_from": "VCP",
        "net_arrow": "activates",
        "mediator_chain": [],
        "is_indirect": true
      },
      "net_arrow": "activates",
      "direct_arrow": "activates",
      "net_effect": "activation",
      "direct_effect": "activation"
    }
  ],
  "arrow": "activates",
  "direction": "main_to_primary",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "is_valid": true,
  "mechanism_correction": "The provided input for OPTN was missing the VCP interaction entirely. The literature suggests a cooperative role where VCP interacts with the autophagy receptor OPTN to facilitate the clearance of damaged mitochondria. Specifically, VCP acts as a cofactor with OPTN to stabilize the Beclin-1 (BECN1) complex, which is essential for the initiation of the autophagosome (phagophore) assembly during mitophagy.",
  "mechanism": "During PINK1/Parkin-mediated mitophagy, OPTN is recruited to ubiquitinated mitochondria and acts as ; During mitophagy, OPTN acts as a scaffold for the recruitment and activation of the kinase TBK1 at t",
  "effect": "VCP acts as a crucial cofactor for OPTN, enhancing the efficiency of mitophagy initiation by ensuring the stability and activity of the core autophagy machinery at the site of mitochondrial damage.; OPTN serves as a platform to concentrate and activate TBK1 at the site of mitochondrial damage. This localized kinase activity enhances the function of OPTN as an autophagy receptor, amplifying the mitophagy signal.",
  "summary": "VCP activates OPTN to regulate mitophagy initiation and tbk1 activation, ultimately affecting clearance of damaged mitochondria.",
  "evidence": [
    {
      "paper_title": "PINK1/OPTN-mediated mitophagy clears depolarized mitochondria to prevent DILI progression",
      "journal": "Signal Transduction and Targeted Therapy",
      "year": 2024,
      "relevant_quote": "Notably, mass spectrometry analysis identifies a new mitochondrial substrate, GCDH (glutaryl-CoA dehydrogenase), which can be selectively recruited by OPTN for mitophagic degradation, and a new cofactor, VCP (valosin containing protein) that interacts with OPTN to stabilize BECN1 during phagophore assembly, thus boosting OPTN-mediated mitophagy initiation to clear damaged mitochondria and preserve mitochondrial homeostasis in DILIs."
    },
    {
      "paper_title": "Phosphorylation of OPTN by TBK1 enhances its binding to Ub chains and promotes selective autophagy of damaged mitochondria",
      "journal": "Proceedings of the National Academy of Sciences",
      "year": 2016,
      "relevant_quote": "Here, we provide evidence that TBK1 integrates upstream Ub-dependent signaling events by phosphorylating the autophagy receptor OPTN in the Ub-binding domain (UBD) in ABIN proteins and NEMO (UBAN), thus controlling its binding to Ub chains and regulating autophagy of damaged mitochondria."
    },
    {
      "paper_title": "Optineurin provides a mitophagy contact site for TBK1 activation",
      "journal": "The EMBO Journal",
      "year": 2020,
      "relevant_quote": "Both the OPTN–ubiquitin and the OPTN–pre‐autophagosomal structure (PAS) interaction axes facilitate assembly of the OPTN–TBK1 complex at a contact sites between damaged mitochondria and the autophagosome formation sites. At this assembly point, a positive feedback loop for TBK1 activation is initiated that accelerates hetero‐autophosphorylation of the protein."
    }
  ],
  "pathways": [
    {
      "name": "Mitophagy",
      "canonical_name": "Mitophagy",
      "ontology_id": "GO:0000423",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "activation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 2
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP --activates--> OPTN:",
  "protein_a": "VCP",
  "protein_b": "OPTN",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-06T04:46:06.380884Z",
  "last_updated": "2025-12-06T04:46:06.380884Z"
}