{
  "primary": "SQSTM1",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "SQSTM1/p62 is a key autophagy receptor that directly interacts with VCP, enabling VCP to segregate and process ubiquitinated protein aggregates for clearance.",
  "functions": [
    {
      "function": "Protein Aggregate Clearance (Aggrephagy)",
      "arrow": "activates",
      "cellular_process": "SQSTM1/p62 acts as a selective autophagy receptor that recognizes and binds to K63-polyubiquitinated protein aggregates via its UBA domain. It simultaneously binds to LC3 on the phagophore via its LIR motif, thus tethering the aggregate to the nascent autophagosome. VCP, a ubiquitin-dependent segregase, is recruited to these p62-body/aggresome structures. It utilizes its ATPase activity to remodel and extract ubiquitinated proteins from the aggregate, facilitating their degradation by either the proteasome or the autophagosome.",
      "effect_description": "VCP acts on p62-sequestered ubiquitinated protein aggregates, functioning as a segregase to process the aggregates and make them accessible for degradation, thereby promoting their efficient clearance via autophagy.",
      "biological_consequence": [
        "Ubiquitinated protein aggregates form → SQSTM1/p62 binds aggregates (via UBA) and LC3 (via LIR) → Aggregates are sequestered into p62 bodies → VCP is recruited to the p62-aggregate complex → VCP ATPase activity remodels the aggregate and segregates ubiquitinated proteins → Clearance of aggregates by autophagosome-lysosome fusion."
      ],
      "specific_effects": [
        "VCP is required for the maturation of ubiquitin-containing autophagosomes.",
        "Loss of VCP activity leads to the accumulation of p62 and ubiquitinated proteins, indicating a blockage in autophagic clearance."
      ],
      "evidence": [
        {
          "paper_title": "Valosin-containing protein (VCP) is required for autophagy and is disrupted in VCP disease",
          "journal": "Journal of Cell Biology",
          "year": 2009,
          "relevant_quote": "To test whether VCP participates in autophagy, we silenced VCP or expressed adenosine triphosphatase–inactive VCP. Under basal conditions, loss of VCP activity results in autophagosome accumulation. After autophagic induction, these autophagosomes fail to mature into autolysosomes and degrade LC3. Similarly, IBMPFD mutant VCP expression in cells and animals leads to the accumulation of nondegradative autophagosomes that coalesce at RVs and fail to degrade aggregated proteins.",
          "pmid": "20008565"
        }
      ],
      "pathway": {
        "name": "Aggrephagy",
        "canonical_name": "Aggrephagy",
        "ontology_id": "GO:0035973",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "20008565"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "primary_to_main",
      "function_effect": "activation"
    },
    {
      "function": "Lipid Droplet Clearance (Lipophagy)",
      "arrow": "activates",
      "cellular_process": "SQSTM1/p62 acts as a cargo receptor for lipophagy, the selective autophagic degradation of lipid droplets (LDs). Proteins on the surface of LDs become ubiquitinated, which serves as a signal for SQSTM1 recruitment. SQSTM1 then links the ubiquitinated LD to the autophagosome via its interaction with LC3, targeting the LD for lysosomal degradation.",
      "effect_description": "SQSTM1 mediates the clearance of lipid droplets by recognizing ubiquitin signals on their surface and linking them to the core autophagy machinery, thereby regulating cellular lipid homeostasis.",
      "biological_consequence": [
        "Cellular stress → LD surface proteins are ubiquitinated → SQSTM1 binds to ubiquitinated proteins via its UBA domain → SQSTM1 binds to LC3 on the phagophore → Autophagosome engulfs the SQSTM1-LD complex → Autophagosome fuses with lysosome → Lipids and proteins are degraded."
      ],
      "specific_effects": [
        "SQSTM1 colocalizes with lipid droplets and is co-degraded with them in lysosomes.",
        "SQSTM1 is proposed to be a non-exclusive lipophagy receptor, tagging and facilitating the sequestration of lipid droplets."
      ],
      "evidence": [
        {
          "paper_title": "SQSTM1, lipid droplets and current state of their lipophagy affairs",
          "journal": "Autophagy",
          "year": 2022,
          "relevant_quote": "Our analysis of these studies shows that SQSTM1 colocalizes with LDs, bridges them with phagophores, is co-degraded with them in the lysosomes, and affects LD abundance in a variety of cells and under diverse experimental conditions... the overwhelming and complementary evidence from other studies suggests that the role of SQSTM1 in lipophagy via tagging, movement, aggregation/clustering and sequestration of LDs is rather a common phenomenon in mammalian cells.",
          "pmid": "35799322"
        }
      ],
      "pathway": {
        "name": "Lipophagy",
        "canonical_name": "Mitophagy",
        "ontology_id": "GO:0000423",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "35799322"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "primary_to_main",
      "function_effect": "activation"
    }
  ],
  "arrow": "binds",
  "direction": "primary_to_main",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "is_valid": true,
  "mechanism_correction": null,
  "mechanism": "SQSTM1/p62 acts as a selective autophagy receptor that recognizes and binds to K63-polyubiquitinated; SQSTM1/p62 acts as a cargo receptor for lipophagy, the selective autophagic degradation of lipid dro",
  "effect": "VCP acts on p62-sequestered ubiquitinated protein aggregates, functioning as a segregase to process the aggregates and make them accessible for degradation, thereby promoting their efficient clearance via autophagy.; SQSTM1 mediates the clearance of lipid droplets by recognizing ubiquitin signals on their surface and linking them to the core autophagy machinery, thereby regulating cellular lipid homeostasis.",
  "summary": "VCP activates SQSTM1 to regulate protein aggregate clearance (aggrephagy) and lipid droplet clearance (lipophagy), ultimately affecting clearance of aggregates by autophagosome-lysosome fusion.",
  "evidence": [
    {
      "paper_title": "Valosin-containing protein (VCP) is required for autophagy and is disrupted in VCP disease",
      "journal": "Journal of Cell Biology",
      "year": 2009,
      "relevant_quote": "To test whether VCP participates in autophagy, we silenced VCP or expressed adenosine triphosphatase–inactive VCP. Under basal conditions, loss of VCP activity results in autophagosome accumulation. After autophagic induction, these autophagosomes fail to mature into autolysosomes and degrade LC3. Similarly, IBMPFD mutant VCP expression in cells and animals leads to the accumulation of nondegradative autophagosomes that coalesce at RVs and fail to degrade aggregated proteins."
    },
    {
      "paper_title": "SQSTM1, lipid droplets and current state of their lipophagy affairs",
      "journal": "Autophagy",
      "year": 2022,
      "relevant_quote": "Our analysis of these studies shows that SQSTM1 colocalizes with LDs, bridges them with phagophores, is co-degraded with them in the lysosomes, and affects LD abundance in a variety of cells and under diverse experimental conditions... the overwhelming and complementary evidence from other studies suggests that the role of SQSTM1 in lipophagy via tagging, movement, aggregation/clustering and sequestration of LDs is rather a common phenomenon in mammalian cells."
    }
  ],
  "pathways": [
    {
      "name": "Aggrephagy",
      "canonical_name": "Aggrephagy",
      "ontology_id": "GO:0035973",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "Lipophagy",
      "canonical_name": "Mitophagy",
      "ontology_id": "GO:0000423",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "binding",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 4
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP <--binds-- SQSTM1:",
  "protein_a": "VCP",
  "protein_b": "SQSTM1",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-06T04:46:06.382921Z",
  "last_updated": "2025-12-06T04:46:06.382921Z"
}