{
  "primary": "VCP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "FAF1 (FAS-associated factor 1) is a UBX-containing protein that directly binds to the N-domain of VCP.",
  "functions": [
    {
      "function": "ER-Associated Degradation (ERAD)",
      "arrow": "activates",
      "cellular_process": "FAF1 (FAS-associated factor 1) acts as a ubiquitin receptor and scaffold protein that links the VCP-Npl4-Ufd1 complex to polyubiquitinated substrates targeted for ERAD. FAF1 binds to the N-domain of VCP via its C-terminal UBX domain. This interaction is dependent on VCP first forming a complex with the Npl4-Ufd1 heterodimer. The binding of the VCP-Npl4-Ufd1 complex to the FAF1 UBX domain allosterically regulates the N-terminal UBA domain of FAF1, enabling it to bind polyubiquitin chains on ERAD substrates. This entire complex facilitates the delivery of substrates to the proteasome for degradation.",
      "effect_description": "Promotes ERAD by acting as a ubiquitin scaffolding receptor that bridges the VCP-Npl4-Ufd1 complex with polyubiquitinated ERAD substrates, thereby facilitating their delivery to the proteasome.",
      "biological_consequence": [
        "VCP forms a complex with its cofactors Npl4-Ufd1 → The VCP-Npl4-Ufd1 complex binds to the C-terminal UBX domain of FAF1 → This binding event induces a conformational change in FAF1, activating its N-terminal UBA domain → The activated UBA domain recruits polyubiquitinated ERAD substrates → The complete VCP-Npl4-Ufd1-FAF1-substrate complex targets the substrate for proteasomal degradation."
      ],
      "specific_effects": [
        "FAF1 selectively interacts with the VCP-Npl4-Ufd1 complex, not VCP alone.",
        "The C-terminal UBX domain of FAF1 binds to the N-domain of VCP.",
        "Binding of the VCP-Npl4-Ufd1 complex to the FAF1 UBX domain is a prerequisite for the binding of polyubiquitinated proteins to the FAF1 UBA domain.",
        "Overexpression of FAF1 promotes the degradation of ERAD substrates like CD3δ, while its depletion retards degradation."
      ],
      "evidence": [
        {
          "paper_title": "Complex of Fas-associated Factor 1 (FAF1) with Valosin-containing Protein (VCP)-Npl4-Ufd1 and Polyubiquitinated Proteins Promotes Endoplasmic Reticulum-associated Degradation (ERAD)",
          "journal": "Journal of Biological Chemistry",
          "year": 2013,
          "relevant_quote": "This study shows that FAF1 interacts only with VCP complexed with Npl4-Ufd1 heterodimer, a requirement for the recruitment of polyubiquitinated proteins to UBA domain. Intriguingly, VCP association to C-terminal UBX domain regulates ubiquitin binding to N-terminal UBA domain without direct interaction between UBA and UBX domains... We demonstrate here that FAF1 binds to VCP-Npl4-Ufd1 complex via UBX domain and polyubiquitinated proteins via UBA domain to promote endoplasmic reticulum-associated degradation.",
          "pmid": "23293021"
        }
      ],
      "pathway": {
        "name": "ER-Associated Degradation",
        "canonical_name": "ER-Associated Degradation",
        "ontology_id": "GO:0036503",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "23293021"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    },
    {
      "function": "Apoptosis",
      "arrow": "inhibits",
      "cellular_process": "FAF1 was initially identified for its role in potentiating Fas-induced apoptosis. VCP is known to have diverse cellular functions, including roles in apoptosis. While FAF1 and VCP directly interact, the precise mechanistic role of this specific interaction in modulating FAF1's pro-apoptotic activity is not fully detailed in the provided search results. The interaction places VCP, often associated with cell survival, in a complex with a pro-apoptotic factor, suggesting a regulatory intersection.",
      "effect_description": "The direct interaction between VCP and the pro-apoptotic protein FAF1 suggests a potential regulatory role for VCP in FAF1-mediated apoptosis, though the specific activating or inhibitory effect of VCP binding on FAF1's apoptotic function requires further clarification.",
      "biological_consequence": [
        "Fas ligand binding → FAF1 interaction with Fas death domain → Enhanced recruitment of FADD and Caspase-8 → Apoptotic signaling cascade (This is FAF1's known role; VCP's modulatory step is not defined)."
      ],
      "specific_effects": [
        "FAF1 is known to promote Fas-mediated apoptosis.",
        "VCP is involved in a wide range of cellular processes, including apoptosis."
      ],
      "evidence": [
        {
          "paper_title": "VCP controls KCC2 degradation through FAF1 recruitment and accelerates emergence from anesthesia",
          "journal": "Proceedings of the National Academy of Sciences",
          "year": 2022,
          "relevant_quote": "VCP has been revealed to orchestrate into a wide range of biological processes, including endoplasmic reticulum-associated degradation (ERAD), membrane fusion, transcriptional activation, cell-cycle control, and apoptosis.",
          "pmid": "39793039"
        }
      ],
      "pathway": {
        "name": "Apoptosis",
        "canonical_name": "Apoptosis",
        "ontology_id": "GO:0006915",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "39793039"
      ],
      "interaction_effect": "inhibits",
      "interaction_direction": "main_to_primary",
      "function_effect": "inhibition"
    },
    {
      "function": "NF-κB Signaling Pathway",
      "arrow": "activates",
      "cellular_process": "Both VCP and its adaptor FAF1 are implicated in the NF-κB signaling pathway, specifically in the degradation of the inhibitor IκBα. The NF-κB heterodimer is held inactive in the cytoplasm by IκBα. Upon signaling, IκBα is phosphorylated and ubiquitinated, targeting it for proteasomal degradation, which allows NF-κB to translocate to the nucleus. The VCP-FAF1 complex is involved in mediating this degradation of IκBα, although the precise mechanism is not fully elucidated.",
      "effect_description": "The VCP-FAF1 complex participates in the degradation of IκBα, a key step required for the activation of the NF-κB signaling pathway.",
      "biological_consequence": [
        "Pro-inflammatory signal → IκBα phosphorylation and ubiquitination → VCP-FAF1 complex participates in processing ubiquitinated IκBα → Proteasomal degradation of IκBα → NF-κB heterodimer is released → NF-κB translocates to the nucleus and activates transcription."
      ],
      "specific_effects": [
        "Both FAF1 and VCP have been implicated in mediating IκBα degradation.",
        "FAF1 has been found to interact with the p65 subunit of NF-κB, preventing it from entering the nucleus."
      ],
      "evidence": [
        {
          "paper_title": "The p97-FAF1 Protein Complex Reveals a Common Mode of p97 Adaptor Binding",
          "journal": "Structure",
          "year": 2014,
          "relevant_quote": "The NF-κB heterodimer is normally retained in the cytoplasm by the regulator IκBα until phosphorylation and ubiquitylation of IκBα, which leads to its degradation via the ubiquitin-proteasome system. FAF1 and p97 have both been implicated in mediating IκBα degradation, via unknown mechanisms, indicating the importance for the p97-FAF1 complex.",
          "pmid": "24619421"
        }
      ],
      "pathway": {
        "name": "NF-κB Signaling",
        "canonical_name": "NF-kB Signaling",
        "ontology_id": "hsa04064",
        "ontology_source": "KEGG",
        "confidence": 0.8
      },
      "pmids": [
        "24619421"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "main_to_primary",
      "function_effect": "activation"
    }
  ],
  "arrow": "activates",
  "direction": "primary_to_main",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": null,
  "mechanism": "FAF1 (FAS-associated factor 1) acts as a ubiquitin receptor and scaffold protein that links the VCP-; FAF1 was initially identified for its role in potentiating Fas-induced apoptosis; Both VCP and its adaptor FAF1 are implicated in the NF-κB signaling pathway, specifically in the deg",
  "effect": "Promotes ERAD by acting as a ubiquitin scaffolding receptor that bridges the VCP-Npl4-Ufd1 complex with polyubiquitinated ERAD substrates, thereby facilitating their delivery to the proteasome.; The direct interaction between VCP and the pro-apoptotic protein FAF1 suggests a potential regulatory role for VCP in FAF1-mediated apoptosis, though the specific activating or inhibitory effect of VCP binding on FAF1's apoptotic function requires further clarification.; ...",
  "summary": "VCP activates FAF1 to control multiple cellular processes including er-associated degradation (erad), apoptosis, and nf-κb signaling pathway, ultimately affecting the complete vcp-npl4-ufd1-faf1-substrate complex targets the substrate for proteasomal degradation.",
  "evidence": [
    {
      "paper_title": "Complex of Fas-associated Factor 1 (FAF1) with Valosin-containing Protein (VCP)-Npl4-Ufd1 and Polyubiquitinated Proteins Promotes Endoplasmic Reticulum-associated Degradation (ERAD)",
      "journal": "Journal of Biological Chemistry",
      "year": 2013,
      "relevant_quote": "This study shows that FAF1 interacts only with VCP complexed with Npl4-Ufd1 heterodimer, a requirement for the recruitment of polyubiquitinated proteins to UBA domain. Intriguingly, VCP association to C-terminal UBX domain regulates ubiquitin binding to N-terminal UBA domain without direct interaction between UBA and UBX domains... We demonstrate here that FAF1 binds to VCP-Npl4-Ufd1 complex via UBX domain and polyubiquitinated proteins via UBA domain to promote endoplasmic reticulum-associated degradation."
    },
    {
      "paper_title": "VCP controls KCC2 degradation through FAF1 recruitment and accelerates emergence from anesthesia",
      "journal": "Proceedings of the National Academy of Sciences",
      "year": 2022,
      "relevant_quote": "VCP has been revealed to orchestrate into a wide range of biological processes, including endoplasmic reticulum-associated degradation (ERAD), membrane fusion, transcriptional activation, cell-cycle control, and apoptosis."
    },
    {
      "paper_title": "The p97-FAF1 Protein Complex Reveals a Common Mode of p97 Adaptor Binding",
      "journal": "Structure",
      "year": 2014,
      "relevant_quote": "The NF-κB heterodimer is normally retained in the cytoplasm by the regulator IκBα until phosphorylation and ubiquitylation of IκBα, which leads to its degradation via the ubiquitin-proteasome system. FAF1 and p97 have both been implicated in mediating IκBα degradation, via unknown mechanisms, indicating the importance for the p97-FAF1 complex."
    }
  ],
  "pathways": [
    {
      "name": "ER-Associated Degradation",
      "canonical_name": "ER-Associated Degradation",
      "ontology_id": "GO:0036503",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "Apoptosis",
      "canonical_name": "Apoptosis",
      "ontology_id": "GO:0006915",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "NF-κB Signaling",
      "canonical_name": "NF-kB Signaling",
      "ontology_id": "hsa04064",
      "ontology_source": "KEGG",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "activation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 3
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP --activates--> FAF1:",
  "protein_a": "FAF1",
  "protein_b": "VCP",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-04T19:56:00.323899Z",
  "last_updated": "2025-12-04T19:56:00.323899Z"
}