{
  "primary": "VCP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "UBXN6 (also known as UBXD1) is a VCP cofactor that mediates VCP's function at the outer mitochondrial membrane and in endolysosomal sorting. It contains both a PUB and a UBX domain.",
  "functions": [
    {
      "function": "Endolysosomal Sorting",
      "arrow": "activates",
      "cellular_process": "UBXN6, also known as UBXD1, functions as a critical VCP cofactor that directs the VCP complex to ubiquitinated cargo on endosomes. This complex specifically recognizes mono-ubiquitinated Caveolin-1 (CAV1), facilitating its sorting into multivesicular bodies (MVBs) for eventual degradation within endolysosomes. VCP's ATPase activity is essential for this process.",
      "effect_description": "Acts as a VCP adaptor to mediate the trafficking and degradation of ubiquitinated endosomal cargo proteins like CAV1.",
      "biological_consequence": [
        "Mono-ubiquitination of Caveolin-1 (CAV1) on endosomes → Recruitment of the VCP-UBXN6 complex → VCP ATPase activity processes the CAV1 complex → Sorting of CAV1 into intraluminal vesicles of multivesicular bodies (MVBs) → Degradation in endolysosomes"
      ],
      "specific_effects": [
        "The VCP-UBXN6 complex targets mono-ubiquitylated CAV1 on endosomes for degradation.",
        "Depletion of UBXN6 or inhibition of VCP blocks CAV1 transport, causing it to accumulate at the limiting membrane of enlarged endosomes.",
        "VCP disease mutations can disrupt the formation of the VCP-UBXN6 complex, leading to impaired cargo sorting."
      ],
      "evidence": [
        {
          "paper_title": "Endolysosomal sorting of ubiquitylated caveolin-1 is regulated by VCP and UBXD1 and impaired by VCP disease mutations",
          "journal": "Nature Cell Biology",
          "year": 2011,
          "relevant_quote": "We show that VCP-UBXD1 targets mono-ubiquitylated CAV1 in SDS-resistant high-molecular-weight complexes on endosomes, which are en route to degradation in endolysosomes. Expression of VCP mutant proteins, chemical inhibition of VCP, or siRNA-mediated depletion of UBXD1 leads to a block of CAV1 transport at the limiting membrane of enlarged endosomes in cultured cells.",
          "pmid": "21822278"
        }
      ],
      "pathway": {
        "name": "Endolysosomal Pathway",
        "canonical_name": "Endolysosomal Pathway",
        "ontology_id": null,
        "ontology_source": null,
        "confidence": 0.8
      },
      "pmids": [
        "21822278"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "primary_to_main",
      "function_effect": "activation"
    },
    {
      "function": "Lysosome Clearance (Lysophagy)",
      "arrow": "activates",
      "cellular_process": "In response to lysosomal membrane damage, UBXN6 acts as an essential adaptor in the Endo-Lysosomal Damage Response (ELDR). It forms a complex with VCP, the deubiquitinase YOD1, and PLAA. This complex is recruited to damaged lysosomes, where it selectively removes K48-linked ubiquitin conjugates from lysosomal proteins, a step required to promote the formation of an autophagosome around the damaged organelle for its clearance.",
      "effect_description": "Functions as a key component of the VCP-ELDR complex, which processes ubiquitin signals on damaged lysosomes to facilitate their autophagic removal.",
      "biological_consequence": [
        "Lysosomal membrane damage → Galectin-3 recruitment and K63-ubiquitination of lysosomal proteins → Recruitment of p62/SQSTM1 and the VCP-UBXN6-YOD1-PLAA complex (ELDR complex) → YOD1-mediated removal of K48-linked ubiquitin chains from lysosomal proteins → Promotion of autophagosome formation around the damaged lysosome → Lysophagy (autophagic clearance)"
      ],
      "specific_effects": [
        "Upon lysosomal damage, VCP and its cofactors UBXN6, YOD1, and PLAA are recruited to the damaged organelle.",
        "The VCP-UBXN6 complex acts downstream of p62 recruitment and K63-ubiquitination to specifically remove K48-linked ubiquitin chains, which facilitates autophagosome formation.",
        "Loss of VCP or UBXN6 impairs the clearance of damaged lysosomes, leading to their accumulation."
      ],
      "evidence": [
        {
          "paper_title": "VCP/p97 cooperates with YOD1, UBXD1 and PLAA to drive clearance of ruptured lysosomes by autophagy",
          "journal": "The EMBO Journal",
          "year": 2016,
          "relevant_quote": "Upon damage, p97 translocates to lysosomes and there cooperates with a distinct set of cofactors including UBXD1, PLAA, and the deubiquitinating enzyme YOD1, which we term ELDR components for Endo-Lysosomal Damage Response. Together, they act downstream of K63-linked ubiquitination and p62 recruitment, and selectively remove K48-linked ubiquitin conjugates from a subpopulation of damaged lysosomes to promote autophagosome formation.",
          "pmid": "27753622"
        }
      ],
      "pathway": {
        "name": "Lysophagy",
        "canonical_name": "Lysophagy",
        "ontology_id": null,
        "ontology_source": null,
        "confidence": 0.8
      },
      "pmids": [
        "27753622"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "primary_to_main",
      "function_effect": "activation"
    }
  ],
  "arrow": "complex",
  "direction": "bidirectional",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "is_valid": true,
  "mechanism_correction": null,
  "mechanism": "UBXN6, also known as UBXD1, functions as a critical VCP cofactor that directs the VCP complex to ubi; In response to lysosomal membrane damage, UBXN6 acts as an essential adaptor in the Endo-Lysosomal D",
  "effect": "Acts as a VCP adaptor to mediate the trafficking and degradation of ubiquitinated endosomal cargo proteins like CAV1.; Functions as a key component of the VCP-ELDR complex, which processes ubiquitin signals on damaged lysosomes to facilitate their autophagic removal.",
  "summary": "VCP activates UBXN6 to regulate endolysosomal sorting and lysosome clearance (lysophagy), ultimately affecting degradation in endolysosomes.",
  "evidence": [
    {
      "paper_title": "Endolysosomal sorting of ubiquitylated caveolin-1 is regulated by VCP and UBXD1 and impaired by VCP disease mutations",
      "journal": "Nature Cell Biology",
      "year": 2011,
      "relevant_quote": "We show that VCP-UBXD1 targets mono-ubiquitylated CAV1 in SDS-resistant high-molecular-weight complexes on endosomes, which are en route to degradation in endolysosomes. Expression of VCP mutant proteins, chemical inhibition of VCP, or siRNA-mediated depletion of UBXD1 leads to a block of CAV1 transport at the limiting membrane of enlarged endosomes in cultured cells."
    },
    {
      "paper_title": "VCP/p97 cooperates with YOD1, UBXD1 and PLAA to drive clearance of ruptured lysosomes by autophagy",
      "journal": "The EMBO Journal",
      "year": 2016,
      "relevant_quote": "Upon damage, p97 translocates to lysosomes and there cooperates with a distinct set of cofactors including UBXD1, PLAA, and the deubiquitinating enzyme YOD1, which we term ELDR components for Endo-Lysosomal Damage Response. Together, they act downstream of K63-linked ubiquitination and p62 recruitment, and selectively remove K48-linked ubiquitin conjugates from a subpopulation of damaged lysosomes to promote autophagosome formation."
    }
  ],
  "pathways": [
    {
      "name": "Lysophagy",
      "canonical_name": "Lysophagy",
      "ontology_id": null,
      "ontology_source": null,
      "confidence": 0.8
    },
    {
      "name": "Endolysosomal Pathway",
      "canonical_name": "Endolysosomal Pathway",
      "ontology_id": null,
      "ontology_source": null,
      "confidence": 0.8
    }
  ],
  "interaction_effect": "complex formation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 5
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP <--complex--> UBXN6:",
  "protein_a": "UBXN6",
  "protein_b": "VCP",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-04T19:56:00.346857Z",
  "last_updated": "2025-12-04T19:56:00.346857Z"
}