{
  "primary": "VCP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "UBXN1 is a UBX domain-containing cofactor that directly binds VCP and is recruited with it to damaged mitochondria to facilitate mitophagy.",
  "functions": [
    {
      "function": "Mitophagy",
      "arrow": "activates",
      "cellular_process": "UBXN1 is a VCP cofactor that, upon mitochondrial depolarization, is recruited along with VCP to damaged mitochondria in a Parkin-dependent manner. It is essential for the efficient VCP-mediated removal of the outer mitochondrial membrane protein Mitofusin 2 (MFN2), a key step for mitochondrial fission and subsequent clearance by autophagy (mitophagy).",
      "effect_description": "UBXN1 acts as a pro-mitophagic cofactor, ensuring the timely and efficient removal of mitochondrial proteins to allow for the progression of mitophagy.",
      "biological_consequence": [
        "Mitochondrial damage → PINK1/Parkin activation → UBXN1 and VCP are recruited to the outer mitochondrial membrane → UBXN1 facilitates VCP's extraction of ubiquitinated MFN2 → Mitochondrial processing and clearance via mitophagy are initiated."
      ],
      "specific_effects": [
        "Loss of UBXN1 impairs the recruitment of VCP and Parkin to damaged mitochondria, leading to the accumulation of MFN2 in para-mitochondrial blobs and diminishing mitophagic flux.",
        "UBXN1 physically interacts with Parkin through its UBX domain."
      ],
      "evidence": [
        {
          "paper_title": "VCP/p97 cofactor UBXN1/SAKS1 regulates mitophagy by modulating MFN2 removal from mitochondria",
          "journal": "Autophagy",
          "year": 2022,
          "relevant_quote": "Here we characterize the role of the UBA and UBX-domain containing VCP cofactor UBXN1/SAKS1 during mitophagy. Following mitochondrial depolarization and depending on PRKN, UBXN1 translocated alongside VCP to mitochondria... Mechanistically, UBXN1 acted downstream of PINK1 by facilitating MFN2 removal from mitochondria.",
          "pmid": "33966597"
        }
      ],
      "pathway": {
        "name": "Mitophagy",
        "canonical_name": "Mitophagy",
        "ontology_id": "GO:0000423",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "33966597"
      ],
      "interaction_effect": "activates",
      "interaction_direction": "bidirectional",
      "function_effect": "activation"
    },
    {
      "function": "ER-Associated Degradation (ERAD)",
      "arrow": "inhibits",
      "cellular_process": "UBXN1 contributes to ER proteostasis, but not by directly inhibiting VCP-mediated ERAD. It acts as a negative regulator of the Unfolded Protein Response (UPR) by repressing protein translation. This function is independent of VCP's ATPase activity.",
      "effect_description": "UBXN1 helps maintain ER proteostasis by reducing the load of newly synthesized proteins, thereby alleviating ER stress. This is distinct from modulating the degradation of already misfolded proteins by the VCP-ERAD machinery.",
      "biological_consequence": [
        "ER stress → UBXN1 represses global protein translation → Reduced influx of new proteins into the ER → ER protein folding machinery load is decreased → UPR activation is dampened."
      ],
      "specific_effects": [
        "Loss of UBXN1 sensitizes cells to ER stress and leads to the activation of all three arms of the UPR.",
        "The function of UBXN1 in repressing translation and maintaining ER proteostasis is independent of VCP."
      ],
      "evidence": [
        {
          "paper_title": "UBXN1 maintains ER proteostasis and represses UPR activation by modulating translation",
          "journal": "EMBO reports",
          "year": 2023,
          "relevant_quote": "Notably, we find that loss of UBXN1 does not perturb p97-dependent ER-associated degradation (ERAD). Our studies indicate that loss of UBXN1 increases translation in both resting and ER-stressed cells. Surprisingly, this process is independent of p97 function. Taken together, our studies have identified a new role for UBXN1 in repressing translation and maintaining ER proteostasis in a p97 independent manner.",
          "pmid": "38177917"
        }
      ],
      "pathway": {
        "name": "ER-Associated Degradation",
        "canonical_name": "ER-Associated Degradation",
        "ontology_id": "GO:0036503",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "38177917"
      ],
      "name": "Regulation of ER Proteostasis and the Unfolded Protein Response (UPR)",
      "interaction_effect": "inhibits",
      "interaction_direction": "primary_to_main_independent",
      "consequences": "ER stress → UBXN1 represses global protein translation → Reduced influx of new proteins into the ER → ER protein folding machinery load is decreased → UPR activation is repressed.",
      "function_effect": "inhibition"
    }
  ],
  "arrow": "complex",
  "direction": "bidirectional",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": "The claim that UBXN1 inhibits ERAD is a 'Contextual Error'. Recent evidence shows that loss of UBXN1 does not perturb VCP-dependent ERAD. Instead, UBXN1's role in ER proteostasis is attributed to its VCP-independent function as a repressor of protein translation. Its activating role in mitophagy is correct and well-supported.",
  "mechanism": "UBXN1 is a VCP cofactor that, upon mitochondrial depolarization, is recruited along with VCP to dama; UBXN1 contributes to ER proteostasis, but not by directly inhibiting VCP-mediated ERAD",
  "effect": "UBXN1 acts as a pro-mitophagic cofactor, ensuring the timely and efficient removal of mitochondrial proteins to allow for the progression of mitophagy.; UBXN1 helps maintain ER proteostasis by reducing the load of newly synthesized proteins, thereby alleviating ER stress. This is distinct from modulating the degradation of already misfolded proteins by the VCP-ERAD machinery.",
  "summary": "VCP activates UBXN1 to regulate mitophagy and er-associated degradation (erad), ultimately affecting mitochondrial processing and clearance via mitophagy are initiated.",
  "evidence": [
    {
      "paper_title": "VCP/p97 cofactor UBXN1/SAKS1 regulates mitophagy by modulating MFN2 removal from mitochondria",
      "journal": "Autophagy",
      "year": 2022,
      "relevant_quote": "Here we characterize the role of the UBA and UBX-domain containing VCP cofactor UBXN1/SAKS1 during mitophagy. Following mitochondrial depolarization and depending on PRKN, UBXN1 translocated alongside VCP to mitochondria... Mechanistically, UBXN1 acted downstream of PINK1 by facilitating MFN2 removal from mitochondria."
    },
    {
      "paper_title": "UBXN1 maintains ER proteostasis and represses UPR activation by modulating translation",
      "journal": "EMBO reports",
      "year": 2023,
      "relevant_quote": "Notably, we find that loss of UBXN1 does not perturb p97-dependent ER-associated degradation (ERAD). Our studies indicate that loss of UBXN1 increases translation in both resting and ER-stressed cells. Surprisingly, this process is independent of p97 function. Taken together, our studies have identified a new role for UBXN1 in repressing translation and maintaining ER proteostasis in a p97 independent manner."
    }
  ],
  "pathways": [
    {
      "name": "Mitophagy",
      "canonical_name": "Mitophagy",
      "ontology_id": "GO:0000423",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "ER-Associated Degradation",
      "canonical_name": "ER-Associated Degradation",
      "ontology_id": "GO:0036503",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "complex formation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 5
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP <--complex--> UBXN1:",
  "protein_a": "UBXN1",
  "protein_b": "VCP",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-06T04:46:06.391389Z",
  "last_updated": "2025-12-06T04:46:06.391389Z"
}