{
  "primary": "VCP",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "functions": [
    {
      "function": "Mitochondria-Associated Degradation (MAD)",
      "arrow": "activates",
      "cellular_process": "UBXD8 localizes to the outer mitochondrial membrane where it functions as a primary adaptor to recruit the VCP ATPase. This complex recognizes and extracts ubiquitinated proteins from the mitochondrial surface, facilitating their subsequent degradation by the proteasome. This process is a key component of mitochondrial protein quality control.",
      "effect_description": "UBXD8 is the major mitochondrial adaptor for VCP, targeting specific ubiquitinated outer mitochondrial membrane proteins for proteasomal degradation to maintain mitochondrial homeostasis and regulate apoptosis and mitophagy.",
      "biological_consequence": [
        "An outer mitochondrial membrane protein is ubiquitinated → UBXD8 binds the ubiquitinated substrate and recruits VCP → The VCP-UBXD8 complex utilizes ATP hydrolysis to extract the protein from the membrane → The extracted protein is delivered to the 26S proteasome for degradation."
      ],
      "specific_effects": [
        "Facilitates the degradation of the pro-survival protein Mcl1.",
        "Mediates the degradation of pro-apoptotic BH3-only proteins Noxa, Bik, and Bnip3, thereby restraining apoptosis and mitophagy."
      ],
      "evidence": [
        {
          "paper_title": "UBXD8 mediates mitochondria-associated degradation to restrain apoptosis and mitophagy",
          "journal": "The EMBO Journal",
          "year": 2022,
          "relevant_quote": "Collectively, our characterizations reveal UBXD8 as the major mitochondrial adaptor of VCP and unveil its role in apoptosis and mitophagy regulation. ... We identify pro-apoptotic BH3-only proteins Noxa, Bik, and Bnip3 as novel UBXD8 substrates and determine that UBXD8 inhibits apoptosis via degrading Noxa and restrains mitophagy via degrading Bnip3.",
          "pmid": "35979733"
        }
      ],
      "pathway": {
        "name": "Mitochondria-Associated Degradation",
        "canonical_name": "ER-Associated Degradation",
        "ontology_id": "GO:0036503",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "35979733"
      ],
      "interaction_effect": "activation",
      "interaction_direction": "primary_to_main",
      "function_effect": "activation"
    },
    {
      "function": "Lipolysis",
      "arrow": "inhibits",
      "cellular_process": "UBXD8 traffics to the surface of lipid droplets (LDs) and recruits VCP. On the LD, the VCP-UBXD8 complex directly binds to adipose triglyceride lipase (ATGL), the rate-limiting enzyme for the breakdown of triacylglycerols. The segregase activity of VCP then promotes the dissociation of ATGL's essential coactivator, CGI-58, which inactivates ATGL.",
      "effect_description": "By recruiting VCP to lipid droplets, UBXD8 functions as a potent negative regulator of lipolysis. This inhibition of fat breakdown leads to an increase in the size and number of cellular lipid droplets.",
      "biological_consequence": [
        "UBXD8 localizes to the lipid droplet surface and recruits VCP → The VCP-UBXD8 complex binds directly to ATGL → VCP ATPase activity mediates the dissociation of the ATGL-CGI-58 complex → ATGL lipase activity is inhibited → Triacylglycerol hydrolysis is suppressed, leading to lipid droplet accumulation."
      ],
      "specific_effects": [
        "The VCP-UBXD8 complex acts as a noncompetitive inhibitor of ATGL.",
        "Promotes the dissociation of the activated ATGL-CGI-58 complex."
      ],
      "evidence": [
        {
          "paper_title": "Spatial regulation of UBXD8 and p97/VCP controls ATGL-mediated lipid droplet turnover",
          "journal": "Proceedings of the National Academy of Sciences",
          "year": 2013,
          "relevant_quote": "We exploit this interaction to show that UBXD8-mediated recruitment of p97/VCP to LDs increases LD size by inhibiting the activity of adipose triglyceride lipase (ATGL), the rate-limiting enzyme in triacylglycerol hydrolysis. Our findings show that UBXD8 binds directly to ATGL and promotes dissociation of its endogenous coactivator, CGI-58.",
          "pmid": "23297223"
        }
      ],
      "pathway": {
        "name": "Lipid Metabolism",
        "canonical_name": "Lipid Metabolism",
        "ontology_id": "GO:0006629",
        "ontology_source": "GO",
        "confidence": 0.8
      },
      "pmids": [
        "23297223"
      ],
      "interaction_effect": "inhibition",
      "interaction_direction": "primary_to_main",
      "function_effect": "inhibition"
    }
  ],
  "support_summary": "UBXD8 is a VCP cofactor that localizes to the ER, mitochondria, and lipid droplets, where it recruits VCP to mediate protein degradation and regulate lipid metabolism.",
  "arrow": "regulates",
  "direction": "main_to_primary",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "is_valid": true,
  "mechanism_correction": null,
  "mechanism": "UBXD8 localizes to the outer mitochondrial membrane where it functions as a primary adaptor to recru; UBXD8 traffics to the surface of lipid droplets (LDs) and recruits VCP",
  "effect": "UBXD8 is the major mitochondrial adaptor for VCP, targeting specific ubiquitinated outer mitochondrial membrane proteins for proteasomal degradation to maintain mitochondrial homeostasis and regulate apoptosis and mitophagy.; By recruiting VCP to lipid droplets, UBXD8 functions as a potent negative regulator of lipolysis. This inhibition of fat breakdown leads to an increase in the size and number of cellular lipid droplets.",
  "summary": "VCP regulates UBXD8 to regulate mitochondria-associated degradation (mad) and lipolysis regulation, ultimately affecting the extracted protein is delivered to the 26s proteasome for degradation.",
  "evidence": [
    {
      "paper_title": "UBXD8 mediates mitochondria-associated degradation to restrain apoptosis and mitophagy",
      "journal": "The EMBO Journal",
      "year": 2022,
      "relevant_quote": "Collectively, our characterizations reveal UBXD8 as the major mitochondrial adaptor of VCP and unveil its role in apoptosis and mitophagy regulation. ... We identify pro-apoptotic BH3-only proteins Noxa, Bik, and Bnip3 as novel UBXD8 substrates and determine that UBXD8 inhibits apoptosis via degrading Noxa and restrains mitophagy via degrading Bnip3."
    },
    {
      "paper_title": "Spatial regulation of UBXD8 and p97/VCP controls ATGL-mediated lipid droplet turnover",
      "journal": "Proceedings of the National Academy of Sciences",
      "year": 2013,
      "relevant_quote": "We exploit this interaction to show that UBXD8-mediated recruitment of p97/VCP to LDs increases LD size by inhibiting the activity of adipose triglyceride lipase (ATGL), the rate-limiting enzyme in triacylglycerol hydrolysis. Our findings show that UBXD8 binds directly to ATGL and promotes dissociation of its endogenous coactivator, CGI-58."
    }
  ],
  "pathways": [
    {
      "name": "Lipid Metabolism",
      "canonical_name": "Lipid Metabolism",
      "ontology_id": "GO:0006629",
      "ontology_source": "GO",
      "confidence": 0.8
    },
    {
      "name": "Mitochondria-Associated Degradation",
      "canonical_name": "ER-Associated Degradation",
      "ontology_id": "GO:0036503",
      "ontology_source": "GO",
      "confidence": 0.8
    }
  ],
  "interaction_effect": "regulation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 3
  },
  "_arrow_validated": true,
  "arrow_notation": "VCP <--regulates-- UBXD8:",
  "protein_a": "UBXD8",
  "protein_b": "VCP",
  "discovered_in_query": "VCP",
  "first_discovered": "2025-12-06T04:46:06.446113Z",
  "last_updated": "2025-12-06T04:46:06.446113Z"
}